/* automatically generated by rust-bindgen 0.69.4 */

pub type va_list = *mut ::std::os::raw::c_char;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_less {
    pub _address: u8,
}
pub type std_less_first_argument_type = u8;
pub type std_less_second_argument_type = u8;
pub type std_less_result_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pair {
    pub _address: u8,
}
pub type std_pair_first_type = u8;
pub type std_pair_second_type = u8;
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std_forward_iterator_tag {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std_forward_iterator_tag() {
    assert_eq!(
        ::std::mem::size_of::<std_forward_iterator_tag>(),
        1usize,
        concat!("Size of: ", stringify!(std_forward_iterator_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<std_forward_iterator_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(std_forward_iterator_tag))
    );
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std_bidirectional_iterator_tag {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std_bidirectional_iterator_tag() {
    assert_eq!(
        ::std::mem::size_of::<std_bidirectional_iterator_tag>(),
        1usize,
        concat!("Size of: ", stringify!(std_bidirectional_iterator_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<std_bidirectional_iterator_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(std_bidirectional_iterator_tag))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator {
    pub _address: u8,
}
pub type std_allocator__From_primary = u8;
pub type std_allocator_value_type = u8;
pub type std_allocator_pointer = u8;
pub type std_allocator_const_pointer = u8;
pub type std_allocator_reference = u8;
pub type std_allocator_const_reference = u8;
pub type std_allocator_size_type = u32;
pub type std_allocator_difference_type = u32;
pub type std_allocator_propagate_on_container_move_assignment = u8;
pub type std_allocator_is_always_equal = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_rebind {
    pub _address: u8,
}
pub type std_allocator_rebind_other = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_char_traits {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_string {
    pub _address: u8,
}
pub type std_basic_string__Alty = u8;
pub type std_basic_string__Alty_traits = u8;
pub type std_basic_string__Scary_val = u8;
pub type std_basic_string_traits_type = u8;
pub type std_basic_string_allocator_type = u8;
pub type std_basic_string_value_type = u8;
pub type std_basic_string_size_type = u8;
pub type std_basic_string_difference_type = u8;
pub type std_basic_string_pointer = u8;
pub type std_basic_string_const_pointer = u8;
pub type std_basic_string_reference = u8;
pub type std_basic_string_const_reference = u8;
pub type std_basic_string_iterator = u8;
pub type std_basic_string_const_iterator = u8;
pub type std_basic_string_reverse_iterator = u8;
pub type std_basic_string_const_reverse_iterator = u8;
pub type std_basic_string__Is_elem_cptr = u8;
pub const std_basic_string__Allocation_policy__At_least: std_basic_string__Allocation_policy = 0;
pub const std_basic_string__Allocation_policy__Exactly: std_basic_string__Allocation_policy = 0;
pub type std_basic_string__Allocation_policy = ::std::os::raw::c_int;
pub const std_basic_string__Construct_strategy__From_char: std_basic_string__Construct_strategy = 0;
pub const std_basic_string__Construct_strategy__From_ptr: std_basic_string__Construct_strategy = 0;
pub const std_basic_string__Construct_strategy__From_string: std_basic_string__Construct_strategy =
    0;
pub type std_basic_string__Construct_strategy = ::std::os::raw::c_uchar;
pub type std_string = [u32; 6usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_set {
    pub _address: u8,
}
pub type std_set__Mybase = u8;
pub type std_set_key_type = u8;
pub type std_set_key_compare = u8;
pub type std_set_value_compare = u8;
pub type std_set_value_type = u8;
pub type std_set_allocator_type = u8;
pub type std_set_size_type = u8;
pub type std_set_difference_type = u8;
pub type std_set_pointer = u8;
pub type std_set_const_pointer = u8;
pub type std_set_reference = u8;
pub type std_set_const_reference = u8;
pub type std_set_iterator = u8;
pub type std_set_const_iterator = u8;
pub type std_set_reverse_iterator = u8;
pub type std_set_const_reverse_iterator = u8;
pub type std_set__Alnode = u8;
pub type std_set__Alnode_traits = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_map {
    pub _address: u8,
}
pub type std_map__Mybase = u8;
pub type std_map__Nodeptr = u8;
pub type std_map_key_type = u8;
pub type std_map_mapped_type = u8;
pub type std_map_key_compare = u8;
pub type std_map_value_compare = u8;
pub type std_map_value_type = u8;
pub type std_map_allocator_type = u8;
pub type std_map_size_type = u8;
pub type std_map_difference_type = u8;
pub type std_map_pointer = u8;
pub type std_map_const_pointer = u8;
pub type std_map_reference = u8;
pub type std_map_const_reference = u8;
pub type std_map_iterator = u8;
pub type std_map_const_iterator = u8;
pub type std_map_reverse_iterator = u8;
pub type std_map_const_reverse_iterator = u8;
pub type std_map__Alnode = u8;
pub type std_map__Alnode_traits = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_vector {
    pub _address: u8,
}
pub type std_vector__Alty = u8;
pub type std_vector__Alty_traits = u8;
pub type std_vector_value_type = u8;
pub type std_vector_allocator_type = u8;
pub type std_vector_pointer = u8;
pub type std_vector_const_pointer = u8;
pub type std_vector_reference = u8;
pub type std_vector_const_reference = u8;
pub type std_vector_size_type = u8;
pub type std_vector_difference_type = u8;
pub type std_vector__Scary_val = u8;
pub type std_vector_iterator = u8;
pub type std_vector_const_iterator = u8;
pub type std_vector_reverse_iterator = u8;
pub type std_vector_const_reverse_iterator = u8;
pub const std_vector__Reallocation_policy__At_least: std_vector__Reallocation_policy = 0;
pub const std_vector__Reallocation_policy__Exactly: std_vector__Reallocation_policy = 0;
pub type std_vector__Reallocation_policy = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_ostream {}
pub type std_basic_ostream__Myios = u8;
pub type std_basic_ostream__Mysb = u8;
pub type std_basic_ostream__Iter = u8;
pub type std_basic_ostream__Nput = u8;
pub type std_basic_ostream_int_type = u8;
pub type std_basic_ostream_pos_type = u8;
pub type std_basic_ostream_off_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_ostream__Sentry_base {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_ostream_sentry {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_istream {}
pub type std_basic_istream__Myios = u8;
pub type std_basic_istream__Mysb = u8;
pub type std_basic_istream__Iter = u8;
pub type std_basic_istream__Ctype = u8;
pub type std_basic_istream__Nget = u8;
pub type std_basic_istream_int_type = u8;
pub type std_basic_istream_pos_type = u8;
pub type std_basic_istream_off_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_istream__Sentry_base {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_istream_sentry {
    pub _address: u8,
}
#[repr(C)]
pub struct cocos2d_CCDataVisitor__bindgen_vtable(::std::os::raw::c_void);
#[doc = " Visitor that helps to perform action that depends on polymorphic object type\n\n Use cases:\n  - data serialization,\n  - pretty printing of \\a CCObject *\n  - safe value reading from \\a CCArray, \\a CCDictionary, \\a CCSet\n\n Usage:\n  1. subclass CCDataVisitor\n  2. overload visit() methods for object that you need to handle\n  3. handle other objects in \\a visitObject()\n  4. pass your visitor to \\a CCObject::acceptVisitor()\n  @js NA\n  @lua NA"]
#[repr(C)]
#[derive(Debug)]
pub struct cocos2d_CCDataVisitor {
    pub vtable_: *const cocos2d_CCDataVisitor__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_cocos2d_CCDataVisitor() {
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCDataVisitor>(),
        4usize,
        concat!("Size of: ", stringify!(cocos2d_CCDataVisitor))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCDataVisitor>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCDataVisitor))
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?visit@CCDataVisitor@cocos2d@@UAEXPBVCCBool@2@@Z"]
    pub fn cocos2d_CCDataVisitor_visit(this: *mut ::std::os::raw::c_void, p: *const cocos2d_CCBool);
}
extern "thiscall" {
    #[link_name = "\u{1}?visit@CCDataVisitor@cocos2d@@UAEXPBVCCInteger@2@@Z"]
    pub fn cocos2d_CCDataVisitor_visit1(
        this: *mut ::std::os::raw::c_void,
        p: *const cocos2d_CCInteger,
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?visit@CCDataVisitor@cocos2d@@UAEXPBVCCFloat@2@@Z"]
    pub fn cocos2d_CCDataVisitor_visit2(
        this: *mut ::std::os::raw::c_void,
        p: *const cocos2d_CCFloat,
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?visit@CCDataVisitor@cocos2d@@UAEXPBVCCDouble@2@@Z"]
    pub fn cocos2d_CCDataVisitor_visit3(
        this: *mut ::std::os::raw::c_void,
        p: *const cocos2d_CCDouble,
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?visit@CCDataVisitor@cocos2d@@UAEXPBVCCString@2@@Z"]
    pub fn cocos2d_CCDataVisitor_visit4(
        this: *mut ::std::os::raw::c_void,
        p: *const cocos2d_CCString,
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?visit@CCDataVisitor@cocos2d@@UAEXPBVCCArray@2@@Z"]
    pub fn cocos2d_CCDataVisitor_visit5(
        this: *mut ::std::os::raw::c_void,
        p: *const cocos2d_CCArray,
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?visit@CCDataVisitor@cocos2d@@UAEXPBVCCDictionary@2@@Z"]
    pub fn cocos2d_CCDataVisitor_visit6(
        this: *mut ::std::os::raw::c_void,
        p: *const cocos2d_CCDictionary,
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?visit@CCDataVisitor@cocos2d@@UAEXPBVCCSet@2@@Z"]
    pub fn cocos2d_CCDataVisitor_visit7(this: *mut ::std::os::raw::c_void, p: *const cocos2d_CCSet);
}
#[doc = "  @js NA\n  @lua NA"]
#[repr(C)]
#[derive(Debug)]
pub struct cocos2d_CCPrettyPrinter {
    pub _base: cocos2d_CCDataVisitor,
    pub _indentLevel: ::std::os::raw::c_int,
    pub _indentStr: std_string,
    pub _result: std_string,
}
#[test]
fn bindgen_test_layout_cocos2d_CCPrettyPrinter() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d_CCPrettyPrinter> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCPrettyPrinter>(),
        56usize,
        concat!("Size of: ", stringify!(cocos2d_CCPrettyPrinter))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCPrettyPrinter>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCPrettyPrinter))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._indentLevel) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCPrettyPrinter),
            "::",
            stringify!(_indentLevel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._indentStr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCPrettyPrinter),
            "::",
            stringify!(_indentStr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._result) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCPrettyPrinter),
            "::",
            stringify!(_result)
        )
    );
}
extern "thiscall" {
    #[link_name = "\u{1}??0CCPrettyPrinter@cocos2d@@QAE@H@Z"]
    pub fn cocos2d_CCPrettyPrinter_CCPrettyPrinter(
        this: *mut cocos2d_CCPrettyPrinter,
        indentLevel: ::std::os::raw::c_int,
    );
}
impl cocos2d_CCPrettyPrinter {
    #[inline]
    pub unsafe fn new(indentLevel: ::std::os::raw::c_int) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        cocos2d_CCPrettyPrinter_CCPrettyPrinter(__bindgen_tmp.as_mut_ptr(), indentLevel);
        __bindgen_tmp.assume_init()
    }
}
extern "thiscall" {
    #[link_name = "\u{1}?clear@CCPrettyPrinter@cocos2d@@UAEXXZ"]
    pub fn cocos2d_CCPrettyPrinter_clear(this: *mut ::std::os::raw::c_void);
}
extern "thiscall" {
    #[link_name = "\u{1}?getResult@CCPrettyPrinter@cocos2d@@UAE?AV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@XZ"]
    pub fn cocos2d_CCPrettyPrinter_getResult(this: *mut ::std::os::raw::c_void) -> std_string;
}
extern "thiscall" {
    #[link_name = "\u{1}?visitObject@CCPrettyPrinter@cocos2d@@UAEXPBVCCObject@2@@Z"]
    pub fn cocos2d_CCPrettyPrinter_visitObject(
        this: *mut ::std::os::raw::c_void,
        p: *const cocos2d_CCObject,
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?visit@CCPrettyPrinter@cocos2d@@UAEXPBVCCBool@2@@Z"]
    pub fn cocos2d_CCPrettyPrinter_visit(
        this: *mut ::std::os::raw::c_void,
        p: *const cocos2d_CCBool,
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?visit@CCPrettyPrinter@cocos2d@@UAEXPBVCCInteger@2@@Z"]
    pub fn cocos2d_CCPrettyPrinter_visit1(
        this: *mut ::std::os::raw::c_void,
        p: *const cocos2d_CCInteger,
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?visit@CCPrettyPrinter@cocos2d@@UAEXPBVCCFloat@2@@Z"]
    pub fn cocos2d_CCPrettyPrinter_visit2(
        this: *mut ::std::os::raw::c_void,
        p: *const cocos2d_CCFloat,
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?visit@CCPrettyPrinter@cocos2d@@UAEXPBVCCDouble@2@@Z"]
    pub fn cocos2d_CCPrettyPrinter_visit3(
        this: *mut ::std::os::raw::c_void,
        p: *const cocos2d_CCDouble,
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?visit@CCPrettyPrinter@cocos2d@@UAEXPBVCCString@2@@Z"]
    pub fn cocos2d_CCPrettyPrinter_visit4(
        this: *mut ::std::os::raw::c_void,
        p: *const cocos2d_CCString,
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?visit@CCPrettyPrinter@cocos2d@@UAEXPBVCCArray@2@@Z"]
    pub fn cocos2d_CCPrettyPrinter_visit5(
        this: *mut ::std::os::raw::c_void,
        p: *const cocos2d_CCArray,
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?visit@CCPrettyPrinter@cocos2d@@UAEXPBVCCDictionary@2@@Z"]
    pub fn cocos2d_CCPrettyPrinter_visit6(
        this: *mut ::std::os::raw::c_void,
        p: *const cocos2d_CCDictionary,
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?visit@CCPrettyPrinter@cocos2d@@UAEXPBVCCSet@2@@Z"]
    pub fn cocos2d_CCPrettyPrinter_visit7(
        this: *mut ::std::os::raw::c_void,
        p: *const cocos2d_CCSet,
    );
}
#[doc = " The max length of CCLog message."]
pub const cocos2d_kMaxLogLen: ::std::os::raw::c_int = 16384;
extern "C" {
    #[doc = "@brief Output Debug message."]
    #[link_name = "\u{1}?CCLog@cocos2d@@YAXPBDZZ"]
    pub fn cocos2d_CCLog(pszFormat: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    #[doc = " lua can not deal with ..."]
    #[link_name = "\u{1}?CCLuaLog@cocos2d@@YAXPBD@Z"]
    pub fn cocos2d_CCLuaLog(pszFormat: *const ::std::os::raw::c_char);
}
extern "C" {
    #[doc = "@brief Pop out a message box"]
    #[link_name = "\u{1}?CCMessageBox@cocos2d@@YAXPBD0@Z"]
    pub fn cocos2d_CCMessageBox(
        pszMsg: *const ::std::os::raw::c_char,
        pszTitle: *const ::std::os::raw::c_char,
    );
}
pub const cocos2d_LanguageType_kLanguageEnglish: cocos2d_LanguageType = 0;
pub const cocos2d_LanguageType_kLanguageChinese: cocos2d_LanguageType = 1;
pub const cocos2d_LanguageType_kLanguageFrench: cocos2d_LanguageType = 2;
pub const cocos2d_LanguageType_kLanguageItalian: cocos2d_LanguageType = 3;
pub const cocos2d_LanguageType_kLanguageGerman: cocos2d_LanguageType = 4;
pub const cocos2d_LanguageType_kLanguageSpanish: cocos2d_LanguageType = 5;
pub const cocos2d_LanguageType_kLanguageDutch: cocos2d_LanguageType = 6;
pub const cocos2d_LanguageType_kLanguageRussian: cocos2d_LanguageType = 7;
pub const cocos2d_LanguageType_kLanguageKorean: cocos2d_LanguageType = 8;
pub const cocos2d_LanguageType_kLanguageJapanese: cocos2d_LanguageType = 9;
pub const cocos2d_LanguageType_kLanguageHungarian: cocos2d_LanguageType = 10;
pub const cocos2d_LanguageType_kLanguagePortuguese: cocos2d_LanguageType = 11;
pub const cocos2d_LanguageType_kLanguageArabic: cocos2d_LanguageType = 12;
#[doc = "@brief Enum the language type supported now"]
pub type cocos2d_LanguageType = ::std::os::raw::c_int;
#[doc = "@brief Enum the language type supported now"]
pub use self::cocos2d_LanguageType as cocos2d_ccLanguageType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d_timezone {
    pub tz_minuteswest: ::std::os::raw::c_int,
    pub tz_dsttime: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_cocos2d_timezone() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d_timezone> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d_timezone>(),
        8usize,
        concat!("Size of: ", stringify!(cocos2d_timezone))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_timezone>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_timezone))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tz_minuteswest) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_timezone),
            "::",
            stringify!(tz_minuteswest)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tz_dsttime) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_timezone),
            "::",
            stringify!(tz_dsttime)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}?gettimeofday@cocos2d@@YAHPAUtimeval@@PAUtimezone@1@@Z"]
    pub fn cocos2d_gettimeofday(
        arg1: *mut timeval,
        arg2: *mut cocos2d_timezone,
    ) -> ::std::os::raw::c_int;
}
pub const cocos2d_CCObjectType_kCCObjectTypePlayLayer: cocos2d_CCObjectType = 5;
pub const cocos2d_CCObjectType_kCCObjectTypeLevelEditorLayer: cocos2d_CCObjectType = 6;
pub const cocos2d_CCObjectType_kCCObjectTypeMenuLayer: cocos2d_CCObjectType = 15;
#[doc = " @addtogroup base_nodes\n @{"]
pub type cocos2d_CCObjectType = ::std::os::raw::c_int;
#[repr(C)]
pub struct cocos2d_CCCopying__bindgen_vtable(::std::os::raw::c_void);
#[doc = " @js NA\n @lua NA"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d_CCCopying {
    pub vtable_: *const cocos2d_CCCopying__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_cocos2d_CCCopying() {
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCCopying>(),
        4usize,
        concat!("Size of: ", stringify!(cocos2d_CCCopying))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCCopying>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCCopying))
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?copyWithZone@CCCopying@cocos2d@@UAEPAVCCObject@2@PAVCCZone@2@@Z"]
    pub fn cocos2d_CCCopying_copyWithZone(
        this: *mut ::std::os::raw::c_void,
        pZone: *mut cocos2d_CCZone,
    ) -> *mut cocos2d_CCObject;
}
#[doc = " @addtogroup data_structures\n @{"]
#[repr(C)]
#[derive(Debug)]
pub struct cocos2d_CCObject {
    pub _base: cocos2d_CCCopying,
    pub m_uID: ::std::os::raw::c_uint,
    pub m_nLuaID: ::std::os::raw::c_int,
    pub m_nTag: ::std::os::raw::c_int,
    pub m_uReference: ::std::os::raw::c_uint,
    pub m_uAutoReleaseCount: ::std::os::raw::c_uint,
    pub m_eObjType: cocos2d_CCObjectType,
    pub m_uIndexInArray: ::std::os::raw::c_int,
    pub m_uUnknown: ::std::os::raw::c_int,
    pub m_unknown2: ::std::os::raw::c_int,
    pub m_nZOrder: ::std::os::raw::c_int,
    pub m_uOrderOfArrival: ::std::os::raw::c_int,
    pub m_unknown5: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_cocos2d_CCObject() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d_CCObject> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCObject>(),
        52usize,
        concat!("Size of: ", stringify!(cocos2d_CCObject))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCObject>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCObject))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_uID) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCObject),
            "::",
            stringify!(m_uID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_nLuaID) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCObject),
            "::",
            stringify!(m_nLuaID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_nTag) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCObject),
            "::",
            stringify!(m_nTag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_uReference) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCObject),
            "::",
            stringify!(m_uReference)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_uAutoReleaseCount) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCObject),
            "::",
            stringify!(m_uAutoReleaseCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_eObjType) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCObject),
            "::",
            stringify!(m_eObjType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_uIndexInArray) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCObject),
            "::",
            stringify!(m_uIndexInArray)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_uUnknown) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCObject),
            "::",
            stringify!(m_uUnknown)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_unknown2) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCObject),
            "::",
            stringify!(m_unknown2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_nZOrder) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCObject),
            "::",
            stringify!(m_nZOrder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_uOrderOfArrival) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCObject),
            "::",
            stringify!(m_uOrderOfArrival)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_unknown5) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCObject),
            "::",
            stringify!(m_unknown5)
        )
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?release@CCObject@cocos2d@@QAEXXZ"]
    pub fn cocos2d_CCObject_release(this: *mut cocos2d_CCObject);
}
extern "thiscall" {
    #[link_name = "\u{1}?retain@CCObject@cocos2d@@QAEXXZ"]
    pub fn cocos2d_CCObject_retain(this: *mut cocos2d_CCObject);
}
extern "thiscall" {
    #[link_name = "\u{1}?autorelease@CCObject@cocos2d@@QAEPAV12@XZ"]
    pub fn cocos2d_CCObject_autorelease(this: *mut cocos2d_CCObject) -> *mut cocos2d_CCObject;
}
extern "thiscall" {
    #[link_name = "\u{1}?copy@CCObject@cocos2d@@QAEPAV12@XZ"]
    pub fn cocos2d_CCObject_copy(this: *mut cocos2d_CCObject) -> *mut cocos2d_CCObject;
}
extern "thiscall" {
    #[link_name = "\u{1}?isSingleReference@CCObject@cocos2d@@QBE_NXZ"]
    pub fn cocos2d_CCObject_isSingleReference(this: *const cocos2d_CCObject) -> bool;
}
extern "C" {
    #[link_name = "\u{1}?createWithCoder@CCObject@cocos2d@@SAPAV12@PAVDS_Dictionary@@@Z"]
    pub fn cocos2d_CCObject_createWithCoder(arg1: *mut DS_Dictionary) -> *mut cocos2d_CCObject;
}
extern "thiscall" {
    #[link_name = "\u{1}??0CCObject@cocos2d@@QAE@XZ"]
    pub fn cocos2d_CCObject_CCObject(this: *mut cocos2d_CCObject);
}
impl cocos2d_CCObject {
    #[inline]
    pub unsafe fn release(&mut self) {
        cocos2d_CCObject_release(self)
    }
    #[inline]
    pub unsafe fn retain(&mut self) {
        cocos2d_CCObject_retain(self)
    }
    #[inline]
    pub unsafe fn autorelease(&mut self) -> *mut cocos2d_CCObject {
        cocos2d_CCObject_autorelease(self)
    }
    #[inline]
    pub unsafe fn copy(&mut self) -> *mut cocos2d_CCObject {
        cocos2d_CCObject_copy(self)
    }
    #[inline]
    pub unsafe fn isSingleReference(&self) -> bool {
        cocos2d_CCObject_isSingleReference(self)
    }
    #[inline]
    pub unsafe fn createWithCoder(arg1: *mut DS_Dictionary) -> *mut cocos2d_CCObject {
        cocos2d_CCObject_createWithCoder(arg1)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        cocos2d_CCObject_CCObject(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
}
extern "thiscall" {
    #[doc = "  @lua NA"]
    #[link_name = "\u{1}??1CCObject@cocos2d@@UAE@XZ"]
    pub fn cocos2d_CCObject_CCObject_destructor(this: *mut cocos2d_CCObject);
}
extern "thiscall" {
    #[link_name = "\u{1}?isEqual@CCObject@cocos2d@@UAE_NPBV12@@Z"]
    pub fn cocos2d_CCObject_isEqual(
        this: *mut ::std::os::raw::c_void,
        pObject: *const cocos2d_CCObject,
    ) -> bool;
}
extern "thiscall" {
    #[link_name = "\u{1}?acceptVisitor@CCObject@cocos2d@@UAEXAAVCCDataVisitor@2@@Z"]
    pub fn cocos2d_CCObject_acceptVisitor(
        this: *mut ::std::os::raw::c_void,
        visitor: *mut cocos2d_CCDataVisitor,
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?encodeWithCoder@CCObject@cocos2d@@UAEXPAVDS_Dictionary@@@Z"]
    pub fn cocos2d_CCObject_encodeWithCoder(
        this: *mut ::std::os::raw::c_void,
        arg1: *mut DS_Dictionary,
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?canEncode@CCObject@cocos2d@@UAE_NXZ"]
    pub fn cocos2d_CCObject_canEncode(this: *mut ::std::os::raw::c_void) -> bool;
}
extern "thiscall" {
    #[link_name = "\u{1}?getTag@CCObject@cocos2d@@UBEHXZ"]
    pub fn cocos2d_CCObject_getTag(this: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "thiscall" {
    #[link_name = "\u{1}?setTag@CCObject@cocos2d@@UAEXH@Z"]
    pub fn cocos2d_CCObject_setTag(this: *mut ::std::os::raw::c_void, nTag: ::std::os::raw::c_int);
}
pub type cocos2d_SEL_SCHEDULE = ::std::option::Option<unsafe extern "thiscall" fn(arg1: f32)>;
pub type cocos2d_SEL_CallFunc = ::std::option::Option<unsafe extern "thiscall" fn()>;
pub type cocos2d_SEL_CallFuncN =
    ::std::option::Option<unsafe extern "thiscall" fn(arg1: *mut cocos2d_CCNode)>;
pub type cocos2d_SEL_CallFuncND = ::std::option::Option<
    unsafe extern "thiscall" fn(arg1: *mut cocos2d_CCNode, arg2: *mut ::std::os::raw::c_void),
>;
pub type cocos2d_SEL_CallFuncO =
    ::std::option::Option<unsafe extern "thiscall" fn(arg1: *mut cocos2d_CCObject)>;
pub type cocos2d_SEL_MenuHandler =
    ::std::option::Option<unsafe extern "thiscall" fn(arg1: *mut cocos2d_CCObject)>;
pub type cocos2d_SEL_EventHandler =
    ::std::option::Option<unsafe extern "thiscall" fn(arg1: *mut cocos2d_CCEvent)>;
pub type cocos2d_SEL_Compare = ::std::option::Option<
    unsafe extern "thiscall" fn(arg1: *mut cocos2d_CCObject) -> ::std::os::raw::c_int,
>;
#[doc = " @js NA"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d_CCPoint {
    pub x: f32,
    pub y: f32,
}
#[test]
fn bindgen_test_layout_cocos2d_CCPoint() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d_CCPoint> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCPoint>(),
        8usize,
        concat!("Size of: ", stringify!(cocos2d_CCPoint))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCPoint>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCPoint))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCPoint),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCPoint),
            "::",
            stringify!(y)
        )
    );
}
extern "thiscall" {
    #[doc = " @lua NA"]
    #[link_name = "\u{1}?setPoint@CCPoint@cocos2d@@QAEXMM@Z"]
    pub fn cocos2d_CCPoint_setPoint(this: *mut cocos2d_CCPoint, x: f32, y: f32);
}
extern "thiscall" {
    #[link_name = "\u{1}?equals@CCPoint@cocos2d@@QBE_NABV12@@Z"]
    pub fn cocos2d_CCPoint_equals(
        this: *const cocos2d_CCPoint,
        target: *const cocos2d_CCPoint,
    ) -> bool;
}
extern "thiscall" {
    #[doc = " @returns if points have fuzzy equality which means equal with some degree of variance.\n @since v2.1.4\n @lua NA"]
    #[link_name = "\u{1}?fuzzyEquals@CCPoint@cocos2d@@QBE_NABV12@M@Z"]
    pub fn cocos2d_CCPoint_fuzzyEquals(
        this: *const cocos2d_CCPoint,
        target: *const cocos2d_CCPoint,
        variance: f32,
    ) -> bool;
}
extern "thiscall" {
    #[doc = " @returns the angle in radians between two vector directions\n@since v2.1.4"]
    #[link_name = "\u{1}?getAngle@CCPoint@cocos2d@@QBEMABV12@@Z"]
    pub fn cocos2d_CCPoint_getAngle(
        this: *const cocos2d_CCPoint,
        other: *const cocos2d_CCPoint,
    ) -> f32;
}
extern "thiscall" {
    #[doc = " Rotates a point counter clockwise by the angle around a pivot\n@param pivot is the pivot, naturally\n@param angle is the angle of rotation ccw in radians\n@returns the rotated point\n@since v2.1.4"]
    #[link_name = "\u{1}?rotateByAngle@CCPoint@cocos2d@@QBE?AV12@ABV12@M@Z"]
    pub fn cocos2d_CCPoint_rotateByAngle(
        this: *const cocos2d_CCPoint,
        pivot: *const cocos2d_CCPoint,
        angle: f32,
    ) -> cocos2d_CCPoint;
}
extern "thiscall" {
    #[link_name = "\u{1}??0CCPoint@cocos2d@@QAE@XZ"]
    pub fn cocos2d_CCPoint_CCPoint(this: *mut cocos2d_CCPoint);
}
extern "thiscall" {
    #[link_name = "\u{1}??0CCPoint@cocos2d@@QAE@MM@Z"]
    pub fn cocos2d_CCPoint_CCPoint1(this: *mut cocos2d_CCPoint, x: f32, y: f32);
}
extern "thiscall" {
    #[doc = " @lua NA"]
    #[link_name = "\u{1}??0CCPoint@cocos2d@@QAE@ABV01@@Z"]
    pub fn cocos2d_CCPoint_CCPoint2(this: *mut cocos2d_CCPoint, other: *const cocos2d_CCPoint);
}
extern "thiscall" {
    #[doc = " @lua NA"]
    #[link_name = "\u{1}??0CCPoint@cocos2d@@QAE@ABVCCSize@1@@Z"]
    pub fn cocos2d_CCPoint_CCPoint3(this: *mut cocos2d_CCPoint, size: *const cocos2d_CCSize);
}
impl cocos2d_CCPoint {
    #[inline]
    pub unsafe fn setPoint(&mut self, x: f32, y: f32) {
        cocos2d_CCPoint_setPoint(self, x, y)
    }
    #[inline]
    pub unsafe fn equals(&self, target: *const cocos2d_CCPoint) -> bool {
        cocos2d_CCPoint_equals(self, target)
    }
    #[inline]
    pub unsafe fn fuzzyEquals(&self, target: *const cocos2d_CCPoint, variance: f32) -> bool {
        cocos2d_CCPoint_fuzzyEquals(self, target, variance)
    }
    #[inline]
    pub unsafe fn getAngle(&self, other: *const cocos2d_CCPoint) -> f32 {
        cocos2d_CCPoint_getAngle(self, other)
    }
    #[inline]
    pub unsafe fn rotateByAngle(
        &self,
        pivot: *const cocos2d_CCPoint,
        angle: f32,
    ) -> cocos2d_CCPoint {
        cocos2d_CCPoint_rotateByAngle(self, pivot, angle)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        cocos2d_CCPoint_CCPoint(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(x: f32, y: f32) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        cocos2d_CCPoint_CCPoint1(__bindgen_tmp.as_mut_ptr(), x, y);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(other: *const cocos2d_CCPoint) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        cocos2d_CCPoint_CCPoint2(__bindgen_tmp.as_mut_ptr(), other);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new3(size: *const cocos2d_CCSize) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        cocos2d_CCPoint_CCPoint3(__bindgen_tmp.as_mut_ptr(), size);
        __bindgen_tmp.assume_init()
    }
}
#[doc = " @addtogroup data_structures\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d_CCSize {
    pub width: f32,
    pub height: f32,
}
#[test]
fn bindgen_test_layout_cocos2d_CCSize() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d_CCSize> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCSize>(),
        8usize,
        concat!("Size of: ", stringify!(cocos2d_CCSize))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCSize>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCSize))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCSize),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCSize),
            "::",
            stringify!(height)
        )
    );
}
extern "thiscall" {
    #[doc = " @lua NA"]
    #[link_name = "\u{1}?setSize@CCSize@cocos2d@@QAEXMM@Z"]
    pub fn cocos2d_CCSize_setSize(this: *mut cocos2d_CCSize, width: f32, height: f32);
}
extern "thiscall" {
    #[doc = " @lua NA"]
    #[link_name = "\u{1}?equals@CCSize@cocos2d@@QBE_NABV12@@Z"]
    pub fn cocos2d_CCSize_equals(
        this: *const cocos2d_CCSize,
        target: *const cocos2d_CCSize,
    ) -> bool;
}
extern "thiscall" {
    #[link_name = "\u{1}??0CCSize@cocos2d@@QAE@XZ"]
    pub fn cocos2d_CCSize_CCSize(this: *mut cocos2d_CCSize);
}
extern "thiscall" {
    #[link_name = "\u{1}??0CCSize@cocos2d@@QAE@MM@Z"]
    pub fn cocos2d_CCSize_CCSize1(this: *mut cocos2d_CCSize, width: f32, height: f32);
}
extern "thiscall" {
    #[doc = " @lua NA"]
    #[link_name = "\u{1}??0CCSize@cocos2d@@QAE@ABV01@@Z"]
    pub fn cocos2d_CCSize_CCSize2(this: *mut cocos2d_CCSize, other: *const cocos2d_CCSize);
}
extern "thiscall" {
    #[doc = " @lua NA"]
    #[link_name = "\u{1}??0CCSize@cocos2d@@QAE@ABVCCPoint@1@@Z"]
    pub fn cocos2d_CCSize_CCSize3(this: *mut cocos2d_CCSize, point: *const cocos2d_CCPoint);
}
impl cocos2d_CCSize {
    #[inline]
    pub unsafe fn setSize(&mut self, width: f32, height: f32) {
        cocos2d_CCSize_setSize(self, width, height)
    }
    #[inline]
    pub unsafe fn equals(&self, target: *const cocos2d_CCSize) -> bool {
        cocos2d_CCSize_equals(self, target)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        cocos2d_CCSize_CCSize(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(width: f32, height: f32) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        cocos2d_CCSize_CCSize1(__bindgen_tmp.as_mut_ptr(), width, height);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(other: *const cocos2d_CCSize) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        cocos2d_CCSize_CCSize2(__bindgen_tmp.as_mut_ptr(), other);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new3(point: *const cocos2d_CCPoint) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        cocos2d_CCSize_CCSize3(__bindgen_tmp.as_mut_ptr(), point);
        __bindgen_tmp.assume_init()
    }
}
#[doc = " @js NA"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d_CCRect {
    pub origin: cocos2d_CCPoint,
    pub size: cocos2d_CCSize,
}
#[test]
fn bindgen_test_layout_cocos2d_CCRect() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d_CCRect> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCRect>(),
        16usize,
        concat!("Size of: ", stringify!(cocos2d_CCRect))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCRect>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCRect))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).origin) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCRect),
            "::",
            stringify!(origin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCRect),
            "::",
            stringify!(size)
        )
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?setRect@CCRect@cocos2d@@QAEXMMMM@Z"]
    pub fn cocos2d_CCRect_setRect(
        this: *mut cocos2d_CCRect,
        x: f32,
        y: f32,
        width: f32,
        height: f32,
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?getMinX@CCRect@cocos2d@@QBEMXZ"]
    pub fn cocos2d_CCRect_getMinX(this: *const cocos2d_CCRect) -> f32;
}
extern "thiscall" {
    #[doc = " return the leftmost x-value of current rect"]
    #[link_name = "\u{1}?getMidX@CCRect@cocos2d@@QBEMXZ"]
    pub fn cocos2d_CCRect_getMidX(this: *const cocos2d_CCRect) -> f32;
}
extern "thiscall" {
    #[doc = " return the midpoint x-value of current rect"]
    #[link_name = "\u{1}?getMaxX@CCRect@cocos2d@@QBEMXZ"]
    pub fn cocos2d_CCRect_getMaxX(this: *const cocos2d_CCRect) -> f32;
}
extern "thiscall" {
    #[doc = " return the rightmost x-value of current rect"]
    #[link_name = "\u{1}?getMinY@CCRect@cocos2d@@QBEMXZ"]
    pub fn cocos2d_CCRect_getMinY(this: *const cocos2d_CCRect) -> f32;
}
extern "thiscall" {
    #[doc = " return the bottommost y-value of current rect"]
    #[link_name = "\u{1}?getMidY@CCRect@cocos2d@@QBEMXZ"]
    pub fn cocos2d_CCRect_getMidY(this: *const cocos2d_CCRect) -> f32;
}
extern "thiscall" {
    #[doc = " return the midpoint y-value of current rect"]
    #[link_name = "\u{1}?getMaxY@CCRect@cocos2d@@QBEMXZ"]
    pub fn cocos2d_CCRect_getMaxY(this: *const cocos2d_CCRect) -> f32;
}
extern "thiscall" {
    #[doc = " return the topmost y-value of current rect"]
    #[link_name = "\u{1}?equals@CCRect@cocos2d@@QBE_NABV12@@Z"]
    pub fn cocos2d_CCRect_equals(this: *const cocos2d_CCRect, rect: *const cocos2d_CCRect) -> bool;
}
extern "thiscall" {
    #[link_name = "\u{1}?containsPoint@CCRect@cocos2d@@QBE_NABVCCPoint@2@@Z"]
    pub fn cocos2d_CCRect_containsPoint(
        this: *const cocos2d_CCRect,
        point: *const cocos2d_CCPoint,
    ) -> bool;
}
extern "thiscall" {
    #[link_name = "\u{1}?intersectsRect@CCRect@cocos2d@@QBE_NABV12@@Z"]
    pub fn cocos2d_CCRect_intersectsRect(
        this: *const cocos2d_CCRect,
        rect: *const cocos2d_CCRect,
    ) -> bool;
}
extern "thiscall" {
    #[link_name = "\u{1}??0CCRect@cocos2d@@QAE@XZ"]
    pub fn cocos2d_CCRect_CCRect(this: *mut cocos2d_CCRect);
}
extern "thiscall" {
    #[link_name = "\u{1}??0CCRect@cocos2d@@QAE@MMMM@Z"]
    pub fn cocos2d_CCRect_CCRect1(
        this: *mut cocos2d_CCRect,
        x: f32,
        y: f32,
        width: f32,
        height: f32,
    );
}
extern "thiscall" {
    #[doc = " @lua NA"]
    #[link_name = "\u{1}??0CCRect@cocos2d@@QAE@ABV01@@Z"]
    pub fn cocos2d_CCRect_CCRect2(this: *mut cocos2d_CCRect, other: *const cocos2d_CCRect);
}
impl cocos2d_CCRect {
    #[inline]
    pub unsafe fn setRect(&mut self, x: f32, y: f32, width: f32, height: f32) {
        cocos2d_CCRect_setRect(self, x, y, width, height)
    }
    #[inline]
    pub unsafe fn getMinX(&self) -> f32 {
        cocos2d_CCRect_getMinX(self)
    }
    #[inline]
    pub unsafe fn getMidX(&self) -> f32 {
        cocos2d_CCRect_getMidX(self)
    }
    #[inline]
    pub unsafe fn getMaxX(&self) -> f32 {
        cocos2d_CCRect_getMaxX(self)
    }
    #[inline]
    pub unsafe fn getMinY(&self) -> f32 {
        cocos2d_CCRect_getMinY(self)
    }
    #[inline]
    pub unsafe fn getMidY(&self) -> f32 {
        cocos2d_CCRect_getMidY(self)
    }
    #[inline]
    pub unsafe fn getMaxY(&self) -> f32 {
        cocos2d_CCRect_getMaxY(self)
    }
    #[inline]
    pub unsafe fn equals(&self, rect: *const cocos2d_CCRect) -> bool {
        cocos2d_CCRect_equals(self, rect)
    }
    #[inline]
    pub unsafe fn containsPoint(&self, point: *const cocos2d_CCPoint) -> bool {
        cocos2d_CCRect_containsPoint(self, point)
    }
    #[inline]
    pub unsafe fn intersectsRect(&self, rect: *const cocos2d_CCRect) -> bool {
        cocos2d_CCRect_intersectsRect(self, rect)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        cocos2d_CCRect_CCRect(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(x: f32, y: f32, width: f32, height: f32) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        cocos2d_CCRect_CCRect1(__bindgen_tmp.as_mut_ptr(), x, y, width, height);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(other: *const cocos2d_CCRect) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        cocos2d_CCRect_CCRect2(__bindgen_tmp.as_mut_ptr(), other);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}?CCPointZero@cocos2d@@3VCCPoint@1@B"]
    pub static cocos2d_CCPointZero: cocos2d_CCPoint;
}
extern "C" {
    #[link_name = "\u{1}?CCSizeZero@cocos2d@@3VCCSize@1@B"]
    pub static cocos2d_CCSizeZero: cocos2d_CCSize;
}
extern "C" {
    #[link_name = "\u{1}?CCRectZero@cocos2d@@3VCCRect@1@B"]
    pub static cocos2d_CCRectZero: cocos2d_CCRect;
}
#[doc = "! Default tag"]
pub const kCCActionTagInvalid: cocos2d__bindgen_ty_1 = -1;
pub type cocos2d__bindgen_ty_1 = ::std::os::raw::c_int;
#[doc = "@brief Base class for CCAction objects."]
#[repr(C)]
#[derive(Debug)]
pub struct cocos2d_CCAction {
    pub _base: cocos2d_CCObject,
    pub m_pOriginalTarget: *mut cocos2d_CCNode,
    #[doc = " The \"target\".\nThe target will be set with the 'startWithTarget' method.\nWhen the 'stop' method is called, target will be set to nil.\nThe target is 'assigned', it is not 'retained'."]
    pub m_pTarget: *mut cocos2d_CCNode,
    #[doc = " The action tag. An identifier of the action"]
    pub m_nTag: ::std::os::raw::c_int,
    pub m_fSpeedMod: f32,
}
#[test]
fn bindgen_test_layout_cocos2d_CCAction() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d_CCAction> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCAction>(),
        68usize,
        concat!("Size of: ", stringify!(cocos2d_CCAction))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCAction>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCAction))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_pOriginalTarget) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCAction),
            "::",
            stringify!(m_pOriginalTarget)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_pTarget) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCAction),
            "::",
            stringify!(m_pTarget)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_nTag) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCAction),
            "::",
            stringify!(m_nTag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_fSpeedMod) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCAction),
            "::",
            stringify!(m_fSpeedMod)
        )
    );
}
extern "thiscall" {
    #[doc = " @js NA\n @lua NA"]
    #[link_name = "\u{1}?description@CCAction@cocos2d@@QAEPBDXZ"]
    pub fn cocos2d_CCAction_description(
        this: *mut cocos2d_CCAction,
    ) -> *const ::std::os::raw::c_char;
}
extern "thiscall" {
    #[link_name = "\u{1}?setSpeedMod@CCAction@cocos2d@@QAEXM@Z"]
    pub fn cocos2d_CCAction_setSpeedMod(this: *mut cocos2d_CCAction, mod_: f32);
}
extern "C" {
    #[doc = " Create an action"]
    #[link_name = "\u{1}?create@CCAction@cocos2d@@SAPAV12@XZ"]
    pub fn cocos2d_CCAction_create() -> *mut cocos2d_CCAction;
}
extern "thiscall" {
    #[doc = " @js ctor"]
    #[link_name = "\u{1}??0CCAction@cocos2d@@QAE@XZ"]
    pub fn cocos2d_CCAction_CCAction(this: *mut cocos2d_CCAction);
}
impl cocos2d_CCAction {
    #[inline]
    pub unsafe fn description(&mut self) -> *const ::std::os::raw::c_char {
        cocos2d_CCAction_description(self)
    }
    #[inline]
    pub unsafe fn setSpeedMod(&mut self, mod_: f32) {
        cocos2d_CCAction_setSpeedMod(self, mod_)
    }
    #[inline]
    pub unsafe fn create() -> *mut cocos2d_CCAction {
        cocos2d_CCAction_create()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        cocos2d_CCAction_CCAction(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
}
extern "thiscall" {
    #[doc = " @js NA\n @lua NA"]
    #[link_name = "\u{1}??1CCAction@cocos2d@@UAE@XZ"]
    pub fn cocos2d_CCAction_CCAction_destructor(this: *mut cocos2d_CCAction);
}
extern "thiscall" {
    #[doc = " @js NA\n @lua NA"]
    #[link_name = "\u{1}?copyWithZone@CCAction@cocos2d@@UAEPAVCCObject@2@PAVCCZone@2@@Z"]
    pub fn cocos2d_CCAction_copyWithZone(
        this: *mut ::std::os::raw::c_void,
        pZone: *mut cocos2d_CCZone,
    ) -> *mut cocos2d_CCObject;
}
extern "thiscall" {
    #[doc = "! return true if the action has finished"]
    #[link_name = "\u{1}?isDone@CCAction@cocos2d@@UAE_NXZ"]
    pub fn cocos2d_CCAction_isDone(this: *mut ::std::os::raw::c_void) -> bool;
}
extern "thiscall" {
    #[doc = "! called before the action start. It will also set the target."]
    #[link_name = "\u{1}?startWithTarget@CCAction@cocos2d@@UAEXPAVCCNode@2@@Z"]
    pub fn cocos2d_CCAction_startWithTarget(
        this: *mut ::std::os::raw::c_void,
        pTarget: *mut cocos2d_CCNode,
    );
}
extern "thiscall" {
    #[doc = "called after the action has finished. It will set the 'target' to nil.\nIMPORTANT: You should never call \"[action stop]\" manually. Instead, use: \"target->stopAction(action);\""]
    #[link_name = "\u{1}?stop@CCAction@cocos2d@@UAEXXZ"]
    pub fn cocos2d_CCAction_stop(this: *mut ::std::os::raw::c_void);
}
extern "thiscall" {
    #[doc = "! called every frame with it's delta time. DON'T override unless you know what you are doing."]
    #[link_name = "\u{1}?step@CCAction@cocos2d@@UAEXM@Z"]
    pub fn cocos2d_CCAction_step(this: *mut ::std::os::raw::c_void, dt: f32);
}
extern "thiscall" {
    #[doc = "called once per frame. time a value between 0 and 1\n\nFor example:\n- 0 means that the action just started\n- 0.5 means that the action is in the middle\n- 1 means that the action is over"]
    #[link_name = "\u{1}?update@CCAction@cocos2d@@UAEXM@Z"]
    pub fn cocos2d_CCAction_update(this: *mut ::std::os::raw::c_void, time: f32);
}
#[doc = "@brief\nBase class actions that do have a finite time duration.\nPossible actions:\n- An action with a duration of 0 seconds\n- An action with a duration of 35.5 seconds\n\nInfinite time actions are valid"]
#[repr(C)]
#[derive(Debug)]
pub struct cocos2d_CCFiniteTimeAction {
    pub _base: cocos2d_CCAction,
    #[doc = "! duration in seconds"]
    pub m_fDuration: f32,
}
#[test]
fn bindgen_test_layout_cocos2d_CCFiniteTimeAction() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d_CCFiniteTimeAction> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCFiniteTimeAction>(),
        72usize,
        concat!("Size of: ", stringify!(cocos2d_CCFiniteTimeAction))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCFiniteTimeAction>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCFiniteTimeAction))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_fDuration) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCFiniteTimeAction),
            "::",
            stringify!(m_fDuration)
        )
    );
}
extern "thiscall" {
    #[doc = " returns a reversed action"]
    #[link_name = "\u{1}?reverse@CCFiniteTimeAction@cocos2d@@UAEPAV12@XZ"]
    pub fn cocos2d_CCFiniteTimeAction_reverse(
        this: *mut ::std::os::raw::c_void,
    ) -> *mut cocos2d_CCFiniteTimeAction;
}
#[doc = "@brief Changes the speed of an action, making it take longer (speed>1)\nor less (speed<1) time.\nUseful to simulate 'slow motion' or 'fast forward' effect.\n@warning This action can't be Sequenceable because it is not an CCIntervalAction"]
#[repr(C)]
#[derive(Debug)]
pub struct cocos2d_CCSpeed {
    pub _base: cocos2d_CCAction,
    pub m_fSpeed: f32,
    pub m_pInnerAction: *mut cocos2d_CCActionInterval,
}
#[test]
fn bindgen_test_layout_cocos2d_CCSpeed() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d_CCSpeed> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCSpeed>(),
        76usize,
        concat!("Size of: ", stringify!(cocos2d_CCSpeed))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCSpeed>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCSpeed))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_fSpeed) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCSpeed),
            "::",
            stringify!(m_fSpeed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_pInnerAction) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCSpeed),
            "::",
            stringify!(m_pInnerAction)
        )
    );
}
extern "thiscall" {
    #[doc = " initializes the action"]
    #[link_name = "\u{1}?initWithAction@CCSpeed@cocos2d@@QAE_NPAVCCActionInterval@2@M@Z"]
    pub fn cocos2d_CCSpeed_initWithAction(
        this: *mut cocos2d_CCSpeed,
        pAction: *mut cocos2d_CCActionInterval,
        fSpeed: f32,
    ) -> bool;
}
extern "thiscall" {
    #[link_name = "\u{1}?setInnerAction@CCSpeed@cocos2d@@QAEXPAVCCActionInterval@2@@Z"]
    pub fn cocos2d_CCSpeed_setInnerAction(
        this: *mut cocos2d_CCSpeed,
        pAction: *mut cocos2d_CCActionInterval,
    );
}
extern "C" {
    #[doc = " create the action"]
    #[link_name = "\u{1}?create@CCSpeed@cocos2d@@SAPAV12@PAVCCActionInterval@2@M@Z"]
    pub fn cocos2d_CCSpeed_create(
        pAction: *mut cocos2d_CCActionInterval,
        fSpeed: f32,
    ) -> *mut cocos2d_CCSpeed;
}
impl cocos2d_CCSpeed {
    #[inline]
    pub unsafe fn initWithAction(
        &mut self,
        pAction: *mut cocos2d_CCActionInterval,
        fSpeed: f32,
    ) -> bool {
        cocos2d_CCSpeed_initWithAction(self, pAction, fSpeed)
    }
    #[inline]
    pub unsafe fn setInnerAction(&mut self, pAction: *mut cocos2d_CCActionInterval) {
        cocos2d_CCSpeed_setInnerAction(self, pAction)
    }
    #[inline]
    pub unsafe fn create(
        pAction: *mut cocos2d_CCActionInterval,
        fSpeed: f32,
    ) -> *mut cocos2d_CCSpeed {
        cocos2d_CCSpeed_create(pAction, fSpeed)
    }
}
extern "thiscall" {
    #[doc = "  @js NA\n  @lua NA"]
    #[link_name = "\u{1}??1CCSpeed@cocos2d@@UAE@XZ"]
    pub fn cocos2d_CCSpeed_CCSpeed_destructor(this: *mut cocos2d_CCSpeed);
}
extern "thiscall" {
    #[doc = "  @js NA\n  @lua NA"]
    #[link_name = "\u{1}?copyWithZone@CCSpeed@cocos2d@@UAEPAVCCObject@2@PAVCCZone@2@@Z"]
    pub fn cocos2d_CCSpeed_copyWithZone(
        this: *mut ::std::os::raw::c_void,
        pZone: *mut cocos2d_CCZone,
    ) -> *mut cocos2d_CCObject;
}
extern "thiscall" {
    #[link_name = "\u{1}?startWithTarget@CCSpeed@cocos2d@@UAEXPAVCCNode@2@@Z"]
    pub fn cocos2d_CCSpeed_startWithTarget(
        this: *mut ::std::os::raw::c_void,
        pTarget: *mut cocos2d_CCNode,
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?stop@CCSpeed@cocos2d@@UAEXXZ"]
    pub fn cocos2d_CCSpeed_stop(this: *mut ::std::os::raw::c_void);
}
extern "thiscall" {
    #[link_name = "\u{1}?step@CCSpeed@cocos2d@@UAEXM@Z"]
    pub fn cocos2d_CCSpeed_step(this: *mut ::std::os::raw::c_void, dt: f32);
}
extern "thiscall" {
    #[link_name = "\u{1}?isDone@CCSpeed@cocos2d@@UAE_NXZ"]
    pub fn cocos2d_CCSpeed_isDone(this: *mut ::std::os::raw::c_void) -> bool;
}
extern "thiscall" {
    #[link_name = "\u{1}?reverse@CCSpeed@cocos2d@@UAEPAVCCActionInterval@2@XZ"]
    pub fn cocos2d_CCSpeed_reverse(
        this: *mut ::std::os::raw::c_void,
    ) -> *mut cocos2d_CCActionInterval;
}
#[doc = "@brief CCFollow is an action that \"follows\" a node.\n\nEg:\nlayer->runAction(CCFollow::actionWithTarget(hero));\n\nInstead of using CCCamera as a \"follower\", use this action instead.\n@since v0.99.2"]
#[repr(C)]
#[derive(Debug)]
pub struct cocos2d_CCFollow {
    pub _base: cocos2d_CCAction,
    pub m_pobFollowedNode: *mut cocos2d_CCNode,
    pub m_bBoundarySet: bool,
    pub m_bBoundaryFullyCovered: bool,
    pub m_obHalfScreenSize: cocos2d_CCPoint,
    pub m_obFullScreenSize: cocos2d_CCPoint,
    pub m_fLeftBoundary: f32,
    pub m_fRightBoundary: f32,
    pub m_fTopBoundary: f32,
    pub m_fBottomBoundary: f32,
}
#[test]
fn bindgen_test_layout_cocos2d_CCFollow() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d_CCFollow> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCFollow>(),
        108usize,
        concat!("Size of: ", stringify!(cocos2d_CCFollow))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCFollow>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCFollow))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_pobFollowedNode) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCFollow),
            "::",
            stringify!(m_pobFollowedNode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_bBoundarySet) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCFollow),
            "::",
            stringify!(m_bBoundarySet)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_bBoundaryFullyCovered) as usize - ptr as usize },
        73usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCFollow),
            "::",
            stringify!(m_bBoundaryFullyCovered)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_obHalfScreenSize) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCFollow),
            "::",
            stringify!(m_obHalfScreenSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_obFullScreenSize) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCFollow),
            "::",
            stringify!(m_obFullScreenSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_fLeftBoundary) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCFollow),
            "::",
            stringify!(m_fLeftBoundary)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_fRightBoundary) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCFollow),
            "::",
            stringify!(m_fRightBoundary)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_fTopBoundary) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCFollow),
            "::",
            stringify!(m_fTopBoundary)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_fBottomBoundary) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCFollow),
            "::",
            stringify!(m_fBottomBoundary)
        )
    );
}
extern "thiscall" {
    #[doc = " initializes the action with a set boundary"]
    #[link_name = "\u{1}?initWithTarget@CCFollow@cocos2d@@QAE_NPAVCCNode@2@ABVCCRect@2@@Z"]
    pub fn cocos2d_CCFollow_initWithTarget(
        this: *mut cocos2d_CCFollow,
        pFollowedNode: *mut cocos2d_CCNode,
        rect: *const cocos2d_CCRect,
    ) -> bool;
}
extern "C" {
    #[doc = " creates the action with a set boundary,\nIt will work with no boundary if @param rect is equal to CCRectZero."]
    #[link_name = "\u{1}?create@CCFollow@cocos2d@@SAPAV12@PAVCCNode@2@ABVCCRect@2@@Z"]
    pub fn cocos2d_CCFollow_create(
        pFollowedNode: *mut cocos2d_CCNode,
        rect: *const cocos2d_CCRect,
    ) -> *mut cocos2d_CCFollow;
}
impl cocos2d_CCFollow {
    #[inline]
    pub unsafe fn initWithTarget(
        &mut self,
        pFollowedNode: *mut cocos2d_CCNode,
        rect: *const cocos2d_CCRect,
    ) -> bool {
        cocos2d_CCFollow_initWithTarget(self, pFollowedNode, rect)
    }
    #[inline]
    pub unsafe fn create(
        pFollowedNode: *mut cocos2d_CCNode,
        rect: *const cocos2d_CCRect,
    ) -> *mut cocos2d_CCFollow {
        cocos2d_CCFollow_create(pFollowedNode, rect)
    }
}
extern "thiscall" {
    #[doc = "  @js NA\n  @lua NA"]
    #[link_name = "\u{1}??1CCFollow@cocos2d@@UAE@XZ"]
    pub fn cocos2d_CCFollow_CCFollow_destructor(this: *mut cocos2d_CCFollow);
}
extern "thiscall" {
    #[doc = "  @js NA\n  @lua NA"]
    #[link_name = "\u{1}?copyWithZone@CCFollow@cocos2d@@UAEPAVCCObject@2@PAVCCZone@2@@Z"]
    pub fn cocos2d_CCFollow_copyWithZone(
        this: *mut ::std::os::raw::c_void,
        pZone: *mut cocos2d_CCZone,
    ) -> *mut cocos2d_CCObject;
}
extern "thiscall" {
    #[link_name = "\u{1}?step@CCFollow@cocos2d@@UAEXM@Z"]
    pub fn cocos2d_CCFollow_step(this: *mut ::std::os::raw::c_void, dt: f32);
}
extern "thiscall" {
    #[link_name = "\u{1}?isDone@CCFollow@cocos2d@@UAE_NXZ"]
    pub fn cocos2d_CCFollow_isDone(this: *mut ::std::os::raw::c_void) -> bool;
}
extern "thiscall" {
    #[link_name = "\u{1}?stop@CCFollow@cocos2d@@UAEXXZ"]
    pub fn cocos2d_CCFollow_stop(this: *mut ::std::os::raw::c_void);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d_CCAffineTransform {
    pub a: f32,
    pub b: f32,
    pub c: f32,
    pub d: f32,
    pub tx: f32,
    pub ty: f32,
}
#[test]
fn bindgen_test_layout_cocos2d_CCAffineTransform() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d_CCAffineTransform> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCAffineTransform>(),
        24usize,
        concat!("Size of: ", stringify!(cocos2d_CCAffineTransform))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCAffineTransform>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCAffineTransform))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCAffineTransform),
            "::",
            stringify!(a)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCAffineTransform),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).c) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCAffineTransform),
            "::",
            stringify!(c)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCAffineTransform),
            "::",
            stringify!(d)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tx) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCAffineTransform),
            "::",
            stringify!(tx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ty) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCAffineTransform),
            "::",
            stringify!(ty)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}?__CCAffineTransformMake@cocos2d@@YA?AUCCAffineTransform@1@MMMMMM@Z"]
    pub fn cocos2d___CCAffineTransformMake(
        a: f32,
        b: f32,
        c: f32,
        d: f32,
        tx: f32,
        ty: f32,
    ) -> cocos2d_CCAffineTransform;
}
extern "C" {
    #[link_name = "\u{1}?__CCPointApplyAffineTransform@cocos2d@@YA?AVCCPoint@1@ABV21@ABUCCAffineTransform@1@@Z"]
    pub fn cocos2d___CCPointApplyAffineTransform(
        point: *const cocos2d_CCPoint,
        t: *const cocos2d_CCAffineTransform,
    ) -> cocos2d_CCPoint;
}
extern "C" {
    #[link_name = "\u{1}?__CCSizeApplyAffineTransform@cocos2d@@YA?AVCCSize@1@ABV21@ABUCCAffineTransform@1@@Z"]
    pub fn cocos2d___CCSizeApplyAffineTransform(
        size: *const cocos2d_CCSize,
        t: *const cocos2d_CCAffineTransform,
    ) -> cocos2d_CCSize;
}
extern "C" {
    #[link_name = "\u{1}?CCAffineTransformMakeIdentity@cocos2d@@YA?AUCCAffineTransform@1@XZ"]
    pub fn cocos2d_CCAffineTransformMakeIdentity() -> cocos2d_CCAffineTransform;
}
extern "C" {
    #[link_name = "\u{1}?CCRectApplyAffineTransform@cocos2d@@YA?AVCCRect@1@ABV21@ABUCCAffineTransform@1@@Z"]
    pub fn cocos2d_CCRectApplyAffineTransform(
        rect: *const cocos2d_CCRect,
        anAffineTransform: *const cocos2d_CCAffineTransform,
    ) -> cocos2d_CCRect;
}
extern "C" {
    #[link_name = "\u{1}?CCAffineTransformTranslate@cocos2d@@YA?AUCCAffineTransform@1@ABU21@MM@Z"]
    pub fn cocos2d_CCAffineTransformTranslate(
        t: *const cocos2d_CCAffineTransform,
        tx: f32,
        ty: f32,
    ) -> cocos2d_CCAffineTransform;
}
extern "C" {
    #[link_name = "\u{1}?CCAffineTransformRotate@cocos2d@@YA?AUCCAffineTransform@1@ABU21@M@Z"]
    pub fn cocos2d_CCAffineTransformRotate(
        aTransform: *const cocos2d_CCAffineTransform,
        anAngle: f32,
    ) -> cocos2d_CCAffineTransform;
}
extern "C" {
    #[link_name = "\u{1}?CCAffineTransformScale@cocos2d@@YA?AUCCAffineTransform@1@ABU21@MM@Z"]
    pub fn cocos2d_CCAffineTransformScale(
        t: *const cocos2d_CCAffineTransform,
        sx: f32,
        sy: f32,
    ) -> cocos2d_CCAffineTransform;
}
extern "C" {
    #[link_name = "\u{1}?CCAffineTransformConcat@cocos2d@@YA?AUCCAffineTransform@1@ABU21@0@Z"]
    pub fn cocos2d_CCAffineTransformConcat(
        t1: *const cocos2d_CCAffineTransform,
        t2: *const cocos2d_CCAffineTransform,
    ) -> cocos2d_CCAffineTransform;
}
extern "C" {
    #[link_name = "\u{1}?CCAffineTransformEqualToTransform@cocos2d@@YA_NABUCCAffineTransform@1@0@Z"]
    pub fn cocos2d_CCAffineTransformEqualToTransform(
        t1: *const cocos2d_CCAffineTransform,
        t2: *const cocos2d_CCAffineTransform,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}?CCAffineTransformInvert@cocos2d@@YA?AUCCAffineTransform@1@ABU21@@Z"]
    pub fn cocos2d_CCAffineTransformInvert(
        t: *const cocos2d_CCAffineTransform,
    ) -> cocos2d_CCAffineTransform;
}
extern "C" {
    #[link_name = "\u{1}?CCAffineTransformIdentity@cocos2d@@3UCCAffineTransform@1@B"]
    pub static cocos2d_CCAffineTransformIdentity: cocos2d_CCAffineTransform;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d__ccArray {
    pub num: ::std::os::raw::c_uint,
    pub max: ::std::os::raw::c_uint,
    pub arr: *mut *mut cocos2d_CCObject,
}
#[test]
fn bindgen_test_layout_cocos2d__ccArray() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d__ccArray> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d__ccArray>(),
        12usize,
        concat!("Size of: ", stringify!(cocos2d__ccArray))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d__ccArray>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d__ccArray))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccArray),
            "::",
            stringify!(num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccArray),
            "::",
            stringify!(max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccArray),
            "::",
            stringify!(arr)
        )
    );
}
pub type cocos2d_ccArray = cocos2d__ccArray;
extern "C" {
    #[doc = " Allocates and initializes a new array with specified capacity"]
    #[link_name = "\u{1}?ccArrayNew@cocos2d@@YAPAU_ccArray@1@I@Z"]
    pub fn cocos2d_ccArrayNew(capacity: ::std::os::raw::c_uint) -> *mut cocos2d_ccArray;
}
extern "C" {
    #[doc = " Frees array after removing all remaining objects. Silently ignores nil arr."]
    #[link_name = "\u{1}?ccArrayFree@cocos2d@@YAXAAPAU_ccArray@1@@Z"]
    pub fn cocos2d_ccArrayFree(arr: *mut *mut cocos2d_ccArray);
}
extern "C" {
    #[doc = " Doubles array capacity"]
    #[link_name = "\u{1}?ccArrayDoubleCapacity@cocos2d@@YAXPAU_ccArray@1@@Z"]
    pub fn cocos2d_ccArrayDoubleCapacity(arr: *mut cocos2d_ccArray);
}
extern "C" {
    #[doc = " Increases array capacity such that max >= num + extra."]
    #[link_name = "\u{1}?ccArrayEnsureExtraCapacity@cocos2d@@YAXPAU_ccArray@1@I@Z"]
    pub fn cocos2d_ccArrayEnsureExtraCapacity(
        arr: *mut cocos2d_ccArray,
        extra: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[doc = " shrinks the array so the memory footprint corresponds with the number of items"]
    #[link_name = "\u{1}?ccArrayShrink@cocos2d@@YAXPAU_ccArray@1@@Z"]
    pub fn cocos2d_ccArrayShrink(arr: *mut cocos2d_ccArray);
}
extern "C" {
    #[doc = " Returns index of first occurrence of object, NSNotFound if object not found."]
    #[link_name = "\u{1}?ccArrayGetIndexOfObject@cocos2d@@YAIPAU_ccArray@1@PAVCCObject@1@@Z"]
    pub fn cocos2d_ccArrayGetIndexOfObject(
        arr: *mut cocos2d_ccArray,
        object: *mut cocos2d_CCObject,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " Returns a Boolean value that indicates whether object is present in array."]
    #[link_name = "\u{1}?ccArrayContainsObject@cocos2d@@YA_NPAU_ccArray@1@PAVCCObject@1@@Z"]
    pub fn cocos2d_ccArrayContainsObject(
        arr: *mut cocos2d_ccArray,
        object: *mut cocos2d_CCObject,
    ) -> bool;
}
extern "C" {
    #[doc = " Appends an object. Behavior undefined if array doesn't have enough capacity."]
    #[link_name = "\u{1}?ccArrayAppendObject@cocos2d@@YAXPAU_ccArray@1@PAVCCObject@1@@Z"]
    pub fn cocos2d_ccArrayAppendObject(arr: *mut cocos2d_ccArray, object: *mut cocos2d_CCObject);
}
extern "C" {
    #[doc = " Appends an object. Capacity of arr is increased if needed."]
    #[link_name = "\u{1}?ccArrayAppendObjectWithResize@cocos2d@@YAXPAU_ccArray@1@PAVCCObject@1@@Z"]
    pub fn cocos2d_ccArrayAppendObjectWithResize(
        arr: *mut cocos2d_ccArray,
        object: *mut cocos2d_CCObject,
    );
}
extern "C" {
    #[doc = " Appends objects from plusArr to arr.\nBehavior undefined if arr doesn't have enough capacity."]
    #[link_name = "\u{1}?ccArrayAppendArray@cocos2d@@YAXPAU_ccArray@1@0@Z"]
    pub fn cocos2d_ccArrayAppendArray(arr: *mut cocos2d_ccArray, plusArr: *mut cocos2d_ccArray);
}
extern "C" {
    #[doc = " Appends objects from plusArr to arr. Capacity of arr is increased if needed."]
    #[link_name = "\u{1}?ccArrayAppendArrayWithResize@cocos2d@@YAXPAU_ccArray@1@0@Z"]
    pub fn cocos2d_ccArrayAppendArrayWithResize(
        arr: *mut cocos2d_ccArray,
        plusArr: *mut cocos2d_ccArray,
    );
}
extern "C" {
    #[doc = " Inserts an object at index"]
    #[link_name = "\u{1}?ccArrayInsertObjectAtIndex@cocos2d@@YAXPAU_ccArray@1@PAVCCObject@1@I@Z"]
    pub fn cocos2d_ccArrayInsertObjectAtIndex(
        arr: *mut cocos2d_ccArray,
        object: *mut cocos2d_CCObject,
        index: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[doc = " Swaps two objects"]
    #[link_name = "\u{1}?ccArraySwapObjectsAtIndexes@cocos2d@@YAXPAU_ccArray@1@II@Z"]
    pub fn cocos2d_ccArraySwapObjectsAtIndexes(
        arr: *mut cocos2d_ccArray,
        index1: ::std::os::raw::c_uint,
        index2: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[doc = " Removes all objects from arr"]
    #[link_name = "\u{1}?ccArrayRemoveAllObjects@cocos2d@@YAXPAU_ccArray@1@@Z"]
    pub fn cocos2d_ccArrayRemoveAllObjects(arr: *mut cocos2d_ccArray);
}
extern "C" {
    #[doc = " Removes object at specified index and pushes back all subsequent objects.\nBehavior undefined if index outside [0, num-1]."]
    #[link_name = "\u{1}?ccArrayRemoveObjectAtIndex@cocos2d@@YAXPAU_ccArray@1@I_N@Z"]
    pub fn cocos2d_ccArrayRemoveObjectAtIndex(
        arr: *mut cocos2d_ccArray,
        index: ::std::os::raw::c_uint,
        bReleaseObj: bool,
    );
}
extern "C" {
    #[doc = " Removes object at specified index and fills the gap with the last object,\nthereby avoiding the need to push back subsequent objects.\nBehavior undefined if index outside [0, num-1]."]
    #[link_name = "\u{1}?ccArrayFastRemoveObjectAtIndex@cocos2d@@YAXPAU_ccArray@1@I@Z"]
    pub fn cocos2d_ccArrayFastRemoveObjectAtIndex(
        arr: *mut cocos2d_ccArray,
        index: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}?ccArrayFastRemoveObject@cocos2d@@YAXPAU_ccArray@1@PAVCCObject@1@@Z"]
    pub fn cocos2d_ccArrayFastRemoveObject(
        arr: *mut cocos2d_ccArray,
        object: *mut cocos2d_CCObject,
    );
}
extern "C" {
    #[doc = " Searches for the first occurrence of object and removes it. If object is not\nfound the function has no effect."]
    #[link_name = "\u{1}?ccArrayRemoveObject@cocos2d@@YAXPAU_ccArray@1@PAVCCObject@1@_N@Z"]
    pub fn cocos2d_ccArrayRemoveObject(
        arr: *mut cocos2d_ccArray,
        object: *mut cocos2d_CCObject,
        bReleaseObj: bool,
    );
}
extern "C" {
    #[doc = " Removes from arr all objects in minusArr. For each object in minusArr, the\nfirst matching instance in arr will be removed."]
    #[link_name = "\u{1}?ccArrayRemoveArray@cocos2d@@YAXPAU_ccArray@1@0@Z"]
    pub fn cocos2d_ccArrayRemoveArray(arr: *mut cocos2d_ccArray, minusArr: *mut cocos2d_ccArray);
}
extern "C" {
    #[doc = " Removes from arr all objects in minusArr. For each object in minusArr, all\nmatching instances in arr will be removed."]
    #[link_name = "\u{1}?ccArrayFullRemoveArray@cocos2d@@YAXPAU_ccArray@1@0@Z"]
    pub fn cocos2d_ccArrayFullRemoveArray(
        arr: *mut cocos2d_ccArray,
        minusArr: *mut cocos2d_ccArray,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d__ccCArray {
    pub num: ::std::os::raw::c_uint,
    pub max: ::std::os::raw::c_uint,
    pub arr: *mut *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_cocos2d__ccCArray() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d__ccCArray> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d__ccCArray>(),
        12usize,
        concat!("Size of: ", stringify!(cocos2d__ccCArray))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d__ccCArray>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d__ccCArray))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccCArray),
            "::",
            stringify!(num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccCArray),
            "::",
            stringify!(max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccCArray),
            "::",
            stringify!(arr)
        )
    );
}
pub type cocos2d_ccCArray = cocos2d__ccCArray;
extern "C" {
    #[doc = " Allocates and initializes a new C array with specified capacity"]
    #[link_name = "\u{1}?ccCArrayNew@cocos2d@@YAPAU_ccCArray@1@I@Z"]
    pub fn cocos2d_ccCArrayNew(capacity: ::std::os::raw::c_uint) -> *mut cocos2d_ccCArray;
}
extern "C" {
    #[doc = " Frees C array after removing all remaining values. Silently ignores nil arr."]
    #[link_name = "\u{1}?ccCArrayFree@cocos2d@@YAXPAU_ccCArray@1@@Z"]
    pub fn cocos2d_ccCArrayFree(arr: *mut cocos2d_ccCArray);
}
extern "C" {
    #[doc = " Doubles C array capacity"]
    #[link_name = "\u{1}?ccCArrayDoubleCapacity@cocos2d@@YAXPAU_ccCArray@1@@Z"]
    pub fn cocos2d_ccCArrayDoubleCapacity(arr: *mut cocos2d_ccCArray);
}
extern "C" {
    #[doc = " Increases array capacity such that max >= num + extra."]
    #[link_name = "\u{1}?ccCArrayEnsureExtraCapacity@cocos2d@@YAXPAU_ccCArray@1@I@Z"]
    pub fn cocos2d_ccCArrayEnsureExtraCapacity(
        arr: *mut cocos2d_ccCArray,
        extra: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[doc = " Returns index of first occurrence of value, NSNotFound if value not found."]
    #[link_name = "\u{1}?ccCArrayGetIndexOfValue@cocos2d@@YAIPAU_ccCArray@1@PAX@Z"]
    pub fn cocos2d_ccCArrayGetIndexOfValue(
        arr: *mut cocos2d_ccCArray,
        value: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " Returns a Boolean value that indicates whether value is present in the C array."]
    #[link_name = "\u{1}?ccCArrayContainsValue@cocos2d@@YA_NPAU_ccCArray@1@PAX@Z"]
    pub fn cocos2d_ccCArrayContainsValue(
        arr: *mut cocos2d_ccCArray,
        value: *mut ::std::os::raw::c_void,
    ) -> bool;
}
extern "C" {
    #[doc = " Inserts a value at a certain position. Behavior undefined if array doesn't have enough capacity"]
    #[link_name = "\u{1}?ccCArrayInsertValueAtIndex@cocos2d@@YAXPAU_ccCArray@1@PAXI@Z"]
    pub fn cocos2d_ccCArrayInsertValueAtIndex(
        arr: *mut cocos2d_ccCArray,
        value: *mut ::std::os::raw::c_void,
        index: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[doc = " Appends an value. Behavior undefined if array doesn't have enough capacity."]
    #[link_name = "\u{1}?ccCArrayAppendValue@cocos2d@@YAXPAU_ccCArray@1@PAX@Z"]
    pub fn cocos2d_ccCArrayAppendValue(
        arr: *mut cocos2d_ccCArray,
        value: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    #[doc = " Appends an value. Capacity of arr is increased if needed."]
    #[link_name = "\u{1}?ccCArrayAppendValueWithResize@cocos2d@@YAXPAU_ccCArray@1@PAX@Z"]
    pub fn cocos2d_ccCArrayAppendValueWithResize(
        arr: *mut cocos2d_ccCArray,
        value: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    #[doc = " Appends values from plusArr to arr. Behavior undefined if arr doesn't have\nenough capacity."]
    #[link_name = "\u{1}?ccCArrayAppendArray@cocos2d@@YAXPAU_ccCArray@1@0@Z"]
    pub fn cocos2d_ccCArrayAppendArray(arr: *mut cocos2d_ccCArray, plusArr: *mut cocos2d_ccCArray);
}
extern "C" {
    #[doc = " Appends values from plusArr to arr. Capacity of arr is increased if needed."]
    #[link_name = "\u{1}?ccCArrayAppendArrayWithResize@cocos2d@@YAXPAU_ccCArray@1@0@Z"]
    pub fn cocos2d_ccCArrayAppendArrayWithResize(
        arr: *mut cocos2d_ccCArray,
        plusArr: *mut cocos2d_ccCArray,
    );
}
extern "C" {
    #[doc = " Removes all values from arr"]
    #[link_name = "\u{1}?ccCArrayRemoveAllValues@cocos2d@@YAXPAU_ccCArray@1@@Z"]
    pub fn cocos2d_ccCArrayRemoveAllValues(arr: *mut cocos2d_ccCArray);
}
extern "C" {
    #[doc = " Removes value at specified index and pushes back all subsequent values.\nBehavior undefined if index outside [0, num-1].\n@since v0.99.4"]
    #[link_name = "\u{1}?ccCArrayRemoveValueAtIndex@cocos2d@@YAXPAU_ccCArray@1@I@Z"]
    pub fn cocos2d_ccCArrayRemoveValueAtIndex(
        arr: *mut cocos2d_ccCArray,
        index: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[doc = " Removes value at specified index and fills the gap with the last value,\nthereby avoiding the need to push back subsequent values.\nBehavior undefined if index outside [0, num-1].\n@since v0.99.4"]
    #[link_name = "\u{1}?ccCArrayFastRemoveValueAtIndex@cocos2d@@YAXPAU_ccCArray@1@I@Z"]
    pub fn cocos2d_ccCArrayFastRemoveValueAtIndex(
        arr: *mut cocos2d_ccCArray,
        index: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[doc = " Searches for the first occurrence of value and removes it. If value is not found the function has no effect.\n@since v0.99.4"]
    #[link_name = "\u{1}?ccCArrayRemoveValue@cocos2d@@YAXPAU_ccCArray@1@PAX@Z"]
    pub fn cocos2d_ccCArrayRemoveValue(
        arr: *mut cocos2d_ccCArray,
        value: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    #[doc = " Removes from arr all values in minusArr. For each Value in minusArr, the first matching instance in arr will be removed.\n@since v0.99.4"]
    #[link_name = "\u{1}?ccCArrayRemoveArray@cocos2d@@YAXPAU_ccCArray@1@0@Z"]
    pub fn cocos2d_ccCArrayRemoveArray(arr: *mut cocos2d_ccCArray, minusArr: *mut cocos2d_ccCArray);
}
extern "C" {
    #[doc = " Removes from arr all values in minusArr. For each value in minusArr, all matching instances in arr will be removed.\n@since v0.99.4"]
    #[link_name = "\u{1}?ccCArrayFullRemoveArray@cocos2d@@YAXPAU_ccCArray@1@0@Z"]
    pub fn cocos2d_ccCArrayFullRemoveArray(
        arr: *mut cocos2d_ccCArray,
        minusArr: *mut cocos2d_ccCArray,
    );
}
#[doc = " @js NA"]
#[repr(C)]
#[derive(Debug)]
pub struct cocos2d_CCArray {
    pub _base: cocos2d_CCObject,
    pub data: *mut cocos2d_ccArray,
}
#[test]
fn bindgen_test_layout_cocos2d_CCArray() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d_CCArray> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCArray>(),
        56usize,
        concat!("Size of: ", stringify!(cocos2d_CCArray))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCArray>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCArray))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCArray),
            "::",
            stringify!(data)
        )
    );
}
extern "C" {
    #[doc = " Create an array"]
    #[link_name = "\u{1}?create@CCArray@cocos2d@@SAPAV12@XZ"]
    pub fn cocos2d_CCArray_create() -> *mut cocos2d_CCArray;
}
extern "C" {
    #[doc = " Create an array with some objects\n  @lua NA"]
    #[link_name = "\u{1}?create@CCArray@cocos2d@@SAPAV12@PAVCCObject@2@ZZ"]
    pub fn cocos2d_CCArray_create1(pObject: *mut cocos2d_CCObject, ...) -> *mut cocos2d_CCArray;
}
extern "C" {
    #[doc = " Create an array with one object"]
    #[link_name = "\u{1}?createWithObject@CCArray@cocos2d@@SAPAV12@PAVCCObject@2@@Z"]
    pub fn cocos2d_CCArray_createWithObject(pObject: *mut cocos2d_CCObject)
        -> *mut cocos2d_CCArray;
}
extern "C" {
    #[doc = " Create an array with capacity"]
    #[link_name = "\u{1}?createWithCapacity@CCArray@cocos2d@@SAPAV12@I@Z"]
    pub fn cocos2d_CCArray_createWithCapacity(
        capacity: ::std::os::raw::c_uint,
    ) -> *mut cocos2d_CCArray;
}
extern "C" {
    #[doc = " Create an array with an existing array"]
    #[link_name = "\u{1}?createWithArray@CCArray@cocos2d@@SAPAV12@PAV12@@Z"]
    pub fn cocos2d_CCArray_createWithArray(
        otherArray: *mut cocos2d_CCArray,
    ) -> *mut cocos2d_CCArray;
}
extern "C" {
    #[doc = "@brief   Generate a CCArray pointer by file\n@param   pFileName  The file name of *.plist file\n@return  The CCArray pointer generated from the file"]
    #[link_name = "\u{1}?createWithContentsOfFile@CCArray@cocos2d@@SAPAV12@PBD@Z"]
    pub fn cocos2d_CCArray_createWithContentsOfFile(
        pFileName: *const ::std::os::raw::c_char,
    ) -> *mut cocos2d_CCArray;
}
extern "C" {
    #[link_name = "\u{1}?createWithContentsOfFileThreadSafe@CCArray@cocos2d@@SAPAV12@PBD@Z"]
    pub fn cocos2d_CCArray_createWithContentsOfFileThreadSafe(
        pFileName: *const ::std::os::raw::c_char,
    ) -> *mut cocos2d_CCArray;
}
extern "thiscall" {
    #[doc = " Initializes an array\n  @lua NA"]
    #[link_name = "\u{1}?init@CCArray@cocos2d@@QAE_NXZ"]
    pub fn cocos2d_CCArray_init(this: *mut cocos2d_CCArray) -> bool;
}
extern "thiscall" {
    #[doc = " Initializes an array with one object\n  @lua NA"]
    #[link_name = "\u{1}?initWithObject@CCArray@cocos2d@@QAE_NPAVCCObject@2@@Z"]
    pub fn cocos2d_CCArray_initWithObject(
        this: *mut cocos2d_CCArray,
        pObject: *mut cocos2d_CCObject,
    ) -> bool;
}
extern "C" {
    #[doc = " Initializes an array with some objects\n  @lua NA"]
    #[link_name = "\u{1}?initWithObjects@CCArray@cocos2d@@QAA_NPAVCCObject@2@ZZ"]
    pub fn cocos2d_CCArray_initWithObjects(
        this: *mut cocos2d_CCArray,
        pObject: *mut cocos2d_CCObject,
        ...
    ) -> bool;
}
extern "thiscall" {
    #[doc = " Initializes an array with capacity\n  @lua NA"]
    #[link_name = "\u{1}?initWithCapacity@CCArray@cocos2d@@QAE_NI@Z"]
    pub fn cocos2d_CCArray_initWithCapacity(
        this: *mut cocos2d_CCArray,
        capacity: ::std::os::raw::c_uint,
    ) -> bool;
}
extern "thiscall" {
    #[doc = " Initializes an array with an existing array\n  @lua NA"]
    #[link_name = "\u{1}?initWithArray@CCArray@cocos2d@@QAE_NPAV12@@Z"]
    pub fn cocos2d_CCArray_initWithArray(
        this: *mut cocos2d_CCArray,
        otherArray: *mut cocos2d_CCArray,
    ) -> bool;
}
extern "thiscall" {
    #[doc = " Returns element count of the array"]
    #[link_name = "\u{1}?count@CCArray@cocos2d@@QBEIXZ"]
    pub fn cocos2d_CCArray_count(this: *const cocos2d_CCArray) -> ::std::os::raw::c_uint;
}
extern "thiscall" {
    #[doc = " Returns capacity of the array"]
    #[link_name = "\u{1}?capacity@CCArray@cocos2d@@QBEIXZ"]
    pub fn cocos2d_CCArray_capacity(this: *const cocos2d_CCArray) -> ::std::os::raw::c_uint;
}
extern "thiscall" {
    #[doc = " Returns index of a certain object, return UINT_MAX if doesn't contain the object"]
    #[link_name = "\u{1}?indexOfObject@CCArray@cocos2d@@QBEIPAVCCObject@2@@Z"]
    pub fn cocos2d_CCArray_indexOfObject(
        this: *const cocos2d_CCArray,
        object: *mut cocos2d_CCObject,
    ) -> ::std::os::raw::c_uint;
}
extern "thiscall" {
    #[doc = " Returns an element with a certain index"]
    #[link_name = "\u{1}?objectAtIndex@CCArray@cocos2d@@QAEPAVCCObject@2@I@Z"]
    pub fn cocos2d_CCArray_objectAtIndex(
        this: *mut cocos2d_CCArray,
        index: ::std::os::raw::c_uint,
    ) -> *mut cocos2d_CCObject;
}
extern "thiscall" {
    #[doc = " Returns last element"]
    #[link_name = "\u{1}?lastObject@CCArray@cocos2d@@QAEPAVCCObject@2@XZ"]
    pub fn cocos2d_CCArray_lastObject(this: *mut cocos2d_CCArray) -> *mut cocos2d_CCObject;
}
extern "thiscall" {
    #[doc = " Returns a random element"]
    #[link_name = "\u{1}?randomObject@CCArray@cocos2d@@QAEPAVCCObject@2@XZ"]
    pub fn cocos2d_CCArray_randomObject(this: *mut cocos2d_CCArray) -> *mut cocos2d_CCObject;
}
extern "thiscall" {
    #[doc = " Returns a Boolean value that indicates whether object is present in array."]
    #[link_name = "\u{1}?containsObject@CCArray@cocos2d@@QBE_NPAVCCObject@2@@Z"]
    pub fn cocos2d_CCArray_containsObject(
        this: *const cocos2d_CCArray,
        object: *mut cocos2d_CCObject,
    ) -> bool;
}
extern "thiscall" {
    #[doc = " @since 1.1"]
    #[link_name = "\u{1}?isEqualToArray@CCArray@cocos2d@@QAE_NPAV12@@Z"]
    pub fn cocos2d_CCArray_isEqualToArray(
        this: *mut cocos2d_CCArray,
        pOtherArray: *mut cocos2d_CCArray,
    ) -> bool;
}
extern "thiscall" {
    #[doc = " Add a certain object"]
    #[link_name = "\u{1}?addObject@CCArray@cocos2d@@QAEXPAVCCObject@2@@Z"]
    pub fn cocos2d_CCArray_addObject(this: *mut cocos2d_CCArray, object: *mut cocos2d_CCObject);
}
extern "thiscall" {
    #[doc = " Add all elements of an existing array"]
    #[link_name = "\u{1}?addObjectsFromArray@CCArray@cocos2d@@QAEXPAV12@@Z"]
    pub fn cocos2d_CCArray_addObjectsFromArray(
        this: *mut cocos2d_CCArray,
        otherArray: *mut cocos2d_CCArray,
    );
}
extern "thiscall" {
    #[doc = " Insert a certain object at a certain index"]
    #[link_name = "\u{1}?insertObject@CCArray@cocos2d@@QAEXPAVCCObject@2@I@Z"]
    pub fn cocos2d_CCArray_insertObject(
        this: *mut cocos2d_CCArray,
        object: *mut cocos2d_CCObject,
        index: ::std::os::raw::c_uint,
    );
}
extern "thiscall" {
    #[doc = " Remove last object"]
    #[link_name = "\u{1}?removeLastObject@CCArray@cocos2d@@QAEX_N@Z"]
    pub fn cocos2d_CCArray_removeLastObject(this: *mut cocos2d_CCArray, bReleaseObj: bool);
}
extern "thiscall" {
    #[doc = " Remove a certain object"]
    #[link_name = "\u{1}?removeObject@CCArray@cocos2d@@QAEXPAVCCObject@2@_N@Z"]
    pub fn cocos2d_CCArray_removeObject(
        this: *mut cocos2d_CCArray,
        object: *mut cocos2d_CCObject,
        bReleaseObj: bool,
    );
}
extern "thiscall" {
    #[doc = " Remove an element with a certain index"]
    #[link_name = "\u{1}?removeObjectAtIndex@CCArray@cocos2d@@QAEXI_N@Z"]
    pub fn cocos2d_CCArray_removeObjectAtIndex(
        this: *mut cocos2d_CCArray,
        index: ::std::os::raw::c_uint,
        bReleaseObj: bool,
    );
}
extern "thiscall" {
    #[doc = " Remove all elements"]
    #[link_name = "\u{1}?removeObjectsInArray@CCArray@cocos2d@@QAEXPAV12@@Z"]
    pub fn cocos2d_CCArray_removeObjectsInArray(
        this: *mut cocos2d_CCArray,
        otherArray: *mut cocos2d_CCArray,
    );
}
extern "thiscall" {
    #[doc = " Remove all objects"]
    #[link_name = "\u{1}?removeAllObjects@CCArray@cocos2d@@QAEXXZ"]
    pub fn cocos2d_CCArray_removeAllObjects(this: *mut cocos2d_CCArray);
}
extern "thiscall" {
    #[doc = " Fast way to remove a certain object"]
    #[link_name = "\u{1}?fastRemoveObject@CCArray@cocos2d@@QAEXPAVCCObject@2@@Z"]
    pub fn cocos2d_CCArray_fastRemoveObject(
        this: *mut cocos2d_CCArray,
        object: *mut cocos2d_CCObject,
    );
}
extern "thiscall" {
    #[doc = " Fast way to remove an element with a certain index"]
    #[link_name = "\u{1}?fastRemoveObjectAtIndex@CCArray@cocos2d@@QAEXI@Z"]
    pub fn cocos2d_CCArray_fastRemoveObjectAtIndex(
        this: *mut cocos2d_CCArray,
        index: ::std::os::raw::c_uint,
    );
}
extern "thiscall" {
    #[doc = " Swap two elements"]
    #[link_name = "\u{1}?exchangeObject@CCArray@cocos2d@@QAEXPAVCCObject@2@0@Z"]
    pub fn cocos2d_CCArray_exchangeObject(
        this: *mut cocos2d_CCArray,
        object1: *mut cocos2d_CCObject,
        object2: *mut cocos2d_CCObject,
    );
}
extern "thiscall" {
    #[doc = " Swap two elements with certain indexes"]
    #[link_name = "\u{1}?exchangeObjectAtIndex@CCArray@cocos2d@@QAEXII@Z"]
    pub fn cocos2d_CCArray_exchangeObjectAtIndex(
        this: *mut cocos2d_CCArray,
        index1: ::std::os::raw::c_uint,
        index2: ::std::os::raw::c_uint,
    );
}
extern "thiscall" {
    #[doc = " Replace object at index with another object."]
    #[link_name = "\u{1}?replaceObjectAtIndex@CCArray@cocos2d@@QAEXIPAVCCObject@2@_N@Z"]
    pub fn cocos2d_CCArray_replaceObjectAtIndex(
        this: *mut cocos2d_CCArray,
        uIndex: ::std::os::raw::c_uint,
        pObject: *mut cocos2d_CCObject,
        bReleaseObject: bool,
    );
}
extern "thiscall" {
    #[doc = " Revers the array"]
    #[link_name = "\u{1}?reverseObjects@CCArray@cocos2d@@QAEXXZ"]
    pub fn cocos2d_CCArray_reverseObjects(this: *mut cocos2d_CCArray);
}
extern "thiscall" {
    #[link_name = "\u{1}?reduceMemoryFootprint@CCArray@cocos2d@@QAEXXZ"]
    pub fn cocos2d_CCArray_reduceMemoryFootprint(this: *mut cocos2d_CCArray);
}
extern "thiscall" {
    #[doc = "  @lua NA"]
    #[link_name = "\u{1}??0CCArray@cocos2d@@QAE@XZ"]
    pub fn cocos2d_CCArray_CCArray(this: *mut cocos2d_CCArray);
}
extern "thiscall" {
    #[doc = "  @lua NA"]
    #[link_name = "\u{1}??0CCArray@cocos2d@@QAE@I@Z"]
    pub fn cocos2d_CCArray_CCArray1(this: *mut cocos2d_CCArray, capacity: ::std::os::raw::c_uint);
}
impl cocos2d_CCArray {
    #[inline]
    pub unsafe fn create() -> *mut cocos2d_CCArray {
        cocos2d_CCArray_create()
    }
    #[inline]
    pub unsafe fn createWithObject(pObject: *mut cocos2d_CCObject) -> *mut cocos2d_CCArray {
        cocos2d_CCArray_createWithObject(pObject)
    }
    #[inline]
    pub unsafe fn createWithCapacity(capacity: ::std::os::raw::c_uint) -> *mut cocos2d_CCArray {
        cocos2d_CCArray_createWithCapacity(capacity)
    }
    #[inline]
    pub unsafe fn createWithArray(otherArray: *mut cocos2d_CCArray) -> *mut cocos2d_CCArray {
        cocos2d_CCArray_createWithArray(otherArray)
    }
    #[inline]
    pub unsafe fn createWithContentsOfFile(
        pFileName: *const ::std::os::raw::c_char,
    ) -> *mut cocos2d_CCArray {
        cocos2d_CCArray_createWithContentsOfFile(pFileName)
    }
    #[inline]
    pub unsafe fn createWithContentsOfFileThreadSafe(
        pFileName: *const ::std::os::raw::c_char,
    ) -> *mut cocos2d_CCArray {
        cocos2d_CCArray_createWithContentsOfFileThreadSafe(pFileName)
    }
    #[inline]
    pub unsafe fn init(&mut self) -> bool {
        cocos2d_CCArray_init(self)
    }
    #[inline]
    pub unsafe fn initWithObject(&mut self, pObject: *mut cocos2d_CCObject) -> bool {
        cocos2d_CCArray_initWithObject(self, pObject)
    }
    #[inline]
    pub unsafe fn initWithCapacity(&mut self, capacity: ::std::os::raw::c_uint) -> bool {
        cocos2d_CCArray_initWithCapacity(self, capacity)
    }
    #[inline]
    pub unsafe fn initWithArray(&mut self, otherArray: *mut cocos2d_CCArray) -> bool {
        cocos2d_CCArray_initWithArray(self, otherArray)
    }
    #[inline]
    pub unsafe fn count(&self) -> ::std::os::raw::c_uint {
        cocos2d_CCArray_count(self)
    }
    #[inline]
    pub unsafe fn capacity(&self) -> ::std::os::raw::c_uint {
        cocos2d_CCArray_capacity(self)
    }
    #[inline]
    pub unsafe fn indexOfObject(&self, object: *mut cocos2d_CCObject) -> ::std::os::raw::c_uint {
        cocos2d_CCArray_indexOfObject(self, object)
    }
    #[inline]
    pub unsafe fn objectAtIndex(&mut self, index: ::std::os::raw::c_uint) -> *mut cocos2d_CCObject {
        cocos2d_CCArray_objectAtIndex(self, index)
    }
    #[inline]
    pub unsafe fn lastObject(&mut self) -> *mut cocos2d_CCObject {
        cocos2d_CCArray_lastObject(self)
    }
    #[inline]
    pub unsafe fn randomObject(&mut self) -> *mut cocos2d_CCObject {
        cocos2d_CCArray_randomObject(self)
    }
    #[inline]
    pub unsafe fn containsObject(&self, object: *mut cocos2d_CCObject) -> bool {
        cocos2d_CCArray_containsObject(self, object)
    }
    #[inline]
    pub unsafe fn isEqualToArray(&mut self, pOtherArray: *mut cocos2d_CCArray) -> bool {
        cocos2d_CCArray_isEqualToArray(self, pOtherArray)
    }
    #[inline]
    pub unsafe fn addObject(&mut self, object: *mut cocos2d_CCObject) {
        cocos2d_CCArray_addObject(self, object)
    }
    #[inline]
    pub unsafe fn addObjectsFromArray(&mut self, otherArray: *mut cocos2d_CCArray) {
        cocos2d_CCArray_addObjectsFromArray(self, otherArray)
    }
    #[inline]
    pub unsafe fn insertObject(
        &mut self,
        object: *mut cocos2d_CCObject,
        index: ::std::os::raw::c_uint,
    ) {
        cocos2d_CCArray_insertObject(self, object, index)
    }
    #[inline]
    pub unsafe fn removeLastObject(&mut self, bReleaseObj: bool) {
        cocos2d_CCArray_removeLastObject(self, bReleaseObj)
    }
    #[inline]
    pub unsafe fn removeObject(&mut self, object: *mut cocos2d_CCObject, bReleaseObj: bool) {
        cocos2d_CCArray_removeObject(self, object, bReleaseObj)
    }
    #[inline]
    pub unsafe fn removeObjectAtIndex(&mut self, index: ::std::os::raw::c_uint, bReleaseObj: bool) {
        cocos2d_CCArray_removeObjectAtIndex(self, index, bReleaseObj)
    }
    #[inline]
    pub unsafe fn removeObjectsInArray(&mut self, otherArray: *mut cocos2d_CCArray) {
        cocos2d_CCArray_removeObjectsInArray(self, otherArray)
    }
    #[inline]
    pub unsafe fn removeAllObjects(&mut self) {
        cocos2d_CCArray_removeAllObjects(self)
    }
    #[inline]
    pub unsafe fn fastRemoveObject(&mut self, object: *mut cocos2d_CCObject) {
        cocos2d_CCArray_fastRemoveObject(self, object)
    }
    #[inline]
    pub unsafe fn fastRemoveObjectAtIndex(&mut self, index: ::std::os::raw::c_uint) {
        cocos2d_CCArray_fastRemoveObjectAtIndex(self, index)
    }
    #[inline]
    pub unsafe fn exchangeObject(
        &mut self,
        object1: *mut cocos2d_CCObject,
        object2: *mut cocos2d_CCObject,
    ) {
        cocos2d_CCArray_exchangeObject(self, object1, object2)
    }
    #[inline]
    pub unsafe fn exchangeObjectAtIndex(
        &mut self,
        index1: ::std::os::raw::c_uint,
        index2: ::std::os::raw::c_uint,
    ) {
        cocos2d_CCArray_exchangeObjectAtIndex(self, index1, index2)
    }
    #[inline]
    pub unsafe fn replaceObjectAtIndex(
        &mut self,
        uIndex: ::std::os::raw::c_uint,
        pObject: *mut cocos2d_CCObject,
        bReleaseObject: bool,
    ) {
        cocos2d_CCArray_replaceObjectAtIndex(self, uIndex, pObject, bReleaseObject)
    }
    #[inline]
    pub unsafe fn reverseObjects(&mut self) {
        cocos2d_CCArray_reverseObjects(self)
    }
    #[inline]
    pub unsafe fn reduceMemoryFootprint(&mut self) {
        cocos2d_CCArray_reduceMemoryFootprint(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        cocos2d_CCArray_CCArray(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(capacity: ::std::os::raw::c_uint) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        cocos2d_CCArray_CCArray1(__bindgen_tmp.as_mut_ptr(), capacity);
        __bindgen_tmp.assume_init()
    }
}
extern "thiscall" {
    #[doc = " @lua NA"]
    #[link_name = "\u{1}??1CCArray@cocos2d@@UAE@XZ"]
    pub fn cocos2d_CCArray_CCArray_destructor(this: *mut cocos2d_CCArray);
}
extern "thiscall" {
    #[doc = " override functions\n  @js NA\n  @lua NA"]
    #[link_name = "\u{1}?copyWithZone@CCArray@cocos2d@@UAEPAVCCObject@2@PAVCCZone@2@@Z"]
    pub fn cocos2d_CCArray_copyWithZone(
        this: *mut ::std::os::raw::c_void,
        pZone: *mut cocos2d_CCZone,
    ) -> *mut cocos2d_CCObject;
}
extern "thiscall" {
    #[link_name = "\u{1}?acceptVisitor@CCArray@cocos2d@@UAEXAAVCCDataVisitor@2@@Z"]
    pub fn cocos2d_CCArray_acceptVisitor(
        this: *mut ::std::os::raw::c_void,
        visitor: *mut cocos2d_CCDataVisitor,
    );
}
pub const kCCVertexAttribFlag_None: cocos2d__bindgen_ty_2 = 0;
pub const kCCVertexAttribFlag_Position: cocos2d__bindgen_ty_2 = 1;
pub const kCCVertexAttribFlag_Color: cocos2d__bindgen_ty_2 = 2;
pub const kCCVertexAttribFlag_TexCoords: cocos2d__bindgen_ty_2 = 4;
pub const kCCVertexAttribFlag_PosColorTex: cocos2d__bindgen_ty_2 = 7;
#[doc = " vertex attrib flags"]
pub type cocos2d__bindgen_ty_2 = ::std::os::raw::c_int;
pub const cocos2d_ccGLServerState_CC_GL_ALL: cocos2d_ccGLServerState = 0;
#[doc = " GL server side states"]
pub type cocos2d_ccGLServerState = ::std::os::raw::c_int;
extern "C" {
    #[doc = " Invalidates the GL state cache.\nIf CC_ENABLE_GL_STATE_CACHE it will reset the GL state cache.\n@since v2.0.0"]
    #[link_name = "\u{1}?ccGLInvalidateStateCache@cocos2d@@YAXXZ"]
    pub fn cocos2d_ccGLInvalidateStateCache();
}
extern "C" {
    #[doc = " Uses the GL program in case program is different than the current one.\nIf CC_ENABLE_GL_STATE_CACHE is disabled, it will the glUseProgram() directly.\n@since v2.0.0"]
    #[link_name = "\u{1}?ccGLUseProgram@cocos2d@@YAXI@Z"]
    pub fn cocos2d_ccGLUseProgram(program: GLuint);
}
extern "C" {
    #[doc = " Deletes the GL program. If it is the one that is being used, it invalidates it.\nIf CC_ENABLE_GL_STATE_CACHE is disabled, it will the glDeleteProgram() directly.\n@since v2.0.0"]
    #[link_name = "\u{1}?ccGLDeleteProgram@cocos2d@@YAXI@Z"]
    pub fn cocos2d_ccGLDeleteProgram(program: GLuint);
}
extern "C" {
    #[doc = " Uses a blending function in case it not already used.\nIf CC_ENABLE_GL_STATE_CACHE is disabled, it will the glBlendFunc() directly.\n@since v2.0.0"]
    #[link_name = "\u{1}?ccGLBlendFunc@cocos2d@@YAXII@Z"]
    pub fn cocos2d_ccGLBlendFunc(sfactor: GLenum, dfactor: GLenum);
}
extern "C" {
    #[doc = " Resets the blending mode back to the cached state in case you used glBlendFuncSeparate() or glBlendEquation().\nIf CC_ENABLE_GL_STATE_CACHE is disabled, it will just set the default blending mode using GL_FUNC_ADD.\n@since v2.0.0"]
    #[link_name = "\u{1}?ccGLBlendResetToCache@cocos2d@@YAXXZ"]
    pub fn cocos2d_ccGLBlendResetToCache();
}
extern "C" {
    #[doc = " sets the projection matrix as dirty\n@since v2.0.0"]
    #[link_name = "\u{1}?ccSetProjectionMatrixDirty@cocos2d@@YAXXZ"]
    pub fn cocos2d_ccSetProjectionMatrixDirty();
}
extern "C" {
    #[doc = " Will enable the vertex attribs that are passed as flags.\nPossible flags:\n\n kCCVertexAttribFlag_Position\n kCCVertexAttribFlag_Color\n kCCVertexAttribFlag_TexCoords\n\nThese flags can be ORed. The flags that are not present, will be disabled.\n\n@since v2.0.0"]
    #[link_name = "\u{1}?ccGLEnableVertexAttribs@cocos2d@@YAXI@Z"]
    pub fn cocos2d_ccGLEnableVertexAttribs(flags: ::std::os::raw::c_uint);
}
extern "C" {
    #[doc = " If the texture is not already bound to texture unit 0, it binds it.\nIf CC_ENABLE_GL_STATE_CACHE is disabled, it will call glBindTexture() directly.\n@since v2.0.0"]
    #[link_name = "\u{1}?ccGLBindTexture2D@cocos2d@@YAXI@Z"]
    pub fn cocos2d_ccGLBindTexture2D(textureId: GLuint);
}
extern "C" {
    #[doc = " If the texture is not already bound to a given unit, it binds it.\nIf CC_ENABLE_GL_STATE_CACHE is disabled, it will call glBindTexture() directly.\n@since v2.1.0"]
    #[link_name = "\u{1}?ccGLBindTexture2DN@cocos2d@@YAXII@Z"]
    pub fn cocos2d_ccGLBindTexture2DN(textureUnit: GLuint, textureId: GLuint);
}
extern "C" {
    #[doc = " It will delete a given texture. If the texture was bound, it will invalidate the cached.\nIf CC_ENABLE_GL_STATE_CACHE is disabled, it will call glDeleteTextures() directly.\n@since v2.0.0"]
    #[link_name = "\u{1}?ccGLDeleteTexture@cocos2d@@YAXI@Z"]
    pub fn cocos2d_ccGLDeleteTexture(textureId: GLuint);
}
extern "C" {
    #[doc = " It will delete a given texture. If the texture was bound, it will invalidate the cached for the given texture unit.\nIf CC_ENABLE_GL_STATE_CACHE is disabled, it will call glDeleteTextures() directly.\n@since v2.1.0"]
    #[link_name = "\u{1}?ccGLDeleteTextureN@cocos2d@@YAXII@Z"]
    pub fn cocos2d_ccGLDeleteTextureN(textureUnit: GLuint, textureId: GLuint);
}
extern "C" {
    #[doc = " If the vertex array is not already bound, it binds it.\nIf CC_ENABLE_GL_STATE_CACHE is disabled, it will call glBindVertexArray() directly.\n@since v2.0.0"]
    #[link_name = "\u{1}?ccGLBindVAO@cocos2d@@YAXI@Z"]
    pub fn cocos2d_ccGLBindVAO(vaoId: GLuint);
}
extern "C" {
    #[doc = " It will enable / disable the server side GL states.\nIf CC_ENABLE_GL_STATE_CACHE is disabled, it will call glEnable() directly.\n@since v2.0.0"]
    #[link_name = "\u{1}?ccGLEnable@cocos2d@@YAXW4ccGLServerState@1@@Z"]
    pub fn cocos2d_ccGLEnable(flags: cocos2d_ccGLServerState);
}
pub const kCCVertexAttrib_Position: cocos2d__bindgen_ty_3 = 0;
pub const kCCVertexAttrib_Color: cocos2d__bindgen_ty_3 = 1;
pub const kCCVertexAttrib_TexCoords: cocos2d__bindgen_ty_3 = 2;
pub const kCCVertexAttrib_MAX: cocos2d__bindgen_ty_3 = 3;
#[doc = " @addtogroup shaders\n @{"]
pub type cocos2d__bindgen_ty_3 = ::std::os::raw::c_int;
pub const kCCUniformPMatrix: cocos2d__bindgen_ty_4 = 0;
pub const kCCUniformMVMatrix: cocos2d__bindgen_ty_4 = 1;
pub const kCCUniformMVPMatrix: cocos2d__bindgen_ty_4 = 2;
pub const kCCUniformTime: cocos2d__bindgen_ty_4 = 3;
pub const kCCUniformSinTime: cocos2d__bindgen_ty_4 = 4;
pub const kCCUniformCosTime: cocos2d__bindgen_ty_4 = 5;
pub const kCCUniformRandom01: cocos2d__bindgen_ty_4 = 6;
pub const kCCUniformSampler: cocos2d__bindgen_ty_4 = 7;
pub const kCCUniform_MAX: cocos2d__bindgen_ty_4 = 8;
pub type cocos2d__bindgen_ty_4 = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d__hashUniformEntry {
    _unused: [u8; 0],
}
pub type cocos2d_GLInfoFunction =
    ::std::option::Option<unsafe extern "C" fn(program: GLuint, pname: GLenum, params: *mut GLint)>;
pub type cocos2d_GLLogFunction = ::std::option::Option<
    unsafe extern "C" fn(
        program: GLuint,
        bufsize: GLsizei,
        length: *mut GLsizei,
        infolog: *mut GLchar,
    ),
>;
#[doc = " @addtogroup shaders\n @{"]
#[repr(C)]
#[derive(Debug)]
pub struct cocos2d_CCGLProgram {
    pub _base: cocos2d_CCObject,
    pub m_uProgram: GLuint,
    pub m_uVertShader: GLuint,
    pub m_uFragShader: GLuint,
    pub m_uUniforms: [GLint; 8usize],
    pub m_pHashForUniforms: *mut cocos2d__hashUniformEntry,
    pub m_bUsesTime: bool,
    pub m_hasShaderCompiler: bool,
}
#[test]
fn bindgen_test_layout_cocos2d_CCGLProgram() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d_CCGLProgram> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCGLProgram>(),
        104usize,
        concat!("Size of: ", stringify!(cocos2d_CCGLProgram))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCGLProgram>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCGLProgram))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_uProgram) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCGLProgram),
            "::",
            stringify!(m_uProgram)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_uVertShader) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCGLProgram),
            "::",
            stringify!(m_uVertShader)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_uFragShader) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCGLProgram),
            "::",
            stringify!(m_uFragShader)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_uUniforms) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCGLProgram),
            "::",
            stringify!(m_uUniforms)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_pHashForUniforms) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCGLProgram),
            "::",
            stringify!(m_pHashForUniforms)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_bUsesTime) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCGLProgram),
            "::",
            stringify!(m_bUsesTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_hasShaderCompiler) as usize - ptr as usize },
        101usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCGLProgram),
            "::",
            stringify!(m_hasShaderCompiler)
        )
    );
}
extern "thiscall" {
    #[doc = " Initializes the CCGLProgram with a vertex and fragment with bytes array\n @js  initWithString\n @lua NA"]
    #[link_name = "\u{1}?initWithVertexShaderByteArray@CCGLProgram@cocos2d@@QAE_NPBD0@Z"]
    pub fn cocos2d_CCGLProgram_initWithVertexShaderByteArray(
        this: *mut cocos2d_CCGLProgram,
        vShaderByteArray: *const GLchar,
        fShaderByteArray: *const GLchar,
    ) -> bool;
}
extern "thiscall" {
    #[doc = " Initializes the CCGLProgram with a vertex and fragment with contents of filenames\n @js  init\n @lua NA"]
    #[link_name = "\u{1}?initWithVertexShaderFilename@CCGLProgram@cocos2d@@QAE_NPBD0@Z"]
    pub fn cocos2d_CCGLProgram_initWithVertexShaderFilename(
        this: *mut cocos2d_CCGLProgram,
        vShaderFilename: *const ::std::os::raw::c_char,
        fShaderFilename: *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "thiscall" {
    #[doc = "  It will add a new attribute to the shader\n @lua NA"]
    #[link_name = "\u{1}?addAttribute@CCGLProgram@cocos2d@@QAEXPBDI@Z"]
    pub fn cocos2d_CCGLProgram_addAttribute(
        this: *mut cocos2d_CCGLProgram,
        attributeName: *const ::std::os::raw::c_char,
        index: GLuint,
    );
}
extern "thiscall" {
    #[doc = " links the glProgram\n @lua NA"]
    #[link_name = "\u{1}?link@CCGLProgram@cocos2d@@QAE_NXZ"]
    pub fn cocos2d_CCGLProgram_link(this: *mut cocos2d_CCGLProgram) -> bool;
}
extern "thiscall" {
    #[doc = " it will call glUseProgram()\n @lua NA"]
    #[link_name = "\u{1}?use@CCGLProgram@cocos2d@@QAEXXZ"]
    pub fn cocos2d_CCGLProgram_use(this: *mut cocos2d_CCGLProgram);
}
extern "thiscall" {
    #[doc = " It will create 4 uniforms:\n- kCCUniformPMatrix\n- kCCUniformMVMatrix\n- kCCUniformMVPMatrix\n- kCCUniformSampler\n\nAnd it will bind \"kCCUniformSampler\" to 0\n @lua NA"]
    #[link_name = "\u{1}?updateUniforms@CCGLProgram@cocos2d@@QAEXXZ"]
    pub fn cocos2d_CCGLProgram_updateUniforms(this: *mut cocos2d_CCGLProgram);
}
extern "thiscall" {
    #[doc = " calls retrieves the named uniform location for this shader program.\n @lua NA"]
    #[link_name = "\u{1}?getUniformLocationForName@CCGLProgram@cocos2d@@QAEHPBD@Z"]
    pub fn cocos2d_CCGLProgram_getUniformLocationForName(
        this: *mut cocos2d_CCGLProgram,
        name: *const ::std::os::raw::c_char,
    ) -> GLint;
}
extern "thiscall" {
    #[doc = " calls glUniform1i only if the values are different than the previous call for this same shader program.\n  @js  setUniformLocationI32\n  @lua NA"]
    #[link_name = "\u{1}?setUniformLocationWith1i@CCGLProgram@cocos2d@@QAEXHH@Z"]
    pub fn cocos2d_CCGLProgram_setUniformLocationWith1i(
        this: *mut cocos2d_CCGLProgram,
        location: GLint,
        i1: GLint,
    );
}
extern "thiscall" {
    #[doc = " calls glUniform2i only if the values are different than the previous call for this same shader program.\n @lua NA"]
    #[link_name = "\u{1}?setUniformLocationWith2i@CCGLProgram@cocos2d@@QAEXHHH@Z"]
    pub fn cocos2d_CCGLProgram_setUniformLocationWith2i(
        this: *mut cocos2d_CCGLProgram,
        location: GLint,
        i1: GLint,
        i2: GLint,
    );
}
extern "thiscall" {
    #[doc = " calls glUniform3i only if the values are different than the previous call for this same shader program.\n @lua NA"]
    #[link_name = "\u{1}?setUniformLocationWith3i@CCGLProgram@cocos2d@@QAEXHHHH@Z"]
    pub fn cocos2d_CCGLProgram_setUniformLocationWith3i(
        this: *mut cocos2d_CCGLProgram,
        location: GLint,
        i1: GLint,
        i2: GLint,
        i3: GLint,
    );
}
extern "thiscall" {
    #[doc = " calls glUniform4i only if the values are different than the previous call for this same shader program.\n @lua NA"]
    #[link_name = "\u{1}?setUniformLocationWith4i@CCGLProgram@cocos2d@@QAEXHHHHH@Z"]
    pub fn cocos2d_CCGLProgram_setUniformLocationWith4i(
        this: *mut cocos2d_CCGLProgram,
        location: GLint,
        i1: GLint,
        i2: GLint,
        i3: GLint,
        i4: GLint,
    );
}
extern "thiscall" {
    #[doc = " calls glUniform2iv only if the values are different than the previous call for this same shader program.\n @lua NA"]
    #[link_name = "\u{1}?setUniformLocationWith2iv@CCGLProgram@cocos2d@@QAEXHPAHI@Z"]
    pub fn cocos2d_CCGLProgram_setUniformLocationWith2iv(
        this: *mut cocos2d_CCGLProgram,
        location: GLint,
        ints: *mut GLint,
        numberOfArrays: ::std::os::raw::c_uint,
    );
}
extern "thiscall" {
    #[doc = " calls glUniform3iv only if the values are different than the previous call for this same shader program.\n @lua NA"]
    #[link_name = "\u{1}?setUniformLocationWith3iv@CCGLProgram@cocos2d@@QAEXHPAHI@Z"]
    pub fn cocos2d_CCGLProgram_setUniformLocationWith3iv(
        this: *mut cocos2d_CCGLProgram,
        location: GLint,
        ints: *mut GLint,
        numberOfArrays: ::std::os::raw::c_uint,
    );
}
extern "thiscall" {
    #[doc = " calls glUniform4iv only if the values are different than the previous call for this same shader program.\n @lua NA"]
    #[link_name = "\u{1}?setUniformLocationWith4iv@CCGLProgram@cocos2d@@QAEXHPAHI@Z"]
    pub fn cocos2d_CCGLProgram_setUniformLocationWith4iv(
        this: *mut cocos2d_CCGLProgram,
        location: GLint,
        ints: *mut GLint,
        numberOfArrays: ::std::os::raw::c_uint,
    );
}
extern "thiscall" {
    #[doc = " calls glUniform1f only if the values are different than the previous call for this same shader program.\n  @js  setUniformLocationF32\n  @lua NA"]
    #[link_name = "\u{1}?setUniformLocationWith1f@CCGLProgram@cocos2d@@QAEXHM@Z"]
    pub fn cocos2d_CCGLProgram_setUniformLocationWith1f(
        this: *mut cocos2d_CCGLProgram,
        location: GLint,
        f1: GLfloat,
    );
}
extern "thiscall" {
    #[doc = " calls glUniform2f only if the values are different than the previous call for this same shader program.\n  @js  setUniformLocationF32\n  @lua NA"]
    #[link_name = "\u{1}?setUniformLocationWith2f@CCGLProgram@cocos2d@@QAEXHMM@Z"]
    pub fn cocos2d_CCGLProgram_setUniformLocationWith2f(
        this: *mut cocos2d_CCGLProgram,
        location: GLint,
        f1: GLfloat,
        f2: GLfloat,
    );
}
extern "thiscall" {
    #[doc = " calls glUniform3f only if the values are different than the previous call for this same shader program.\n  @js  setUniformLocationF32\n  @lua NA"]
    #[link_name = "\u{1}?setUniformLocationWith3f@CCGLProgram@cocos2d@@QAEXHMMM@Z"]
    pub fn cocos2d_CCGLProgram_setUniformLocationWith3f(
        this: *mut cocos2d_CCGLProgram,
        location: GLint,
        f1: GLfloat,
        f2: GLfloat,
        f3: GLfloat,
    );
}
extern "thiscall" {
    #[doc = " calls glUniform4f only if the values are different than the previous call for this same shader program.\n  @js  setUniformLocationF32\n  @lua NA"]
    #[link_name = "\u{1}?setUniformLocationWith4f@CCGLProgram@cocos2d@@QAEXHMMMM@Z"]
    pub fn cocos2d_CCGLProgram_setUniformLocationWith4f(
        this: *mut cocos2d_CCGLProgram,
        location: GLint,
        f1: GLfloat,
        f2: GLfloat,
        f3: GLfloat,
        f4: GLfloat,
    );
}
extern "thiscall" {
    #[doc = " calls glUniform2fv only if the values are different than the previous call for this same shader program.\n  @js  NA\n  @lua NA"]
    #[link_name = "\u{1}?setUniformLocationWith2fv@CCGLProgram@cocos2d@@QAEXHPAMI@Z"]
    pub fn cocos2d_CCGLProgram_setUniformLocationWith2fv(
        this: *mut cocos2d_CCGLProgram,
        location: GLint,
        floats: *mut GLfloat,
        numberOfArrays: ::std::os::raw::c_uint,
    );
}
extern "thiscall" {
    #[doc = " calls glUniform3fv only if the values are different than the previous call for this same shader program.\n  @js  NA\n  @lua NA"]
    #[link_name = "\u{1}?setUniformLocationWith3fv@CCGLProgram@cocos2d@@QAEXHPAMI@Z"]
    pub fn cocos2d_CCGLProgram_setUniformLocationWith3fv(
        this: *mut cocos2d_CCGLProgram,
        location: GLint,
        floats: *mut GLfloat,
        numberOfArrays: ::std::os::raw::c_uint,
    );
}
extern "thiscall" {
    #[doc = " calls glUniform4fv only if the values are different than the previous call for this same shader program.\n  @js  NA\n  @lua NA"]
    #[link_name = "\u{1}?setUniformLocationWith4fv@CCGLProgram@cocos2d@@QAEXHPAMI@Z"]
    pub fn cocos2d_CCGLProgram_setUniformLocationWith4fv(
        this: *mut cocos2d_CCGLProgram,
        location: GLint,
        floats: *mut GLfloat,
        numberOfArrays: ::std::os::raw::c_uint,
    );
}
extern "thiscall" {
    #[doc = " calls glUniformMatrix4fv only if the values are different than the previous call for this same shader program.\n  @js  NA\n  @lua NA"]
    #[link_name = "\u{1}?setUniformLocationWithMatrix4fv@CCGLProgram@cocos2d@@QAEXHPAMI@Z"]
    pub fn cocos2d_CCGLProgram_setUniformLocationWithMatrix4fv(
        this: *mut cocos2d_CCGLProgram,
        location: GLint,
        matrixArray: *mut GLfloat,
        numberOfMatrices: ::std::os::raw::c_uint,
    );
}
extern "thiscall" {
    #[doc = " will update the builtin uniforms if they are different than the previous call for this same shader program.\n  @lua NA"]
    #[link_name = "\u{1}?setUniformsForBuiltins@CCGLProgram@cocos2d@@QAEXXZ"]
    pub fn cocos2d_CCGLProgram_setUniformsForBuiltins(this: *mut cocos2d_CCGLProgram);
}
extern "thiscall" {
    #[doc = " returns the vertexShader error log\n  @js  getVertexShaderLog\n  @lua NA"]
    #[link_name = "\u{1}?vertexShaderLog@CCGLProgram@cocos2d@@QAEPBDXZ"]
    pub fn cocos2d_CCGLProgram_vertexShaderLog(
        this: *mut cocos2d_CCGLProgram,
    ) -> *const ::std::os::raw::c_char;
}
extern "thiscall" {
    #[doc = " returns the fragmentShader error log\n  @js  getFragmentShaderLog\n  @lua NA"]
    #[link_name = "\u{1}?fragmentShaderLog@CCGLProgram@cocos2d@@QAEPBDXZ"]
    pub fn cocos2d_CCGLProgram_fragmentShaderLog(
        this: *mut cocos2d_CCGLProgram,
    ) -> *const ::std::os::raw::c_char;
}
extern "thiscall" {
    #[doc = " returns the program error log\n  @js  getProgramLog\n  @lua NA"]
    #[link_name = "\u{1}?programLog@CCGLProgram@cocos2d@@QAEPBDXZ"]
    pub fn cocos2d_CCGLProgram_programLog(
        this: *mut cocos2d_CCGLProgram,
    ) -> *const ::std::os::raw::c_char;
}
extern "thiscall" {
    #[doc = " reload all shaders, this function is designed for android\n  when opengl context lost, so don't call it.\n  @lua NA"]
    #[link_name = "\u{1}?reset@CCGLProgram@cocos2d@@QAEXXZ"]
    pub fn cocos2d_CCGLProgram_reset(this: *mut cocos2d_CCGLProgram);
}
extern "thiscall" {
    #[link_name = "\u{1}?updateUniformLocation@CCGLProgram@cocos2d@@IAE_NHPAXI@Z"]
    pub fn cocos2d_CCGLProgram_updateUniformLocation(
        this: *mut cocos2d_CCGLProgram,
        location: GLint,
        data: *mut GLvoid,
        bytes: ::std::os::raw::c_uint,
    ) -> bool;
}
extern "thiscall" {
    #[link_name = "\u{1}?description@CCGLProgram@cocos2d@@IAEPBDXZ"]
    pub fn cocos2d_CCGLProgram_description(
        this: *mut cocos2d_CCGLProgram,
    ) -> *const ::std::os::raw::c_char;
}
extern "thiscall" {
    #[link_name = "\u{1}?compileShader@CCGLProgram@cocos2d@@IAE_NPAIIPBD@Z"]
    pub fn cocos2d_CCGLProgram_compileShader(
        this: *mut cocos2d_CCGLProgram,
        shader: *mut GLuint,
        type_: GLenum,
        source: *const GLchar,
    ) -> bool;
}
extern "thiscall" {
    #[link_name = "\u{1}?logForOpenGLObject@CCGLProgram@cocos2d@@IAEPBDIP6AXIIPAH@ZP6AXIH0PAD@Z@Z"]
    pub fn cocos2d_CCGLProgram_logForOpenGLObject(
        this: *mut cocos2d_CCGLProgram,
        object: GLuint,
        infoFunc: cocos2d_GLInfoFunction,
        logFunc: cocos2d_GLLogFunction,
    ) -> *const ::std::os::raw::c_char;
}
extern "thiscall" {
    #[doc = " @js  ctor\n @lua NA"]
    #[link_name = "\u{1}??0CCGLProgram@cocos2d@@QAE@XZ"]
    pub fn cocos2d_CCGLProgram_CCGLProgram(this: *mut cocos2d_CCGLProgram);
}
impl cocos2d_CCGLProgram {
    #[inline]
    pub unsafe fn initWithVertexShaderByteArray(
        &mut self,
        vShaderByteArray: *const GLchar,
        fShaderByteArray: *const GLchar,
    ) -> bool {
        cocos2d_CCGLProgram_initWithVertexShaderByteArray(self, vShaderByteArray, fShaderByteArray)
    }
    #[inline]
    pub unsafe fn initWithVertexShaderFilename(
        &mut self,
        vShaderFilename: *const ::std::os::raw::c_char,
        fShaderFilename: *const ::std::os::raw::c_char,
    ) -> bool {
        cocos2d_CCGLProgram_initWithVertexShaderFilename(self, vShaderFilename, fShaderFilename)
    }
    #[inline]
    pub unsafe fn addAttribute(
        &mut self,
        attributeName: *const ::std::os::raw::c_char,
        index: GLuint,
    ) {
        cocos2d_CCGLProgram_addAttribute(self, attributeName, index)
    }
    #[inline]
    pub unsafe fn link(&mut self) -> bool {
        cocos2d_CCGLProgram_link(self)
    }
    #[inline]
    pub unsafe fn use_(&mut self) {
        cocos2d_CCGLProgram_use(self)
    }
    #[inline]
    pub unsafe fn updateUniforms(&mut self) {
        cocos2d_CCGLProgram_updateUniforms(self)
    }
    #[inline]
    pub unsafe fn getUniformLocationForName(
        &mut self,
        name: *const ::std::os::raw::c_char,
    ) -> GLint {
        cocos2d_CCGLProgram_getUniformLocationForName(self, name)
    }
    #[inline]
    pub unsafe fn setUniformLocationWith1i(&mut self, location: GLint, i1: GLint) {
        cocos2d_CCGLProgram_setUniformLocationWith1i(self, location, i1)
    }
    #[inline]
    pub unsafe fn setUniformLocationWith2i(&mut self, location: GLint, i1: GLint, i2: GLint) {
        cocos2d_CCGLProgram_setUniformLocationWith2i(self, location, i1, i2)
    }
    #[inline]
    pub unsafe fn setUniformLocationWith3i(
        &mut self,
        location: GLint,
        i1: GLint,
        i2: GLint,
        i3: GLint,
    ) {
        cocos2d_CCGLProgram_setUniformLocationWith3i(self, location, i1, i2, i3)
    }
    #[inline]
    pub unsafe fn setUniformLocationWith4i(
        &mut self,
        location: GLint,
        i1: GLint,
        i2: GLint,
        i3: GLint,
        i4: GLint,
    ) {
        cocos2d_CCGLProgram_setUniformLocationWith4i(self, location, i1, i2, i3, i4)
    }
    #[inline]
    pub unsafe fn setUniformLocationWith2iv(
        &mut self,
        location: GLint,
        ints: *mut GLint,
        numberOfArrays: ::std::os::raw::c_uint,
    ) {
        cocos2d_CCGLProgram_setUniformLocationWith2iv(self, location, ints, numberOfArrays)
    }
    #[inline]
    pub unsafe fn setUniformLocationWith3iv(
        &mut self,
        location: GLint,
        ints: *mut GLint,
        numberOfArrays: ::std::os::raw::c_uint,
    ) {
        cocos2d_CCGLProgram_setUniformLocationWith3iv(self, location, ints, numberOfArrays)
    }
    #[inline]
    pub unsafe fn setUniformLocationWith4iv(
        &mut self,
        location: GLint,
        ints: *mut GLint,
        numberOfArrays: ::std::os::raw::c_uint,
    ) {
        cocos2d_CCGLProgram_setUniformLocationWith4iv(self, location, ints, numberOfArrays)
    }
    #[inline]
    pub unsafe fn setUniformLocationWith1f(&mut self, location: GLint, f1: GLfloat) {
        cocos2d_CCGLProgram_setUniformLocationWith1f(self, location, f1)
    }
    #[inline]
    pub unsafe fn setUniformLocationWith2f(&mut self, location: GLint, f1: GLfloat, f2: GLfloat) {
        cocos2d_CCGLProgram_setUniformLocationWith2f(self, location, f1, f2)
    }
    #[inline]
    pub unsafe fn setUniformLocationWith3f(
        &mut self,
        location: GLint,
        f1: GLfloat,
        f2: GLfloat,
        f3: GLfloat,
    ) {
        cocos2d_CCGLProgram_setUniformLocationWith3f(self, location, f1, f2, f3)
    }
    #[inline]
    pub unsafe fn setUniformLocationWith4f(
        &mut self,
        location: GLint,
        f1: GLfloat,
        f2: GLfloat,
        f3: GLfloat,
        f4: GLfloat,
    ) {
        cocos2d_CCGLProgram_setUniformLocationWith4f(self, location, f1, f2, f3, f4)
    }
    #[inline]
    pub unsafe fn setUniformLocationWith2fv(
        &mut self,
        location: GLint,
        floats: *mut GLfloat,
        numberOfArrays: ::std::os::raw::c_uint,
    ) {
        cocos2d_CCGLProgram_setUniformLocationWith2fv(self, location, floats, numberOfArrays)
    }
    #[inline]
    pub unsafe fn setUniformLocationWith3fv(
        &mut self,
        location: GLint,
        floats: *mut GLfloat,
        numberOfArrays: ::std::os::raw::c_uint,
    ) {
        cocos2d_CCGLProgram_setUniformLocationWith3fv(self, location, floats, numberOfArrays)
    }
    #[inline]
    pub unsafe fn setUniformLocationWith4fv(
        &mut self,
        location: GLint,
        floats: *mut GLfloat,
        numberOfArrays: ::std::os::raw::c_uint,
    ) {
        cocos2d_CCGLProgram_setUniformLocationWith4fv(self, location, floats, numberOfArrays)
    }
    #[inline]
    pub unsafe fn setUniformLocationWithMatrix4fv(
        &mut self,
        location: GLint,
        matrixArray: *mut GLfloat,
        numberOfMatrices: ::std::os::raw::c_uint,
    ) {
        cocos2d_CCGLProgram_setUniformLocationWithMatrix4fv(
            self,
            location,
            matrixArray,
            numberOfMatrices,
        )
    }
    #[inline]
    pub unsafe fn setUniformsForBuiltins(&mut self) {
        cocos2d_CCGLProgram_setUniformsForBuiltins(self)
    }
    #[inline]
    pub unsafe fn vertexShaderLog(&mut self) -> *const ::std::os::raw::c_char {
        cocos2d_CCGLProgram_vertexShaderLog(self)
    }
    #[inline]
    pub unsafe fn fragmentShaderLog(&mut self) -> *const ::std::os::raw::c_char {
        cocos2d_CCGLProgram_fragmentShaderLog(self)
    }
    #[inline]
    pub unsafe fn programLog(&mut self) -> *const ::std::os::raw::c_char {
        cocos2d_CCGLProgram_programLog(self)
    }
    #[inline]
    pub unsafe fn reset(&mut self) {
        cocos2d_CCGLProgram_reset(self)
    }
    #[inline]
    pub unsafe fn updateUniformLocation(
        &mut self,
        location: GLint,
        data: *mut GLvoid,
        bytes: ::std::os::raw::c_uint,
    ) -> bool {
        cocos2d_CCGLProgram_updateUniformLocation(self, location, data, bytes)
    }
    #[inline]
    pub unsafe fn description(&mut self) -> *const ::std::os::raw::c_char {
        cocos2d_CCGLProgram_description(self)
    }
    #[inline]
    pub unsafe fn compileShader(
        &mut self,
        shader: *mut GLuint,
        type_: GLenum,
        source: *const GLchar,
    ) -> bool {
        cocos2d_CCGLProgram_compileShader(self, shader, type_, source)
    }
    #[inline]
    pub unsafe fn logForOpenGLObject(
        &mut self,
        object: GLuint,
        infoFunc: cocos2d_GLInfoFunction,
        logFunc: cocos2d_GLLogFunction,
    ) -> *const ::std::os::raw::c_char {
        cocos2d_CCGLProgram_logForOpenGLObject(self, object, infoFunc, logFunc)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        cocos2d_CCGLProgram_CCGLProgram(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
}
extern "thiscall" {
    #[doc = " @js NA\n @lua NA"]
    #[link_name = "\u{1}??1CCGLProgram@cocos2d@@UAE@XZ"]
    pub fn cocos2d_CCGLProgram_CCGLProgram_destructor(this: *mut cocos2d_CCGLProgram);
}
#[doc = "@brief The device accelerometer reports values for each axis in units of g-force"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d_CCAcceleration {
    pub x: f64,
    pub y: f64,
    pub z: f64,
    pub timestamp: f64,
}
#[test]
fn bindgen_test_layout_cocos2d_CCAcceleration() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d_CCAcceleration> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCAcceleration>(),
        32usize,
        concat!("Size of: ", stringify!(cocos2d_CCAcceleration))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCAcceleration>(),
        8usize,
        concat!("Alignment of ", stringify!(cocos2d_CCAcceleration))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCAcceleration),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCAcceleration),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCAcceleration),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timestamp) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCAcceleration),
            "::",
            stringify!(timestamp)
        )
    );
}
#[repr(C)]
pub struct cocos2d_CCAccelerometerDelegate__bindgen_vtable(::std::os::raw::c_void);
#[doc = "@brief\nThe CCAccelerometerDelegate defines a single method for\nreceiving acceleration-related data from the system.\n@js NA\n@lua NA"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d_CCAccelerometerDelegate {
    pub vtable_: *const cocos2d_CCAccelerometerDelegate__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_cocos2d_CCAccelerometerDelegate() {
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCAccelerometerDelegate>(),
        4usize,
        concat!("Size of: ", stringify!(cocos2d_CCAccelerometerDelegate))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCAccelerometerDelegate>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCAccelerometerDelegate))
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct cocos2d_CCAccelerometer {
    pub m_obAccelerationValue: cocos2d_CCAcceleration,
    pub m_pAccelDelegate: *mut cocos2d_CCAccelerometerDelegate,
}
#[test]
fn bindgen_test_layout_cocos2d_CCAccelerometer() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d_CCAccelerometer> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCAccelerometer>(),
        40usize,
        concat!("Size of: ", stringify!(cocos2d_CCAccelerometer))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCAccelerometer>(),
        8usize,
        concat!("Alignment of ", stringify!(cocos2d_CCAccelerometer))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_obAccelerationValue) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCAccelerometer),
            "::",
            stringify!(m_obAccelerationValue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_pAccelDelegate) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCAccelerometer),
            "::",
            stringify!(m_pAccelDelegate)
        )
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?setDelegate@CCAccelerometer@cocos2d@@QAEXPAVCCAccelerometerDelegate@2@@Z"]
    pub fn cocos2d_CCAccelerometer_setDelegate(
        this: *mut cocos2d_CCAccelerometer,
        pDelegate: *mut cocos2d_CCAccelerometerDelegate,
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?setAccelerometerInterval@CCAccelerometer@cocos2d@@QAEXM@Z"]
    pub fn cocos2d_CCAccelerometer_setAccelerometerInterval(
        this: *mut cocos2d_CCAccelerometer,
        interval: f32,
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?update@CCAccelerometer@cocos2d@@QAEXNNNN@Z"]
    pub fn cocos2d_CCAccelerometer_update(
        this: *mut cocos2d_CCAccelerometer,
        x: f64,
        y: f64,
        z: f64,
        timestamp: f64,
    );
}
extern "thiscall" {
    #[link_name = "\u{1}??0CCAccelerometer@cocos2d@@QAE@XZ"]
    pub fn cocos2d_CCAccelerometer_CCAccelerometer(this: *mut cocos2d_CCAccelerometer);
}
extern "thiscall" {
    #[link_name = "\u{1}??1CCAccelerometer@cocos2d@@QAE@XZ"]
    pub fn cocos2d_CCAccelerometer_CCAccelerometer_destructor(this: *mut cocos2d_CCAccelerometer);
}
impl cocos2d_CCAccelerometer {
    #[inline]
    pub unsafe fn setDelegate(&mut self, pDelegate: *mut cocos2d_CCAccelerometerDelegate) {
        cocos2d_CCAccelerometer_setDelegate(self, pDelegate)
    }
    #[inline]
    pub unsafe fn setAccelerometerInterval(&mut self, interval: f32) {
        cocos2d_CCAccelerometer_setAccelerometerInterval(self, interval)
    }
    #[inline]
    pub unsafe fn update(&mut self, x: f64, y: f64, z: f64, timestamp: f64) {
        cocos2d_CCAccelerometer_update(self, x, y, z, timestamp)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        cocos2d_CCAccelerometer_CCAccelerometer(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        cocos2d_CCAccelerometer_CCAccelerometer_destructor(self)
    }
}
#[doc = " @addtogroup input\n @{"]
#[repr(C)]
#[derive(Debug)]
pub struct cocos2d_CCTouch {
    pub _base: cocos2d_CCObject,
    pub m_nId: ::std::os::raw::c_int,
    pub m_startPointCaptured: bool,
    pub m_startPoint: cocos2d_CCPoint,
    pub m_point: cocos2d_CCPoint,
    pub m_prevPoint: cocos2d_CCPoint,
}
#[test]
fn bindgen_test_layout_cocos2d_CCTouch() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d_CCTouch> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCTouch>(),
        84usize,
        concat!("Size of: ", stringify!(cocos2d_CCTouch))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCTouch>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCTouch))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_nId) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCTouch),
            "::",
            stringify!(m_nId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_startPointCaptured) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCTouch),
            "::",
            stringify!(m_startPointCaptured)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_startPoint) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCTouch),
            "::",
            stringify!(m_startPoint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_point) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCTouch),
            "::",
            stringify!(m_point)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_prevPoint) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCTouch),
            "::",
            stringify!(m_prevPoint)
        )
    );
}
extern "thiscall" {
    #[doc = " returns the current touch location in OpenGL coordinates"]
    #[link_name = "\u{1}?getLocation@CCTouch@cocos2d@@QBE?AVCCPoint@2@XZ"]
    pub fn cocos2d_CCTouch_getLocation(this: *const cocos2d_CCTouch) -> cocos2d_CCPoint;
}
extern "thiscall" {
    #[doc = " returns the previous touch location in OpenGL coordinates"]
    #[link_name = "\u{1}?getPreviousLocation@CCTouch@cocos2d@@QBE?AVCCPoint@2@XZ"]
    pub fn cocos2d_CCTouch_getPreviousLocation(this: *const cocos2d_CCTouch) -> cocos2d_CCPoint;
}
extern "thiscall" {
    #[doc = " returns the start touch location in OpenGL coordinates"]
    #[link_name = "\u{1}?getStartLocation@CCTouch@cocos2d@@QBE?AVCCPoint@2@XZ"]
    pub fn cocos2d_CCTouch_getStartLocation(this: *const cocos2d_CCTouch) -> cocos2d_CCPoint;
}
extern "thiscall" {
    #[doc = " returns the delta of 2 current touches locations in screen coordinates"]
    #[link_name = "\u{1}?getDelta@CCTouch@cocos2d@@QBE?AVCCPoint@2@XZ"]
    pub fn cocos2d_CCTouch_getDelta(this: *const cocos2d_CCTouch) -> cocos2d_CCPoint;
}
extern "thiscall" {
    #[doc = " returns the current touch location in screen coordinates"]
    #[link_name = "\u{1}?getLocationInView@CCTouch@cocos2d@@QBE?AVCCPoint@2@XZ"]
    pub fn cocos2d_CCTouch_getLocationInView(this: *const cocos2d_CCTouch) -> cocos2d_CCPoint;
}
extern "thiscall" {
    #[doc = " returns the previous touch location in screen coordinates"]
    #[link_name = "\u{1}?getPreviousLocationInView@CCTouch@cocos2d@@QBE?AVCCPoint@2@XZ"]
    pub fn cocos2d_CCTouch_getPreviousLocationInView(
        this: *const cocos2d_CCTouch,
    ) -> cocos2d_CCPoint;
}
extern "thiscall" {
    #[doc = " returns the start touch location in screen coordinates"]
    #[link_name = "\u{1}?getStartLocationInView@CCTouch@cocos2d@@QBE?AVCCPoint@2@XZ"]
    pub fn cocos2d_CCTouch_getStartLocationInView(this: *const cocos2d_CCTouch) -> cocos2d_CCPoint;
}
impl cocos2d_CCTouch {
    #[inline]
    pub unsafe fn getLocation(&self) -> cocos2d_CCPoint {
        cocos2d_CCTouch_getLocation(self)
    }
    #[inline]
    pub unsafe fn getPreviousLocation(&self) -> cocos2d_CCPoint {
        cocos2d_CCTouch_getPreviousLocation(self)
    }
    #[inline]
    pub unsafe fn getStartLocation(&self) -> cocos2d_CCPoint {
        cocos2d_CCTouch_getStartLocation(self)
    }
    #[inline]
    pub unsafe fn getDelta(&self) -> cocos2d_CCPoint {
        cocos2d_CCTouch_getDelta(self)
    }
    #[inline]
    pub unsafe fn getLocationInView(&self) -> cocos2d_CCPoint {
        cocos2d_CCTouch_getLocationInView(self)
    }
    #[inline]
    pub unsafe fn getPreviousLocationInView(&self) -> cocos2d_CCPoint {
        cocos2d_CCTouch_getPreviousLocationInView(self)
    }
    #[inline]
    pub unsafe fn getStartLocationInView(&self) -> cocos2d_CCPoint {
        cocos2d_CCTouch_getStartLocationInView(self)
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct cocos2d_CCEvent {
    pub _base: cocos2d_CCObject,
}
#[test]
fn bindgen_test_layout_cocos2d_CCEvent() {
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCEvent>(),
        52usize,
        concat!("Size of: ", stringify!(cocos2d_CCEvent))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCEvent>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCEvent))
    );
}
#[doc = " @addtogroup data_structures\n @{"]
pub type cocos2d_CCSetIterator = u8;
#[repr(C)]
#[derive(Debug)]
pub struct cocos2d_CCSet {
    pub _base: cocos2d_CCObject,
    pub m_pSet: *mut [u32; 2usize],
}
#[test]
fn bindgen_test_layout_cocos2d_CCSet() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d_CCSet> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCSet>(),
        56usize,
        concat!("Size of: ", stringify!(cocos2d_CCSet))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCSet>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCSet))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_pSet) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCSet),
            "::",
            stringify!(m_pSet)
        )
    );
}
extern "C" {
    #[doc = " @brief Create and return a new empty set.\n @lua NA"]
    #[link_name = "\u{1}?create@CCSet@cocos2d@@SAPAV12@XZ"]
    pub fn cocos2d_CCSet_create() -> *mut cocos2d_CCSet;
}
extern "thiscall" {
    #[doc = "@brief Return a copy of the CCSet, it will copy all the elements."]
    #[link_name = "\u{1}?copy@CCSet@cocos2d@@QAEPAV12@XZ"]
    pub fn cocos2d_CCSet_copy(this: *mut cocos2d_CCSet) -> *mut cocos2d_CCSet;
}
extern "thiscall" {
    #[doc = "@brief It is the same as copy().\n@lua NA"]
    #[link_name = "\u{1}?mutableCopy@CCSet@cocos2d@@QAEPAV12@XZ"]
    pub fn cocos2d_CCSet_mutableCopy(this: *mut cocos2d_CCSet) -> *mut cocos2d_CCSet;
}
extern "thiscall" {
    #[doc = "@brief Return the number of elements the CCSet contains."]
    #[link_name = "\u{1}?count@CCSet@cocos2d@@QAEHXZ"]
    pub fn cocos2d_CCSet_count(this: *mut cocos2d_CCSet) -> ::std::os::raw::c_int;
}
extern "thiscall" {
    #[doc = "@brief Add a element into CCSet, it will retain the element."]
    #[link_name = "\u{1}?addObject@CCSet@cocos2d@@QAEXPAVCCObject@2@@Z"]
    pub fn cocos2d_CCSet_addObject(this: *mut cocos2d_CCSet, pObject: *mut cocos2d_CCObject);
}
extern "thiscall" {
    #[doc = "@brief Remove the given element, nothing todo if no element equals pObject."]
    #[link_name = "\u{1}?removeObject@CCSet@cocos2d@@QAEXPAVCCObject@2@@Z"]
    pub fn cocos2d_CCSet_removeObject(this: *mut cocos2d_CCSet, pObject: *mut cocos2d_CCObject);
}
extern "thiscall" {
    #[doc = "@brief Remove all elements of the set"]
    #[link_name = "\u{1}?removeAllObjects@CCSet@cocos2d@@QAEXXZ"]
    pub fn cocos2d_CCSet_removeAllObjects(this: *mut cocos2d_CCSet);
}
extern "thiscall" {
    #[doc = "@brief Check if CCSet contains a element equals pObject."]
    #[link_name = "\u{1}?containsObject@CCSet@cocos2d@@QAE_NPAVCCObject@2@@Z"]
    pub fn cocos2d_CCSet_containsObject(
        this: *mut cocos2d_CCSet,
        pObject: *mut cocos2d_CCObject,
    ) -> bool;
}
extern "thiscall" {
    #[doc = "@brief Return the iterator that points to the first element.\n@js NA\n@lua NA"]
    #[link_name = "\u{1}?begin@CCSet@cocos2d@@QAE?AV?$_Tree_const_iterator@V?$_Tree_val@U?$_Tree_simple_types@PAVCCObject@cocos2d@@@std@@@std@@@std@@XZ"]
    pub fn cocos2d_CCSet_begin(this: *mut cocos2d_CCSet) -> cocos2d_CCSetIterator;
}
extern "thiscall" {
    #[doc = "@brief Return the iterator that points to the position after the last element.\n@js NA\n@lua NA"]
    #[link_name = "\u{1}?end@CCSet@cocos2d@@QAE?AV?$_Tree_const_iterator@V?$_Tree_val@U?$_Tree_simple_types@PAVCCObject@cocos2d@@@std@@@std@@@std@@XZ"]
    pub fn cocos2d_CCSet_end(this: *mut cocos2d_CCSet) -> cocos2d_CCSetIterator;
}
extern "thiscall" {
    #[doc = "@brief Return the first element if it contains elements, or null if it doesn't contain any element."]
    #[link_name = "\u{1}?anyObject@CCSet@cocos2d@@QAEPAVCCObject@2@XZ"]
    pub fn cocos2d_CCSet_anyObject(this: *mut cocos2d_CCSet) -> *mut cocos2d_CCObject;
}
extern "thiscall" {
    #[doc = " @js  ctor\n @lua NA"]
    #[link_name = "\u{1}??0CCSet@cocos2d@@QAE@XZ"]
    pub fn cocos2d_CCSet_CCSet(this: *mut cocos2d_CCSet);
}
extern "thiscall" {
    #[doc = " @lua NA"]
    #[link_name = "\u{1}??0CCSet@cocos2d@@QAE@ABV01@@Z"]
    pub fn cocos2d_CCSet_CCSet1(this: *mut cocos2d_CCSet, rSetObject: *const cocos2d_CCSet);
}
impl cocos2d_CCSet {
    #[inline]
    pub unsafe fn create() -> *mut cocos2d_CCSet {
        cocos2d_CCSet_create()
    }
    #[inline]
    pub unsafe fn copy(&mut self) -> *mut cocos2d_CCSet {
        cocos2d_CCSet_copy(self)
    }
    #[inline]
    pub unsafe fn mutableCopy(&mut self) -> *mut cocos2d_CCSet {
        cocos2d_CCSet_mutableCopy(self)
    }
    #[inline]
    pub unsafe fn count(&mut self) -> ::std::os::raw::c_int {
        cocos2d_CCSet_count(self)
    }
    #[inline]
    pub unsafe fn addObject(&mut self, pObject: *mut cocos2d_CCObject) {
        cocos2d_CCSet_addObject(self, pObject)
    }
    #[inline]
    pub unsafe fn removeObject(&mut self, pObject: *mut cocos2d_CCObject) {
        cocos2d_CCSet_removeObject(self, pObject)
    }
    #[inline]
    pub unsafe fn removeAllObjects(&mut self) {
        cocos2d_CCSet_removeAllObjects(self)
    }
    #[inline]
    pub unsafe fn containsObject(&mut self, pObject: *mut cocos2d_CCObject) -> bool {
        cocos2d_CCSet_containsObject(self, pObject)
    }
    #[inline]
    pub unsafe fn begin(&mut self) -> cocos2d_CCSetIterator {
        cocos2d_CCSet_begin(self)
    }
    #[inline]
    pub unsafe fn end(&mut self) -> cocos2d_CCSetIterator {
        cocos2d_CCSet_end(self)
    }
    #[inline]
    pub unsafe fn anyObject(&mut self) -> *mut cocos2d_CCObject {
        cocos2d_CCSet_anyObject(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        cocos2d_CCSet_CCSet(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(rSetObject: *const cocos2d_CCSet) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        cocos2d_CCSet_CCSet1(__bindgen_tmp.as_mut_ptr(), rSetObject);
        __bindgen_tmp.assume_init()
    }
}
extern "thiscall" {
    #[doc = " @js NA\n @lua NA"]
    #[link_name = "\u{1}??1CCSet@cocos2d@@UAE@XZ"]
    pub fn cocos2d_CCSet_CCSet_destructor(this: *mut cocos2d_CCSet);
}
extern "thiscall" {
    #[doc = " @js NA\n @lua NA"]
    #[link_name = "\u{1}?acceptVisitor@CCSet@cocos2d@@UAEXAAVCCDataVisitor@2@@Z"]
    pub fn cocos2d_CCSet_acceptVisitor(
        this: *mut ::std::os::raw::c_void,
        visitor: *mut cocos2d_CCDataVisitor,
    );
}
pub const cocos2d_ccScriptType_kScriptTypeNone: cocos2d_ccScriptType = 0;
pub const cocos2d_ccScriptType_kScriptTypeLua: cocos2d_ccScriptType = 1;
pub const cocos2d_ccScriptType_kScriptTypeJavascript: cocos2d_ccScriptType = 2;
pub type cocos2d_ccScriptType = ::std::os::raw::c_int;
#[doc = " @js NA\n @lua NA"]
#[repr(C)]
#[derive(Debug)]
pub struct cocos2d_CCScriptHandlerEntry {
    pub _base: cocos2d_CCObject,
    pub m_nHandler: ::std::os::raw::c_int,
    pub m_nEntryId: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_cocos2d_CCScriptHandlerEntry() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d_CCScriptHandlerEntry> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCScriptHandlerEntry>(),
        60usize,
        concat!("Size of: ", stringify!(cocos2d_CCScriptHandlerEntry))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCScriptHandlerEntry>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCScriptHandlerEntry))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_nHandler) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCScriptHandlerEntry),
            "::",
            stringify!(m_nHandler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_nEntryId) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCScriptHandlerEntry),
            "::",
            stringify!(m_nEntryId)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}?create@CCScriptHandlerEntry@cocos2d@@SAPAV12@H@Z"]
    pub fn cocos2d_CCScriptHandlerEntry_create(
        nHandler: ::std::os::raw::c_int,
    ) -> *mut cocos2d_CCScriptHandlerEntry;
}
impl cocos2d_CCScriptHandlerEntry {
    #[inline]
    pub unsafe fn create(nHandler: ::std::os::raw::c_int) -> *mut cocos2d_CCScriptHandlerEntry {
        cocos2d_CCScriptHandlerEntry_create(nHandler)
    }
}
extern "thiscall" {
    #[link_name = "\u{1}??1CCScriptHandlerEntry@cocos2d@@UAE@XZ"]
    pub fn cocos2d_CCScriptHandlerEntry_CCScriptHandlerEntry_destructor(
        this: *mut cocos2d_CCScriptHandlerEntry,
    );
}
#[doc = " @addtogroup script_support\n @{\n @js NA\n @lua NA"]
#[repr(C)]
#[derive(Debug)]
pub struct cocos2d_CCSchedulerScriptHandlerEntry {
    pub _base: cocos2d_CCScriptHandlerEntry,
    pub m_pTimer: *mut cocos2d_CCTimer,
    pub m_bPaused: bool,
    pub m_bMarkedForDeletion: bool,
}
#[test]
fn bindgen_test_layout_cocos2d_CCSchedulerScriptHandlerEntry() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d_CCSchedulerScriptHandlerEntry> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCSchedulerScriptHandlerEntry>(),
        68usize,
        concat!(
            "Size of: ",
            stringify!(cocos2d_CCSchedulerScriptHandlerEntry)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCSchedulerScriptHandlerEntry>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(cocos2d_CCSchedulerScriptHandlerEntry)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_pTimer) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCSchedulerScriptHandlerEntry),
            "::",
            stringify!(m_pTimer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_bPaused) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCSchedulerScriptHandlerEntry),
            "::",
            stringify!(m_bPaused)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_bMarkedForDeletion) as usize - ptr as usize },
        65usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCSchedulerScriptHandlerEntry),
            "::",
            stringify!(m_bMarkedForDeletion)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}?create@CCSchedulerScriptHandlerEntry@cocos2d@@SAPAV12@HM_N@Z"]
    pub fn cocos2d_CCSchedulerScriptHandlerEntry_create(
        nHandler: ::std::os::raw::c_int,
        fInterval: f32,
        bPaused: bool,
    ) -> *mut cocos2d_CCSchedulerScriptHandlerEntry;
}
impl cocos2d_CCSchedulerScriptHandlerEntry {
    #[inline]
    pub unsafe fn create(
        nHandler: ::std::os::raw::c_int,
        fInterval: f32,
        bPaused: bool,
    ) -> *mut cocos2d_CCSchedulerScriptHandlerEntry {
        cocos2d_CCSchedulerScriptHandlerEntry_create(nHandler, fInterval, bPaused)
    }
}
extern "thiscall" {
    #[link_name = "\u{1}??1CCSchedulerScriptHandlerEntry@cocos2d@@UAE@XZ"]
    pub fn cocos2d_CCSchedulerScriptHandlerEntry_CCSchedulerScriptHandlerEntry_destructor(
        this: *mut cocos2d_CCSchedulerScriptHandlerEntry,
    );
}
#[doc = " @js NA\n @lua NA"]
#[repr(C)]
#[derive(Debug)]
pub struct cocos2d_CCTouchScriptHandlerEntry {
    pub _base: cocos2d_CCScriptHandlerEntry,
    pub m_bIsMultiTouches: bool,
    pub m_nPriority: ::std::os::raw::c_int,
    pub m_bSwallowsTouches: bool,
}
#[test]
fn bindgen_test_layout_cocos2d_CCTouchScriptHandlerEntry() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d_CCTouchScriptHandlerEntry> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCTouchScriptHandlerEntry>(),
        72usize,
        concat!("Size of: ", stringify!(cocos2d_CCTouchScriptHandlerEntry))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCTouchScriptHandlerEntry>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(cocos2d_CCTouchScriptHandlerEntry)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_bIsMultiTouches) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCTouchScriptHandlerEntry),
            "::",
            stringify!(m_bIsMultiTouches)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_nPriority) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCTouchScriptHandlerEntry),
            "::",
            stringify!(m_nPriority)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_bSwallowsTouches) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCTouchScriptHandlerEntry),
            "::",
            stringify!(m_bSwallowsTouches)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}?create@CCTouchScriptHandlerEntry@cocos2d@@SAPAV12@H_NH0@Z"]
    pub fn cocos2d_CCTouchScriptHandlerEntry_create(
        nHandler: ::std::os::raw::c_int,
        bIsMultiTouches: bool,
        nPriority: ::std::os::raw::c_int,
        bSwallowsTouches: bool,
    ) -> *mut cocos2d_CCTouchScriptHandlerEntry;
}
impl cocos2d_CCTouchScriptHandlerEntry {
    #[inline]
    pub unsafe fn create(
        nHandler: ::std::os::raw::c_int,
        bIsMultiTouches: bool,
        nPriority: ::std::os::raw::c_int,
        bSwallowsTouches: bool,
    ) -> *mut cocos2d_CCTouchScriptHandlerEntry {
        cocos2d_CCTouchScriptHandlerEntry_create(
            nHandler,
            bIsMultiTouches,
            nPriority,
            bSwallowsTouches,
        )
    }
}
extern "thiscall" {
    #[link_name = "\u{1}??1CCTouchScriptHandlerEntry@cocos2d@@UAE@XZ"]
    pub fn cocos2d_CCTouchScriptHandlerEntry_CCTouchScriptHandlerEntry_destructor(
        this: *mut cocos2d_CCTouchScriptHandlerEntry,
    );
}
#[repr(C)]
pub struct cocos2d_CCScriptEngineProtocol__bindgen_vtable(::std::os::raw::c_void);
#[doc = " @js NA\n @lua NA"]
#[repr(C)]
#[derive(Debug)]
pub struct cocos2d_CCScriptEngineProtocol {
    pub vtable_: *const cocos2d_CCScriptEngineProtocol__bindgen_vtable,
}
pub const cocos2d_CCScriptEngineProtocol_ConfigType_NONE:
    cocos2d_CCScriptEngineProtocol_ConfigType = 0;
pub const cocos2d_CCScriptEngineProtocol_ConfigType_COCOSTUDIO:
    cocos2d_CCScriptEngineProtocol_ConfigType = 1;
pub type cocos2d_CCScriptEngineProtocol_ConfigType = ::std::os::raw::c_int;
#[test]
fn bindgen_test_layout_cocos2d_CCScriptEngineProtocol() {
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCScriptEngineProtocol>(),
        4usize,
        concat!("Size of: ", stringify!(cocos2d_CCScriptEngineProtocol))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCScriptEngineProtocol>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCScriptEngineProtocol))
    );
}
#[doc = "CCScriptEngineManager is a singleton which holds an object instance of CCScriptEngineProtocl\nIt helps cocos2d-x and the user code to find back LuaEngine object\n@since v0.99.5-x-0.8.5\n@js NA\n@lua NA"]
#[repr(C)]
#[derive(Debug)]
pub struct cocos2d_CCScriptEngineManager {
    pub m_pScriptEngine: *mut cocos2d_CCScriptEngineProtocol,
}
#[test]
fn bindgen_test_layout_cocos2d_CCScriptEngineManager() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d_CCScriptEngineManager> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCScriptEngineManager>(),
        4usize,
        concat!("Size of: ", stringify!(cocos2d_CCScriptEngineManager))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCScriptEngineManager>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCScriptEngineManager))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_pScriptEngine) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCScriptEngineManager),
            "::",
            stringify!(m_pScriptEngine)
        )
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?setScriptEngine@CCScriptEngineManager@cocos2d@@QAEXPAVCCScriptEngineProtocol@2@@Z"]
    pub fn cocos2d_CCScriptEngineManager_setScriptEngine(
        this: *mut cocos2d_CCScriptEngineManager,
        pScriptEngine: *mut cocos2d_CCScriptEngineProtocol,
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?removeScriptEngine@CCScriptEngineManager@cocos2d@@QAEXXZ"]
    pub fn cocos2d_CCScriptEngineManager_removeScriptEngine(
        this: *mut cocos2d_CCScriptEngineManager,
    );
}
extern "C" {
    #[link_name = "\u{1}?sharedManager@CCScriptEngineManager@cocos2d@@SAPAV12@XZ"]
    pub fn cocos2d_CCScriptEngineManager_sharedManager() -> *mut cocos2d_CCScriptEngineManager;
}
extern "C" {
    #[link_name = "\u{1}?purgeSharedManager@CCScriptEngineManager@cocos2d@@SAXXZ"]
    pub fn cocos2d_CCScriptEngineManager_purgeSharedManager();
}
extern "thiscall" {
    #[link_name = "\u{1}??1CCScriptEngineManager@cocos2d@@QAE@XZ"]
    pub fn cocos2d_CCScriptEngineManager_CCScriptEngineManager_destructor(
        this: *mut cocos2d_CCScriptEngineManager,
    );
}
impl cocos2d_CCScriptEngineManager {
    #[inline]
    pub unsafe fn setScriptEngine(&mut self, pScriptEngine: *mut cocos2d_CCScriptEngineProtocol) {
        cocos2d_CCScriptEngineManager_setScriptEngine(self, pScriptEngine)
    }
    #[inline]
    pub unsafe fn removeScriptEngine(&mut self) {
        cocos2d_CCScriptEngineManager_removeScriptEngine(self)
    }
    #[inline]
    pub unsafe fn sharedManager() -> *mut cocos2d_CCScriptEngineManager {
        cocos2d_CCScriptEngineManager_sharedManager()
    }
    #[inline]
    pub unsafe fn purgeSharedManager() {
        cocos2d_CCScriptEngineManager_purgeSharedManager()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        cocos2d_CCScriptEngineManager_CCScriptEngineManager_destructor(self)
    }
}
#[doc = " RGB color composed of bytes 3 bytes\n@since v0.8"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d__ccColor3B {
    pub r: GLubyte,
    pub g: GLubyte,
    pub b: GLubyte,
}
#[test]
fn bindgen_test_layout_cocos2d__ccColor3B() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d__ccColor3B> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d__ccColor3B>(),
        3usize,
        concat!("Size of: ", stringify!(cocos2d__ccColor3B))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d__ccColor3B>(),
        1usize,
        concat!("Alignment of ", stringify!(cocos2d__ccColor3B))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccColor3B),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).g) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccColor3B),
            "::",
            stringify!(g)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccColor3B),
            "::",
            stringify!(b)
        )
    );
}
#[doc = " RGB color composed of bytes 3 bytes\n@since v0.8"]
pub type cocos2d_ccColor3B = cocos2d__ccColor3B;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d__ccHSVValue {
    pub h: f32,
    pub s: f32,
    pub v: f32,
    pub absoluteSaturation: GLubyte,
    pub absoluteBrightness: GLubyte,
    pub __pad: [::std::os::raw::c_uchar; 2usize],
}
#[test]
fn bindgen_test_layout_cocos2d__ccHSVValue() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d__ccHSVValue> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d__ccHSVValue>(),
        16usize,
        concat!("Size of: ", stringify!(cocos2d__ccHSVValue))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d__ccHSVValue>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d__ccHSVValue))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).h) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccHSVValue),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccHSVValue),
            "::",
            stringify!(s)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccHSVValue),
            "::",
            stringify!(v)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).absoluteSaturation) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccHSVValue),
            "::",
            stringify!(absoluteSaturation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).absoluteBrightness) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccHSVValue),
            "::",
            stringify!(absoluteBrightness)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccHSVValue),
            "::",
            stringify!(__pad)
        )
    );
}
pub type cocos2d_ccHSVValue = cocos2d__ccHSVValue;
extern "C" {
    #[doc = "! White color (255,255,255)"]
    #[link_name = "\u{1}?ccWHITE@cocos2d@@3U_ccColor3B@1@B"]
    pub static cocos2d_ccWHITE: cocos2d_ccColor3B;
}
extern "C" {
    #[doc = "! Yellow color (255,255,0)"]
    #[link_name = "\u{1}?ccYELLOW@cocos2d@@3U_ccColor3B@1@B"]
    pub static cocos2d_ccYELLOW: cocos2d_ccColor3B;
}
extern "C" {
    #[doc = "! Blue color (0,0,255)"]
    #[link_name = "\u{1}?ccBLUE@cocos2d@@3U_ccColor3B@1@B"]
    pub static cocos2d_ccBLUE: cocos2d_ccColor3B;
}
extern "C" {
    #[doc = "! Green Color (0,255,0)"]
    #[link_name = "\u{1}?ccGREEN@cocos2d@@3U_ccColor3B@1@B"]
    pub static cocos2d_ccGREEN: cocos2d_ccColor3B;
}
extern "C" {
    #[doc = "! Red Color (255,0,0,)"]
    #[link_name = "\u{1}?ccRED@cocos2d@@3U_ccColor3B@1@B"]
    pub static cocos2d_ccRED: cocos2d_ccColor3B;
}
extern "C" {
    #[doc = "! Magenta Color (255,0,255)"]
    #[link_name = "\u{1}?ccMAGENTA@cocos2d@@3U_ccColor3B@1@B"]
    pub static cocos2d_ccMAGENTA: cocos2d_ccColor3B;
}
extern "C" {
    #[doc = "! Black Color (0,0,0)"]
    #[link_name = "\u{1}?ccBLACK@cocos2d@@3U_ccColor3B@1@B"]
    pub static cocos2d_ccBLACK: cocos2d_ccColor3B;
}
extern "C" {
    #[doc = "! Orange Color (255,127,0)"]
    #[link_name = "\u{1}?ccORANGE@cocos2d@@3U_ccColor3B@1@B"]
    pub static cocos2d_ccORANGE: cocos2d_ccColor3B;
}
extern "C" {
    #[doc = "! Gray Color (166,166,166)"]
    #[link_name = "\u{1}?ccGRAY@cocos2d@@3U_ccColor3B@1@B"]
    pub static cocos2d_ccGRAY: cocos2d_ccColor3B;
}
#[doc = " RGBA color composed of 4 bytes\n@since v0.8"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d__ccColor4B {
    pub r: GLubyte,
    pub g: GLubyte,
    pub b: GLubyte,
    pub a: GLubyte,
}
#[test]
fn bindgen_test_layout_cocos2d__ccColor4B() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d__ccColor4B> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d__ccColor4B>(),
        4usize,
        concat!("Size of: ", stringify!(cocos2d__ccColor4B))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d__ccColor4B>(),
        1usize,
        concat!("Alignment of ", stringify!(cocos2d__ccColor4B))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccColor4B),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).g) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccColor4B),
            "::",
            stringify!(g)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccColor4B),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccColor4B),
            "::",
            stringify!(a)
        )
    );
}
#[doc = " RGBA color composed of 4 bytes\n@since v0.8"]
pub type cocos2d_ccColor4B = cocos2d__ccColor4B;
#[doc = " RGBA color composed of 4 floats\n@since v0.8"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d__ccColor4F {
    pub r: GLfloat,
    pub g: GLfloat,
    pub b: GLfloat,
    pub a: GLfloat,
}
#[test]
fn bindgen_test_layout_cocos2d__ccColor4F() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d__ccColor4F> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d__ccColor4F>(),
        16usize,
        concat!("Size of: ", stringify!(cocos2d__ccColor4F))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d__ccColor4F>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d__ccColor4F))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccColor4F),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).g) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccColor4F),
            "::",
            stringify!(g)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccColor4F),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccColor4F),
            "::",
            stringify!(a)
        )
    );
}
#[doc = " RGBA color composed of 4 floats\n@since v0.8"]
pub type cocos2d_ccColor4F = cocos2d__ccColor4F;
#[doc = " A vertex composed of 2 floats: x, y\n@since v0.8"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d__ccVertex2F {
    pub x: GLfloat,
    pub y: GLfloat,
}
#[test]
fn bindgen_test_layout_cocos2d__ccVertex2F() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d__ccVertex2F> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d__ccVertex2F>(),
        8usize,
        concat!("Size of: ", stringify!(cocos2d__ccVertex2F))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d__ccVertex2F>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d__ccVertex2F))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccVertex2F),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccVertex2F),
            "::",
            stringify!(y)
        )
    );
}
#[doc = " A vertex composed of 2 floats: x, y\n@since v0.8"]
pub type cocos2d_ccVertex2F = cocos2d__ccVertex2F;
#[doc = " A vertex composed of 2 floats: x, y\n@since v0.8"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d__ccVertex3F {
    pub x: GLfloat,
    pub y: GLfloat,
    pub z: GLfloat,
}
#[test]
fn bindgen_test_layout_cocos2d__ccVertex3F() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d__ccVertex3F> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d__ccVertex3F>(),
        12usize,
        concat!("Size of: ", stringify!(cocos2d__ccVertex3F))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d__ccVertex3F>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d__ccVertex3F))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccVertex3F),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccVertex3F),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccVertex3F),
            "::",
            stringify!(z)
        )
    );
}
#[doc = " A vertex composed of 2 floats: x, y\n@since v0.8"]
pub type cocos2d_ccVertex3F = cocos2d__ccVertex3F;
#[doc = " A texcoord composed of 2 floats: u, y\n@since v0.8"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d__ccTex2F {
    pub u: GLfloat,
    pub v: GLfloat,
}
#[test]
fn bindgen_test_layout_cocos2d__ccTex2F() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d__ccTex2F> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d__ccTex2F>(),
        8usize,
        concat!("Size of: ", stringify!(cocos2d__ccTex2F))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d__ccTex2F>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d__ccTex2F))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccTex2F),
            "::",
            stringify!(u)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccTex2F),
            "::",
            stringify!(v)
        )
    );
}
#[doc = " A texcoord composed of 2 floats: u, y\n@since v0.8"]
pub type cocos2d_ccTex2F = cocos2d__ccTex2F;
#[doc = "! Point Sprite component"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d__ccPointSprite {
    pub pos: cocos2d_ccVertex2F,
    pub color: cocos2d_ccColor4B,
    pub size: GLfloat,
}
#[test]
fn bindgen_test_layout_cocos2d__ccPointSprite() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d__ccPointSprite> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d__ccPointSprite>(),
        16usize,
        concat!("Size of: ", stringify!(cocos2d__ccPointSprite))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d__ccPointSprite>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d__ccPointSprite))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccPointSprite),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).color) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccPointSprite),
            "::",
            stringify!(color)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccPointSprite),
            "::",
            stringify!(size)
        )
    );
}
#[doc = "! Point Sprite component"]
pub type cocos2d_ccPointSprite = cocos2d__ccPointSprite;
#[doc = "!    A 2D Quad. 4 * 2 floats"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d__ccQuad2 {
    pub tl: cocos2d_ccVertex2F,
    pub tr: cocos2d_ccVertex2F,
    pub bl: cocos2d_ccVertex2F,
    pub br: cocos2d_ccVertex2F,
}
#[test]
fn bindgen_test_layout_cocos2d__ccQuad2() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d__ccQuad2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d__ccQuad2>(),
        32usize,
        concat!("Size of: ", stringify!(cocos2d__ccQuad2))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d__ccQuad2>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d__ccQuad2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tl) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccQuad2),
            "::",
            stringify!(tl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccQuad2),
            "::",
            stringify!(tr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bl) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccQuad2),
            "::",
            stringify!(bl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).br) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccQuad2),
            "::",
            stringify!(br)
        )
    );
}
#[doc = "!    A 2D Quad. 4 * 2 floats"]
pub type cocos2d_ccQuad2 = cocos2d__ccQuad2;
#[doc = "!    A 3D Quad. 4 * 3 floats"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d__ccQuad3 {
    pub bl: cocos2d_ccVertex3F,
    pub br: cocos2d_ccVertex3F,
    pub tl: cocos2d_ccVertex3F,
    pub tr: cocos2d_ccVertex3F,
}
#[test]
fn bindgen_test_layout_cocos2d__ccQuad3() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d__ccQuad3> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d__ccQuad3>(),
        48usize,
        concat!("Size of: ", stringify!(cocos2d__ccQuad3))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d__ccQuad3>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d__ccQuad3))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bl) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccQuad3),
            "::",
            stringify!(bl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).br) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccQuad3),
            "::",
            stringify!(br)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tl) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccQuad3),
            "::",
            stringify!(tl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tr) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccQuad3),
            "::",
            stringify!(tr)
        )
    );
}
#[doc = "!    A 3D Quad. 4 * 3 floats"]
pub type cocos2d_ccQuad3 = cocos2d__ccQuad3;
#[doc = "! a Point with a vertex point, a tex coord point and a color 4B"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d__ccV2F_C4B_T2F {
    #[doc = "! vertices (2F)"]
    pub vertices: cocos2d_ccVertex2F,
    #[doc = "! colors (4B)"]
    pub colors: cocos2d_ccColor4B,
    #[doc = "! tex coords (2F)"]
    pub texCoords: cocos2d_ccTex2F,
}
#[test]
fn bindgen_test_layout_cocos2d__ccV2F_C4B_T2F() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d__ccV2F_C4B_T2F> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d__ccV2F_C4B_T2F>(),
        20usize,
        concat!("Size of: ", stringify!(cocos2d__ccV2F_C4B_T2F))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d__ccV2F_C4B_T2F>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d__ccV2F_C4B_T2F))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vertices) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccV2F_C4B_T2F),
            "::",
            stringify!(vertices)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).colors) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccV2F_C4B_T2F),
            "::",
            stringify!(colors)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).texCoords) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccV2F_C4B_T2F),
            "::",
            stringify!(texCoords)
        )
    );
}
#[doc = "! a Point with a vertex point, a tex coord point and a color 4B"]
pub type cocos2d_ccV2F_C4B_T2F = cocos2d__ccV2F_C4B_T2F;
#[doc = "! a Point with a vertex point, a tex coord point and a color 4F"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d__ccV2F_C4F_T2F {
    #[doc = "! vertices (2F)"]
    pub vertices: cocos2d_ccVertex2F,
    #[doc = "! colors (4F)"]
    pub colors: cocos2d_ccColor4F,
    #[doc = "! tex coords (2F)"]
    pub texCoords: cocos2d_ccTex2F,
}
#[test]
fn bindgen_test_layout_cocos2d__ccV2F_C4F_T2F() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d__ccV2F_C4F_T2F> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d__ccV2F_C4F_T2F>(),
        32usize,
        concat!("Size of: ", stringify!(cocos2d__ccV2F_C4F_T2F))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d__ccV2F_C4F_T2F>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d__ccV2F_C4F_T2F))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vertices) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccV2F_C4F_T2F),
            "::",
            stringify!(vertices)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).colors) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccV2F_C4F_T2F),
            "::",
            stringify!(colors)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).texCoords) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccV2F_C4F_T2F),
            "::",
            stringify!(texCoords)
        )
    );
}
#[doc = "! a Point with a vertex point, a tex coord point and a color 4F"]
pub type cocos2d_ccV2F_C4F_T2F = cocos2d__ccV2F_C4F_T2F;
#[doc = "! a Point with a vertex point, a tex coord point and a color 4B"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d__ccV3F_C4B_T2F {
    #[doc = "! vertices (3F)"]
    pub vertices: cocos2d_ccVertex3F,
    #[doc = "! colors (4B)"]
    pub colors: cocos2d_ccColor4B,
    pub texCoords: cocos2d_ccTex2F,
}
#[test]
fn bindgen_test_layout_cocos2d__ccV3F_C4B_T2F() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d__ccV3F_C4B_T2F> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d__ccV3F_C4B_T2F>(),
        24usize,
        concat!("Size of: ", stringify!(cocos2d__ccV3F_C4B_T2F))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d__ccV3F_C4B_T2F>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d__ccV3F_C4B_T2F))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vertices) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccV3F_C4B_T2F),
            "::",
            stringify!(vertices)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).colors) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccV3F_C4B_T2F),
            "::",
            stringify!(colors)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).texCoords) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccV3F_C4B_T2F),
            "::",
            stringify!(texCoords)
        )
    );
}
#[doc = "! a Point with a vertex point, a tex coord point and a color 4B"]
pub type cocos2d_ccV3F_C4B_T2F = cocos2d__ccV3F_C4B_T2F;
#[doc = "! A Triangle of ccV2F_C4B_T2F"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d__ccV2F_C4B_T2F_Triangle {
    #[doc = "! Point A"]
    pub a: cocos2d_ccV2F_C4B_T2F,
    #[doc = "! Point B"]
    pub b: cocos2d_ccV2F_C4B_T2F,
    #[doc = "! Point B"]
    pub c: cocos2d_ccV2F_C4B_T2F,
}
#[test]
fn bindgen_test_layout_cocos2d__ccV2F_C4B_T2F_Triangle() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d__ccV2F_C4B_T2F_Triangle> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d__ccV2F_C4B_T2F_Triangle>(),
        60usize,
        concat!("Size of: ", stringify!(cocos2d__ccV2F_C4B_T2F_Triangle))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d__ccV2F_C4B_T2F_Triangle>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d__ccV2F_C4B_T2F_Triangle))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccV2F_C4B_T2F_Triangle),
            "::",
            stringify!(a)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccV2F_C4B_T2F_Triangle),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).c) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccV2F_C4B_T2F_Triangle),
            "::",
            stringify!(c)
        )
    );
}
#[doc = "! A Triangle of ccV2F_C4B_T2F"]
pub type cocos2d_ccV2F_C4B_T2F_Triangle = cocos2d__ccV2F_C4B_T2F_Triangle;
#[doc = "! A Quad of ccV2F_C4B_T2F"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d__ccV2F_C4B_T2F_Quad {
    #[doc = "! bottom left"]
    pub bl: cocos2d_ccV2F_C4B_T2F,
    #[doc = "! bottom right"]
    pub br: cocos2d_ccV2F_C4B_T2F,
    #[doc = "! top left"]
    pub tl: cocos2d_ccV2F_C4B_T2F,
    #[doc = "! top right"]
    pub tr: cocos2d_ccV2F_C4B_T2F,
}
#[test]
fn bindgen_test_layout_cocos2d__ccV2F_C4B_T2F_Quad() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d__ccV2F_C4B_T2F_Quad> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d__ccV2F_C4B_T2F_Quad>(),
        80usize,
        concat!("Size of: ", stringify!(cocos2d__ccV2F_C4B_T2F_Quad))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d__ccV2F_C4B_T2F_Quad>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d__ccV2F_C4B_T2F_Quad))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bl) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccV2F_C4B_T2F_Quad),
            "::",
            stringify!(bl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).br) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccV2F_C4B_T2F_Quad),
            "::",
            stringify!(br)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tl) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccV2F_C4B_T2F_Quad),
            "::",
            stringify!(tl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tr) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccV2F_C4B_T2F_Quad),
            "::",
            stringify!(tr)
        )
    );
}
#[doc = "! A Quad of ccV2F_C4B_T2F"]
pub type cocos2d_ccV2F_C4B_T2F_Quad = cocos2d__ccV2F_C4B_T2F_Quad;
#[doc = "! 4 ccVertex3FTex2FColor4B"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d__ccV3F_C4B_T2F_Quad {
    #[doc = "! top left"]
    pub tl: cocos2d_ccV3F_C4B_T2F,
    #[doc = "! bottom left"]
    pub bl: cocos2d_ccV3F_C4B_T2F,
    #[doc = "! top right"]
    pub tr: cocos2d_ccV3F_C4B_T2F,
    #[doc = "! bottom right"]
    pub br: cocos2d_ccV3F_C4B_T2F,
}
#[test]
fn bindgen_test_layout_cocos2d__ccV3F_C4B_T2F_Quad() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d__ccV3F_C4B_T2F_Quad> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d__ccV3F_C4B_T2F_Quad>(),
        96usize,
        concat!("Size of: ", stringify!(cocos2d__ccV3F_C4B_T2F_Quad))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d__ccV3F_C4B_T2F_Quad>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d__ccV3F_C4B_T2F_Quad))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tl) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccV3F_C4B_T2F_Quad),
            "::",
            stringify!(tl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bl) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccV3F_C4B_T2F_Quad),
            "::",
            stringify!(bl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tr) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccV3F_C4B_T2F_Quad),
            "::",
            stringify!(tr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).br) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccV3F_C4B_T2F_Quad),
            "::",
            stringify!(br)
        )
    );
}
#[doc = "! 4 ccVertex3FTex2FColor4B"]
pub type cocos2d_ccV3F_C4B_T2F_Quad = cocos2d__ccV3F_C4B_T2F_Quad;
#[doc = "! 4 ccVertex2FTex2FColor4F Quad"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d__ccV2F_C4F_T2F_Quad {
    #[doc = "! bottom left"]
    pub bl: cocos2d_ccV2F_C4F_T2F,
    #[doc = "! bottom right"]
    pub br: cocos2d_ccV2F_C4F_T2F,
    #[doc = "! top left"]
    pub tl: cocos2d_ccV2F_C4F_T2F,
    #[doc = "! top right"]
    pub tr: cocos2d_ccV2F_C4F_T2F,
}
#[test]
fn bindgen_test_layout_cocos2d__ccV2F_C4F_T2F_Quad() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d__ccV2F_C4F_T2F_Quad> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d__ccV2F_C4F_T2F_Quad>(),
        128usize,
        concat!("Size of: ", stringify!(cocos2d__ccV2F_C4F_T2F_Quad))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d__ccV2F_C4F_T2F_Quad>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d__ccV2F_C4F_T2F_Quad))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bl) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccV2F_C4F_T2F_Quad),
            "::",
            stringify!(bl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).br) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccV2F_C4F_T2F_Quad),
            "::",
            stringify!(br)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tl) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccV2F_C4F_T2F_Quad),
            "::",
            stringify!(tl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tr) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccV2F_C4F_T2F_Quad),
            "::",
            stringify!(tr)
        )
    );
}
#[doc = "! 4 ccVertex2FTex2FColor4F Quad"]
pub type cocos2d_ccV2F_C4F_T2F_Quad = cocos2d__ccV2F_C4F_T2F_Quad;
#[doc = "! Blend Function used for textures"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d__ccBlendFunc {
    #[doc = "! source blend function"]
    pub src: GLenum,
    #[doc = "! destination blend function"]
    pub dst: GLenum,
}
#[test]
fn bindgen_test_layout_cocos2d__ccBlendFunc() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d__ccBlendFunc> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d__ccBlendFunc>(),
        8usize,
        concat!("Size of: ", stringify!(cocos2d__ccBlendFunc))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d__ccBlendFunc>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d__ccBlendFunc))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).src) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccBlendFunc),
            "::",
            stringify!(src)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dst) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccBlendFunc),
            "::",
            stringify!(dst)
        )
    );
}
#[doc = "! Blend Function used for textures"]
pub type cocos2d_ccBlendFunc = cocos2d__ccBlendFunc;
extern "C" {
    #[link_name = "\u{1}?kCCBlendFuncDisable@cocos2d@@3U_ccBlendFunc@1@B"]
    pub static cocos2d_kCCBlendFuncDisable: cocos2d_ccBlendFunc;
}
pub const cocos2d_CCVerticalTextAlignment_kCCVerticalTextAlignmentTop:
    cocos2d_CCVerticalTextAlignment = 0;
pub const cocos2d_CCVerticalTextAlignment_kCCVerticalTextAlignmentCenter:
    cocos2d_CCVerticalTextAlignment = 1;
pub const cocos2d_CCVerticalTextAlignment_kCCVerticalTextAlignmentBottom:
    cocos2d_CCVerticalTextAlignment = 2;
#[doc = "! Vertical text alignment type"]
pub type cocos2d_CCVerticalTextAlignment = ::std::os::raw::c_int;
pub const cocos2d_CCTextAlignment_kCCTextAlignmentLeft: cocos2d_CCTextAlignment = 0;
pub const cocos2d_CCTextAlignment_kCCTextAlignmentCenter: cocos2d_CCTextAlignment = 1;
pub const cocos2d_CCTextAlignment_kCCTextAlignmentRight: cocos2d_CCTextAlignment = 2;
#[doc = "! Horizontal text alignment type"]
pub type cocos2d_CCTextAlignment = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d__ccT2F_Quad {
    #[doc = "! bottom left"]
    pub bl: cocos2d_ccTex2F,
    #[doc = "! bottom right"]
    pub br: cocos2d_ccTex2F,
    #[doc = "! top left"]
    pub tl: cocos2d_ccTex2F,
    #[doc = "! top right"]
    pub tr: cocos2d_ccTex2F,
}
#[test]
fn bindgen_test_layout_cocos2d__ccT2F_Quad() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d__ccT2F_Quad> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d__ccT2F_Quad>(),
        32usize,
        concat!("Size of: ", stringify!(cocos2d__ccT2F_Quad))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d__ccT2F_Quad>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d__ccT2F_Quad))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bl) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccT2F_Quad),
            "::",
            stringify!(bl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).br) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccT2F_Quad),
            "::",
            stringify!(br)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tl) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccT2F_Quad),
            "::",
            stringify!(tl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccT2F_Quad),
            "::",
            stringify!(tr)
        )
    );
}
pub type cocos2d_ccT2F_Quad = cocos2d__ccT2F_Quad;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d_ccAnimationFrameData {
    pub texCoords: cocos2d_ccT2F_Quad,
    pub delay: f32,
    pub size: cocos2d_CCSize,
}
#[test]
fn bindgen_test_layout_cocos2d_ccAnimationFrameData() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d_ccAnimationFrameData> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d_ccAnimationFrameData>(),
        44usize,
        concat!("Size of: ", stringify!(cocos2d_ccAnimationFrameData))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_ccAnimationFrameData>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_ccAnimationFrameData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).texCoords) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_ccAnimationFrameData),
            "::",
            stringify!(texCoords)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).delay) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_ccAnimationFrameData),
            "::",
            stringify!(delay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_ccAnimationFrameData),
            "::",
            stringify!(size)
        )
    );
}
#[doc = "types used for defining fonts properties (i.e. font name, size, stroke or shadow)"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d__ccFontShadow {
    pub m_shadowEnabled: bool,
    pub m_shadowOffset: cocos2d_CCSize,
    pub m_shadowBlur: f32,
    pub m_shadowOpacity: f32,
}
#[test]
fn bindgen_test_layout_cocos2d__ccFontShadow() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d__ccFontShadow> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d__ccFontShadow>(),
        20usize,
        concat!("Size of: ", stringify!(cocos2d__ccFontShadow))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d__ccFontShadow>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d__ccFontShadow))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_shadowEnabled) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccFontShadow),
            "::",
            stringify!(m_shadowEnabled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_shadowOffset) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccFontShadow),
            "::",
            stringify!(m_shadowOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_shadowBlur) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccFontShadow),
            "::",
            stringify!(m_shadowBlur)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_shadowOpacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccFontShadow),
            "::",
            stringify!(m_shadowOpacity)
        )
    );
}
#[doc = "types used for defining fonts properties (i.e. font name, size, stroke or shadow)"]
pub type cocos2d_ccFontShadow = cocos2d__ccFontShadow;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d__ccFontStroke {
    pub m_strokeEnabled: bool,
    pub m_strokeColor: cocos2d_ccColor3B,
    pub m_strokeSize: f32,
}
#[test]
fn bindgen_test_layout_cocos2d__ccFontStroke() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d__ccFontStroke> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d__ccFontStroke>(),
        8usize,
        concat!("Size of: ", stringify!(cocos2d__ccFontStroke))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d__ccFontStroke>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d__ccFontStroke))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_strokeEnabled) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccFontStroke),
            "::",
            stringify!(m_strokeEnabled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_strokeColor) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccFontStroke),
            "::",
            stringify!(m_strokeColor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_strokeSize) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccFontStroke),
            "::",
            stringify!(m_strokeSize)
        )
    );
}
pub type cocos2d_ccFontStroke = cocos2d__ccFontStroke;
#[doc = "  @js NA\n  @lua NA"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d__ccFontDefinition {
    pub m_fontName: std_string,
    pub m_fontSize: ::std::os::raw::c_int,
    pub m_alignment: cocos2d_CCTextAlignment,
    pub m_vertAlignment: cocos2d_CCVerticalTextAlignment,
    pub m_dimensions: cocos2d_CCSize,
    pub m_fontFillColor: cocos2d_ccColor3B,
    pub m_shadow: cocos2d_ccFontShadow,
    pub m_stroke: cocos2d_ccFontStroke,
}
#[test]
fn bindgen_test_layout_cocos2d__ccFontDefinition() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d__ccFontDefinition> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d__ccFontDefinition>(),
        76usize,
        concat!("Size of: ", stringify!(cocos2d__ccFontDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d__ccFontDefinition>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d__ccFontDefinition))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_fontName) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccFontDefinition),
            "::",
            stringify!(m_fontName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_fontSize) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccFontDefinition),
            "::",
            stringify!(m_fontSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_alignment) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccFontDefinition),
            "::",
            stringify!(m_alignment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_vertAlignment) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccFontDefinition),
            "::",
            stringify!(m_vertAlignment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_dimensions) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccFontDefinition),
            "::",
            stringify!(m_dimensions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_fontFillColor) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccFontDefinition),
            "::",
            stringify!(m_fontFillColor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_shadow) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccFontDefinition),
            "::",
            stringify!(m_shadow)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_stroke) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccFontDefinition),
            "::",
            stringify!(m_stroke)
        )
    );
}
#[doc = "  @js NA\n  @lua NA"]
pub type cocos2d_ccFontDefinition = cocos2d__ccFontDefinition;
#[doc = "! 32-bit texture: RGBA8888"]
pub const cocos2d_CCTexture2DPixelFormat_kCCTexture2DPixelFormat_RGBA8888:
    cocos2d_CCTexture2DPixelFormat = 0;
#[doc = "! 24-bit texture: RGBA888"]
pub const cocos2d_CCTexture2DPixelFormat_kCCTexture2DPixelFormat_RGB888:
    cocos2d_CCTexture2DPixelFormat = 1;
#[doc = "! 16-bit texture without Alpha channel"]
pub const cocos2d_CCTexture2DPixelFormat_kCCTexture2DPixelFormat_RGB565:
    cocos2d_CCTexture2DPixelFormat = 2;
#[doc = "! 8-bit textures used as masks"]
pub const cocos2d_CCTexture2DPixelFormat_kCCTexture2DPixelFormat_A8:
    cocos2d_CCTexture2DPixelFormat = 3;
#[doc = "! 8-bit intensity texture"]
pub const cocos2d_CCTexture2DPixelFormat_kCCTexture2DPixelFormat_I8:
    cocos2d_CCTexture2DPixelFormat = 4;
#[doc = "! 16-bit textures used as masks"]
pub const cocos2d_CCTexture2DPixelFormat_kCCTexture2DPixelFormat_AI88:
    cocos2d_CCTexture2DPixelFormat = 5;
#[doc = "! 16-bit textures: RGBA4444"]
pub const cocos2d_CCTexture2DPixelFormat_kCCTexture2DPixelFormat_RGBA4444:
    cocos2d_CCTexture2DPixelFormat = 6;
#[doc = "! 16-bit textures: RGB5A1"]
pub const cocos2d_CCTexture2DPixelFormat_kCCTexture2DPixelFormat_RGB5A1:
    cocos2d_CCTexture2DPixelFormat = 7;
#[doc = "! 4-bit PVRTC-compressed texture: PVRTC4"]
pub const cocos2d_CCTexture2DPixelFormat_kCCTexture2DPixelFormat_PVRTC4:
    cocos2d_CCTexture2DPixelFormat = 8;
#[doc = "! 2-bit PVRTC-compressed texture: PVRTC2"]
pub const cocos2d_CCTexture2DPixelFormat_kCCTexture2DPixelFormat_PVRTC2:
    cocos2d_CCTexture2DPixelFormat = 9;
#[doc = "! Default texture format: RGBA8888"]
pub const cocos2d_CCTexture2DPixelFormat_kCCTexture2DPixelFormat_Default:
    cocos2d_CCTexture2DPixelFormat = 0;
#[doc = "! Default texture format: RGBA8888"]
pub const cocos2d_CCTexture2DPixelFormat_kTexture2DPixelFormat_RGBA8888:
    cocos2d_CCTexture2DPixelFormat = 0;
#[doc = "! Default texture format: RGBA8888"]
pub const cocos2d_CCTexture2DPixelFormat_kTexture2DPixelFormat_RGB888:
    cocos2d_CCTexture2DPixelFormat = 1;
#[doc = "! Default texture format: RGBA8888"]
pub const cocos2d_CCTexture2DPixelFormat_kTexture2DPixelFormat_RGB565:
    cocos2d_CCTexture2DPixelFormat = 2;
#[doc = "! Default texture format: RGBA8888"]
pub const cocos2d_CCTexture2DPixelFormat_kTexture2DPixelFormat_A8: cocos2d_CCTexture2DPixelFormat =
    3;
#[doc = "! Default texture format: RGBA8888"]
pub const cocos2d_CCTexture2DPixelFormat_kTexture2DPixelFormat_RGBA4444:
    cocos2d_CCTexture2DPixelFormat = 6;
#[doc = "! Default texture format: RGBA8888"]
pub const cocos2d_CCTexture2DPixelFormat_kTexture2DPixelFormat_RGB5A1:
    cocos2d_CCTexture2DPixelFormat = 7;
#[doc = "! Default texture format: RGBA8888"]
pub const cocos2d_CCTexture2DPixelFormat_kTexture2DPixelFormat_Default:
    cocos2d_CCTexture2DPixelFormat = 0;
#[doc = " @typedef CCTexture2DPixelFormat\nPossible texture pixel formats"]
pub type cocos2d_CCTexture2DPixelFormat = ::std::os::raw::c_int;
#[doc = "Extension to set the Min / Mag filter"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d__ccTexParams {
    pub minFilter: GLuint,
    pub magFilter: GLuint,
    pub wrapS: GLuint,
    pub wrapT: GLuint,
}
#[test]
fn bindgen_test_layout_cocos2d__ccTexParams() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d__ccTexParams> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d__ccTexParams>(),
        16usize,
        concat!("Size of: ", stringify!(cocos2d__ccTexParams))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d__ccTexParams>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d__ccTexParams))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minFilter) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccTexParams),
            "::",
            stringify!(minFilter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).magFilter) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccTexParams),
            "::",
            stringify!(magFilter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wrapS) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccTexParams),
            "::",
            stringify!(wrapS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wrapT) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d__ccTexParams),
            "::",
            stringify!(wrapT)
        )
    );
}
#[doc = "Extension to set the Min / Mag filter"]
pub type cocos2d_ccTexParams = cocos2d__ccTexParams;
#[doc = " @brief CCTexture2D class.\n This class allows to easily create OpenGL 2D textures from images, text or raw data.\n The created CCTexture2D object will always have power-of-two dimensions.\n Depending on how you create the CCTexture2D object, the actual image area of the texture might be smaller than the texture dimensions i.e. \"contentSize\" != (pixelsWide, pixelsHigh) and (maxS, maxT) != (1.0, 1.0).\n Be aware that the content of the generated textures will be upside-down!"]
#[repr(C)]
#[derive(Debug)]
pub struct cocos2d_CCTexture2D {
    pub _base: cocos2d_CCObject,
    pub m_bPVRHaveAlphaPremultiplied: bool,
    #[doc = " pixel format of the texture"]
    pub m_ePixelFormat: cocos2d_CCTexture2DPixelFormat,
    #[doc = " width in pixels"]
    pub m_uPixelsWide: ::std::os::raw::c_uint,
    #[doc = " height in pixels"]
    pub m_uPixelsHigh: ::std::os::raw::c_uint,
    #[doc = " texture name"]
    pub m_uName: GLuint,
    #[doc = " texture max S"]
    pub m_fMaxS: GLfloat,
    #[doc = " texture max T"]
    pub m_fMaxT: GLfloat,
    #[doc = " content size"]
    pub m_tContentSize: cocos2d_CCSize,
    #[doc = " whether or not the texture has their Alpha premultiplied"]
    pub m_bHasPremultipliedAlpha: bool,
    pub m_bHasMipmaps: bool,
    #[doc = " shader program used by drawAtPoint and drawInRect"]
    pub m_pShaderProgram: *mut cocos2d_CCGLProgram,
}
#[test]
fn bindgen_test_layout_cocos2d_CCTexture2D() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d_CCTexture2D> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCTexture2D>(),
        96usize,
        concat!("Size of: ", stringify!(cocos2d_CCTexture2D))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCTexture2D>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCTexture2D))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).m_bPVRHaveAlphaPremultiplied) as usize - ptr as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCTexture2D),
            "::",
            stringify!(m_bPVRHaveAlphaPremultiplied)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_ePixelFormat) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCTexture2D),
            "::",
            stringify!(m_ePixelFormat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_uPixelsWide) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCTexture2D),
            "::",
            stringify!(m_uPixelsWide)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_uPixelsHigh) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCTexture2D),
            "::",
            stringify!(m_uPixelsHigh)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_uName) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCTexture2D),
            "::",
            stringify!(m_uName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_fMaxS) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCTexture2D),
            "::",
            stringify!(m_fMaxS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_fMaxT) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCTexture2D),
            "::",
            stringify!(m_fMaxT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_tContentSize) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCTexture2D),
            "::",
            stringify!(m_tContentSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_bHasPremultipliedAlpha) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCTexture2D),
            "::",
            stringify!(m_bHasPremultipliedAlpha)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_bHasMipmaps) as usize - ptr as usize },
        89usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCTexture2D),
            "::",
            stringify!(m_bHasMipmaps)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_pShaderProgram) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCTexture2D),
            "::",
            stringify!(m_pShaderProgram)
        )
    );
}
extern "thiscall" {
    #[doc = "  @js NA\n  @lua NA"]
    #[link_name = "\u{1}?description@CCTexture2D@cocos2d@@QAEPBDXZ"]
    pub fn cocos2d_CCTexture2D_description(
        this: *mut cocos2d_CCTexture2D,
    ) -> *const ::std::os::raw::c_char;
}
extern "thiscall" {
    #[doc = " These functions are needed to create mutable textures\n @js NA"]
    #[link_name = "\u{1}?releaseData@CCTexture2D@cocos2d@@QAEXPAX@Z"]
    pub fn cocos2d_CCTexture2D_releaseData(
        this: *mut cocos2d_CCTexture2D,
        data: *mut ::std::os::raw::c_void,
    );
}
extern "thiscall" {
    #[doc = " @js NA"]
    #[link_name = "\u{1}?keepData@CCTexture2D@cocos2d@@QAEPAXPAXI@Z"]
    pub fn cocos2d_CCTexture2D_keepData(
        this: *mut cocos2d_CCTexture2D,
        data: *mut ::std::os::raw::c_void,
        length: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
extern "thiscall" {
    #[doc = " Initializes with a texture2d with data\n @js NA\n @lua NA"]
    #[link_name = "\u{1}?initWithData@CCTexture2D@cocos2d@@QAE_NPBXW4CCTexture2DPixelFormat@2@IIABVCCSize@2@@Z"]
    pub fn cocos2d_CCTexture2D_initWithData(
        this: *mut cocos2d_CCTexture2D,
        data: *const ::std::os::raw::c_void,
        pixelFormat: cocos2d_CCTexture2DPixelFormat,
        pixelsWide: ::std::os::raw::c_uint,
        pixelsHigh: ::std::os::raw::c_uint,
        contentSize: *const cocos2d_CCSize,
    ) -> bool;
}
extern "thiscall" {
    #[doc = "Drawing extensions to make it easy to draw basic quads using a CCTexture2D object.\nThese functions require GL_TEXTURE_2D and both GL_VERTEX_ARRAY and GL_TEXTURE_COORD_ARRAY client states to be enabled.\n/\n/** draws a texture at a given point"]
    #[link_name = "\u{1}?drawAtPoint@CCTexture2D@cocos2d@@QAEXABVCCPoint@2@@Z"]
    pub fn cocos2d_CCTexture2D_drawAtPoint(
        this: *mut cocos2d_CCTexture2D,
        point: *const cocos2d_CCPoint,
    );
}
extern "thiscall" {
    #[doc = " draws a texture inside a rect"]
    #[link_name = "\u{1}?drawInRect@CCTexture2D@cocos2d@@QAEXABVCCRect@2@@Z"]
    pub fn cocos2d_CCTexture2D_drawInRect(
        this: *mut cocos2d_CCTexture2D,
        rect: *const cocos2d_CCRect,
    );
}
extern "thiscall" {
    #[doc = "Extensions to make it easy to create a CCTexture2D object from an image file.\nNote that RGBA type textures will have their alpha premultiplied - use the blending mode (GL_ONE, GL_ONE_MINUS_SRC_ALPHA).\n/\n/** Initializes a texture from a UIImage object"]
    #[link_name = "\u{1}?initWithImage@CCTexture2D@cocos2d@@QAE_NPAVCCImage@2@@Z"]
    pub fn cocos2d_CCTexture2D_initWithImage(
        this: *mut cocos2d_CCTexture2D,
        uiImage: *mut cocos2d_CCImage,
    ) -> bool;
}
extern "thiscall" {
    #[doc = " Initializes a texture from a string with dimensions, alignment, font name and font size"]
    #[link_name = "\u{1}?initWithString@CCTexture2D@cocos2d@@QAE_NPBD0MABVCCSize@2@W4CCTextAlignment@2@W4CCVerticalTextAlignment@2@@Z"]
    pub fn cocos2d_CCTexture2D_initWithString(
        this: *mut cocos2d_CCTexture2D,
        text: *const ::std::os::raw::c_char,
        fontName: *const ::std::os::raw::c_char,
        fontSize: f32,
        dimensions: *const cocos2d_CCSize,
        hAlignment: cocos2d_CCTextAlignment,
        vAlignment: cocos2d_CCVerticalTextAlignment,
    ) -> bool;
}
extern "thiscall" {
    #[doc = " Initializes a texture from a string with font name and font size"]
    #[link_name = "\u{1}?initWithString@CCTexture2D@cocos2d@@QAE_NPBD0M@Z"]
    pub fn cocos2d_CCTexture2D_initWithString1(
        this: *mut cocos2d_CCTexture2D,
        text: *const ::std::os::raw::c_char,
        fontName: *const ::std::os::raw::c_char,
        fontSize: f32,
    ) -> bool;
}
extern "thiscall" {
    #[doc = " Initializes a texture from a string using a text definition"]
    #[link_name = "\u{1}?initWithString@CCTexture2D@cocos2d@@QAE_NPBDPAU_ccFontDefinition@2@@Z"]
    pub fn cocos2d_CCTexture2D_initWithString2(
        this: *mut cocos2d_CCTexture2D,
        text: *const ::std::os::raw::c_char,
        textDefinition: *mut cocos2d_ccFontDefinition,
    ) -> bool;
}
extern "thiscall" {
    #[doc = " Initializes a texture from a PVR file"]
    #[link_name = "\u{1}?initWithPVRFile@CCTexture2D@cocos2d@@QAE_NPBD@Z"]
    pub fn cocos2d_CCTexture2D_initWithPVRFile(
        this: *mut cocos2d_CCTexture2D,
        file: *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "thiscall" {
    #[doc = " Initializes a texture from a ETC file"]
    #[link_name = "\u{1}?initWithETCFile@CCTexture2D@cocos2d@@QAE_NPBD@Z"]
    pub fn cocos2d_CCTexture2D_initWithETCFile(
        this: *mut cocos2d_CCTexture2D,
        file: *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "thiscall" {
    #[doc = " sets the min filter, mag filter, wrap s and wrap t texture parameters.\nIf the texture size is NPOT (non power of 2), then in can only use GL_CLAMP_TO_EDGE in GL_TEXTURE_WRAP_{S,T}.\n\n@warning Calling this method could allocate additional texture memory.\n\n@since v0.8\n@code\nwhen this functon bound to js,the input param are changed\njs: var setTexParameters(var minFilter, var magFilter, var wrapS, var wrapT)\n@endcode"]
    #[link_name = "\u{1}?setTexParameters@CCTexture2D@cocos2d@@QAEXPAU_ccTexParams@2@@Z"]
    pub fn cocos2d_CCTexture2D_setTexParameters(
        this: *mut cocos2d_CCTexture2D,
        texParams: *mut cocos2d_ccTexParams,
    );
}
extern "thiscall" {
    #[doc = " sets antialias texture parameters:\n- GL_TEXTURE_MIN_FILTER = GL_LINEAR\n- GL_TEXTURE_MAG_FILTER = GL_LINEAR\n\n@warning Calling this method could allocate additional texture memory.\n\n@since v0.8"]
    #[link_name = "\u{1}?setAntiAliasTexParameters@CCTexture2D@cocos2d@@QAEXXZ"]
    pub fn cocos2d_CCTexture2D_setAntiAliasTexParameters(this: *mut cocos2d_CCTexture2D);
}
extern "thiscall" {
    #[doc = " sets alias texture parameters:\n- GL_TEXTURE_MIN_FILTER = GL_NEAREST\n- GL_TEXTURE_MAG_FILTER = GL_NEAREST\n\n@warning Calling this method could allocate additional texture memory.\n\n@since v0.8"]
    #[link_name = "\u{1}?setAliasTexParameters@CCTexture2D@cocos2d@@QAEXXZ"]
    pub fn cocos2d_CCTexture2D_setAliasTexParameters(this: *mut cocos2d_CCTexture2D);
}
extern "thiscall" {
    #[doc = " Generates mipmap images for the texture.\nIt only works if the texture size is POT (power of 2).\n@since v0.99.0"]
    #[link_name = "\u{1}?generateMipmap@CCTexture2D@cocos2d@@QAEXXZ"]
    pub fn cocos2d_CCTexture2D_generateMipmap(this: *mut cocos2d_CCTexture2D);
}
extern "thiscall" {
    #[doc = " returns the pixel format.\n@since v2.0"]
    #[link_name = "\u{1}?stringForFormat@CCTexture2D@cocos2d@@QAEPBDXZ"]
    pub fn cocos2d_CCTexture2D_stringForFormat(
        this: *mut cocos2d_CCTexture2D,
    ) -> *const ::std::os::raw::c_char;
}
extern "thiscall" {
    #[doc = " returns the bits-per-pixel of the in-memory OpenGL texture\n@since v1.0"]
    #[link_name = "\u{1}?bitsPerPixelForFormat@CCTexture2D@cocos2d@@QAEIXZ"]
    pub fn cocos2d_CCTexture2D_bitsPerPixelForFormat(
        this: *mut cocos2d_CCTexture2D,
    ) -> ::std::os::raw::c_uint;
}
extern "thiscall" {
    #[doc = " Helper functions that returns bits per pixels for a given format.\n@since v2.0"]
    #[link_name = "\u{1}?bitsPerPixelForFormat@CCTexture2D@cocos2d@@QAEIW4CCTexture2DPixelFormat@2@@Z"]
    pub fn cocos2d_CCTexture2D_bitsPerPixelForFormat1(
        this: *mut cocos2d_CCTexture2D,
        format: cocos2d_CCTexture2DPixelFormat,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " sets the default pixel format for UIImagescontains alpha channel.\nIf the UIImage contains alpha channel, then the options are:\n- generate 32-bit textures: kCCTexture2DPixelFormat_RGBA8888 (default one)\n- generate 24-bit textures: kCCTexture2DPixelFormat_RGB888\n- generate 16-bit textures: kCCTexture2DPixelFormat_RGBA4444\n- generate 16-bit textures: kCCTexture2DPixelFormat_RGB5A1\n- generate 16-bit textures: kCCTexture2DPixelFormat_RGB565\n- generate 8-bit textures: kCCTexture2DPixelFormat_A8 (only use it if you use just 1 color)\n\nHow does it work ?\n- If the image is an RGBA (with Alpha) then the default pixel format will be used (it can be a 8-bit, 16-bit or 32-bit texture)\n- If the image is an RGB (without Alpha) then: If the default pixel format is RGBA8888 then a RGBA8888 (32-bit) will be used. Otherwise a RGB565 (16-bit texture) will be used.\n\nThis parameter is not valid for PVR / PVR.CCZ images.\n\n@since v0.8"]
    #[link_name = "\u{1}?setDefaultAlphaPixelFormat@CCTexture2D@cocos2d@@SAXW4CCTexture2DPixelFormat@2@@Z"]
    pub fn cocos2d_CCTexture2D_setDefaultAlphaPixelFormat(format: cocos2d_CCTexture2DPixelFormat);
}
extern "C" {
    #[doc = " returns the alpha pixel format\n@since v0.8\n@js getDefaultAlphaPixelFormat"]
    #[link_name = "\u{1}?defaultAlphaPixelFormat@CCTexture2D@cocos2d@@SA?AW4CCTexture2DPixelFormat@2@XZ"]
    pub fn cocos2d_CCTexture2D_defaultAlphaPixelFormat() -> cocos2d_CCTexture2DPixelFormat;
}
extern "C" {
    #[doc = " treats (or not) PVR files as if they have alpha premultiplied.\nSince it is impossible to know at runtime if the PVR images have the alpha channel premultiplied, it is\npossible load them as if they have (or not) the alpha channel premultiplied.\n\nBy default it is disabled.\n\n@since v0.99.5"]
    #[link_name = "\u{1}?PVRImagesHavePremultipliedAlpha@CCTexture2D@cocos2d@@SAX_N@Z"]
    pub fn cocos2d_CCTexture2D_PVRImagesHavePremultipliedAlpha(haveAlphaPremultiplied: bool);
}
extern "thiscall" {
    #[doc = " content size"]
    #[link_name = "\u{1}?getContentSizeInPixels@CCTexture2D@cocos2d@@QAEABVCCSize@2@XZ"]
    pub fn cocos2d_CCTexture2D_getContentSizeInPixels(
        this: *mut cocos2d_CCTexture2D,
    ) -> *const cocos2d_CCSize;
}
extern "thiscall" {
    #[link_name = "\u{1}?hasPremultipliedAlpha@CCTexture2D@cocos2d@@QAE_NXZ"]
    pub fn cocos2d_CCTexture2D_hasPremultipliedAlpha(this: *mut cocos2d_CCTexture2D) -> bool;
}
extern "thiscall" {
    #[link_name = "\u{1}?hasMipmaps@CCTexture2D@cocos2d@@QAE_NXZ"]
    pub fn cocos2d_CCTexture2D_hasMipmaps(this: *mut cocos2d_CCTexture2D) -> bool;
}
extern "thiscall" {
    #[doc = " @js ctor"]
    #[link_name = "\u{1}??0CCTexture2D@cocos2d@@QAE@XZ"]
    pub fn cocos2d_CCTexture2D_CCTexture2D(this: *mut cocos2d_CCTexture2D);
}
impl cocos2d_CCTexture2D {
    #[inline]
    pub unsafe fn description(&mut self) -> *const ::std::os::raw::c_char {
        cocos2d_CCTexture2D_description(self)
    }
    #[inline]
    pub unsafe fn releaseData(&mut self, data: *mut ::std::os::raw::c_void) {
        cocos2d_CCTexture2D_releaseData(self, data)
    }
    #[inline]
    pub unsafe fn keepData(
        &mut self,
        data: *mut ::std::os::raw::c_void,
        length: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void {
        cocos2d_CCTexture2D_keepData(self, data, length)
    }
    #[inline]
    pub unsafe fn initWithData(
        &mut self,
        data: *const ::std::os::raw::c_void,
        pixelFormat: cocos2d_CCTexture2DPixelFormat,
        pixelsWide: ::std::os::raw::c_uint,
        pixelsHigh: ::std::os::raw::c_uint,
        contentSize: *const cocos2d_CCSize,
    ) -> bool {
        cocos2d_CCTexture2D_initWithData(
            self,
            data,
            pixelFormat,
            pixelsWide,
            pixelsHigh,
            contentSize,
        )
    }
    #[inline]
    pub unsafe fn drawAtPoint(&mut self, point: *const cocos2d_CCPoint) {
        cocos2d_CCTexture2D_drawAtPoint(self, point)
    }
    #[inline]
    pub unsafe fn drawInRect(&mut self, rect: *const cocos2d_CCRect) {
        cocos2d_CCTexture2D_drawInRect(self, rect)
    }
    #[inline]
    pub unsafe fn initWithImage(&mut self, uiImage: *mut cocos2d_CCImage) -> bool {
        cocos2d_CCTexture2D_initWithImage(self, uiImage)
    }
    #[inline]
    pub unsafe fn initWithString(
        &mut self,
        text: *const ::std::os::raw::c_char,
        fontName: *const ::std::os::raw::c_char,
        fontSize: f32,
        dimensions: *const cocos2d_CCSize,
        hAlignment: cocos2d_CCTextAlignment,
        vAlignment: cocos2d_CCVerticalTextAlignment,
    ) -> bool {
        cocos2d_CCTexture2D_initWithString(
            self, text, fontName, fontSize, dimensions, hAlignment, vAlignment,
        )
    }
    #[inline]
    pub unsafe fn initWithString1(
        &mut self,
        text: *const ::std::os::raw::c_char,
        fontName: *const ::std::os::raw::c_char,
        fontSize: f32,
    ) -> bool {
        cocos2d_CCTexture2D_initWithString1(self, text, fontName, fontSize)
    }
    #[inline]
    pub unsafe fn initWithString2(
        &mut self,
        text: *const ::std::os::raw::c_char,
        textDefinition: *mut cocos2d_ccFontDefinition,
    ) -> bool {
        cocos2d_CCTexture2D_initWithString2(self, text, textDefinition)
    }
    #[inline]
    pub unsafe fn initWithPVRFile(&mut self, file: *const ::std::os::raw::c_char) -> bool {
        cocos2d_CCTexture2D_initWithPVRFile(self, file)
    }
    #[inline]
    pub unsafe fn initWithETCFile(&mut self, file: *const ::std::os::raw::c_char) -> bool {
        cocos2d_CCTexture2D_initWithETCFile(self, file)
    }
    #[inline]
    pub unsafe fn setTexParameters(&mut self, texParams: *mut cocos2d_ccTexParams) {
        cocos2d_CCTexture2D_setTexParameters(self, texParams)
    }
    #[inline]
    pub unsafe fn setAntiAliasTexParameters(&mut self) {
        cocos2d_CCTexture2D_setAntiAliasTexParameters(self)
    }
    #[inline]
    pub unsafe fn setAliasTexParameters(&mut self) {
        cocos2d_CCTexture2D_setAliasTexParameters(self)
    }
    #[inline]
    pub unsafe fn generateMipmap(&mut self) {
        cocos2d_CCTexture2D_generateMipmap(self)
    }
    #[inline]
    pub unsafe fn stringForFormat(&mut self) -> *const ::std::os::raw::c_char {
        cocos2d_CCTexture2D_stringForFormat(self)
    }
    #[inline]
    pub unsafe fn bitsPerPixelForFormat(&mut self) -> ::std::os::raw::c_uint {
        cocos2d_CCTexture2D_bitsPerPixelForFormat(self)
    }
    #[inline]
    pub unsafe fn bitsPerPixelForFormat1(
        &mut self,
        format: cocos2d_CCTexture2DPixelFormat,
    ) -> ::std::os::raw::c_uint {
        cocos2d_CCTexture2D_bitsPerPixelForFormat1(self, format)
    }
    #[inline]
    pub unsafe fn setDefaultAlphaPixelFormat(format: cocos2d_CCTexture2DPixelFormat) {
        cocos2d_CCTexture2D_setDefaultAlphaPixelFormat(format)
    }
    #[inline]
    pub unsafe fn defaultAlphaPixelFormat() -> cocos2d_CCTexture2DPixelFormat {
        cocos2d_CCTexture2D_defaultAlphaPixelFormat()
    }
    #[inline]
    pub unsafe fn PVRImagesHavePremultipliedAlpha(haveAlphaPremultiplied: bool) {
        cocos2d_CCTexture2D_PVRImagesHavePremultipliedAlpha(haveAlphaPremultiplied)
    }
    #[inline]
    pub unsafe fn getContentSizeInPixels(&mut self) -> *const cocos2d_CCSize {
        cocos2d_CCTexture2D_getContentSizeInPixels(self)
    }
    #[inline]
    pub unsafe fn hasPremultipliedAlpha(&mut self) -> bool {
        cocos2d_CCTexture2D_hasPremultipliedAlpha(self)
    }
    #[inline]
    pub unsafe fn hasMipmaps(&mut self) -> bool {
        cocos2d_CCTexture2D_hasMipmaps(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        cocos2d_CCTexture2D_CCTexture2D(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
}
extern "thiscall" {
    #[doc = " @js NA\n @lua NA"]
    #[link_name = "\u{1}??1CCTexture2D@cocos2d@@UAE@XZ"]
    pub fn cocos2d_CCTexture2D_CCTexture2D_destructor(this: *mut cocos2d_CCTexture2D);
}
extern "thiscall" {
    #[doc = " pixel format of the texture"]
    #[link_name = "\u{1}?getPixelFormat@CCTexture2D@cocos2d@@UAE?AW4CCTexture2DPixelFormat@2@XZ"]
    pub fn cocos2d_CCTexture2D_getPixelFormat(
        this: *mut ::std::os::raw::c_void,
    ) -> cocos2d_CCTexture2DPixelFormat;
}
extern "thiscall" {
    #[doc = " width in pixels"]
    #[link_name = "\u{1}?getPixelsWide@CCTexture2D@cocos2d@@UAEIXZ"]
    pub fn cocos2d_CCTexture2D_getPixelsWide(
        this: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uint;
}
extern "thiscall" {
    #[doc = " height in pixels"]
    #[link_name = "\u{1}?getPixelsHigh@CCTexture2D@cocos2d@@UAEIXZ"]
    pub fn cocos2d_CCTexture2D_getPixelsHigh(
        this: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uint;
}
extern "thiscall" {
    #[doc = " texture name"]
    #[link_name = "\u{1}?getName@CCTexture2D@cocos2d@@UAEIXZ"]
    pub fn cocos2d_CCTexture2D_getName(this: *mut ::std::os::raw::c_void) -> GLuint;
}
extern "thiscall" {
    #[doc = " texture max S"]
    #[link_name = "\u{1}?getMaxS@CCTexture2D@cocos2d@@UAEMXZ"]
    pub fn cocos2d_CCTexture2D_getMaxS(this: *mut ::std::os::raw::c_void) -> GLfloat;
}
extern "thiscall" {
    #[doc = " texture max S"]
    #[link_name = "\u{1}?setMaxS@CCTexture2D@cocos2d@@UAEXM@Z"]
    pub fn cocos2d_CCTexture2D_setMaxS(this: *mut ::std::os::raw::c_void, var: GLfloat);
}
extern "thiscall" {
    #[doc = " texture max T"]
    #[link_name = "\u{1}?getMaxT@CCTexture2D@cocos2d@@UAEMXZ"]
    pub fn cocos2d_CCTexture2D_getMaxT(this: *mut ::std::os::raw::c_void) -> GLfloat;
}
extern "thiscall" {
    #[doc = " texture max T"]
    #[link_name = "\u{1}?setMaxT@CCTexture2D@cocos2d@@UAEXM@Z"]
    pub fn cocos2d_CCTexture2D_setMaxT(this: *mut ::std::os::raw::c_void, var: GLfloat);
}
extern "thiscall" {
    #[doc = " content size"]
    #[link_name = "\u{1}?getContentSize@CCTexture2D@cocos2d@@UAE?AVCCSize@2@XZ"]
    pub fn cocos2d_CCTexture2D_getContentSize(this: *mut ::std::os::raw::c_void) -> cocos2d_CCSize;
}
extern "thiscall" {
    #[doc = " shader program used by drawAtPoint and drawInRect"]
    #[link_name = "\u{1}?getShaderProgram@CCTexture2D@cocos2d@@UAEPAVCCGLProgram@2@XZ"]
    pub fn cocos2d_CCTexture2D_getShaderProgram(
        this: *mut ::std::os::raw::c_void,
    ) -> *mut cocos2d_CCGLProgram;
}
extern "thiscall" {
    #[doc = " shader program used by drawAtPoint and drawInRect"]
    #[link_name = "\u{1}?setShaderProgram@CCTexture2D@cocos2d@@UAEXPAVCCGLProgram@2@@Z"]
    pub fn cocos2d_CCTexture2D_setShaderProgram(
        this: *mut ::std::os::raw::c_void,
        var: *mut cocos2d_CCGLProgram,
    );
}
#[repr(C)]
pub struct cocos2d_CCRGBAProtocol__bindgen_vtable(::std::os::raw::c_void);
#[doc = " RGBA protocol that affects CCNode's color and opacity\n @js NA"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d_CCRGBAProtocol {
    pub vtable_: *const cocos2d_CCRGBAProtocol__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_cocos2d_CCRGBAProtocol() {
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCRGBAProtocol>(),
        4usize,
        concat!("Size of: ", stringify!(cocos2d_CCRGBAProtocol))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCRGBAProtocol>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCRGBAProtocol))
    );
}
#[repr(C)]
pub struct cocos2d_CCBlendProtocol__bindgen_vtable(::std::os::raw::c_void);
#[doc = " Specify the blending function according glBlendFunc\n Please refer to glBlendFunc in OpenGL ES Manual\n http://www.khronos.org/opengles/sdk/docs/man/xhtml/glBlendFunc.xml for more details.\n @js NA\n @lua NA"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d_CCBlendProtocol {
    pub vtable_: *const cocos2d_CCBlendProtocol__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_cocos2d_CCBlendProtocol() {
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCBlendProtocol>(),
        4usize,
        concat!("Size of: ", stringify!(cocos2d_CCBlendProtocol))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCBlendProtocol>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCBlendProtocol))
    );
}
#[doc = " CCNode objects that uses a CCTexture2D to render the images.\n The texture can have a blending function.\n If the texture has alpha premultiplied the default blending function is:\n   src=GL_ONE dst= GL_ONE_MINUS_SRC_ALPHA\n else\n   src=GL_SRC_ALPHA dst= GL_ONE_MINUS_SRC_ALPHA\n But you can change the blending function at any time.\n @js NA"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d_CCTextureProtocol {
    pub _base: cocos2d_CCBlendProtocol,
}
#[test]
fn bindgen_test_layout_cocos2d_CCTextureProtocol() {
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCTextureProtocol>(),
        4usize,
        concat!("Size of: ", stringify!(cocos2d_CCTextureProtocol))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCTextureProtocol>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCTextureProtocol))
    );
}
#[repr(C)]
pub struct cocos2d_CCLabelProtocol__bindgen_vtable(::std::os::raw::c_void);
#[doc = " Common interface for Labels\n @js NA\n @lua NA"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d_CCLabelProtocol {
    pub vtable_: *const cocos2d_CCLabelProtocol__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_cocos2d_CCLabelProtocol() {
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCLabelProtocol>(),
        4usize,
        concat!("Size of: ", stringify!(cocos2d_CCLabelProtocol))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCLabelProtocol>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCLabelProtocol))
    );
}
#[repr(C)]
pub struct cocos2d_CCDirectorDelegate__bindgen_vtable(::std::os::raw::c_void);
#[doc = " OpenGL projection protocol\n @js NA\n @lua NA"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cocos2d_CCDirectorDelegate {
    pub vtable_: *const cocos2d_CCDirectorDelegate__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_cocos2d_CCDirectorDelegate() {
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCDirectorDelegate>(),
        4usize,
        concat!("Size of: ", stringify!(cocos2d_CCDirectorDelegate))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCDirectorDelegate>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCDirectorDelegate))
    );
}
pub const kCCNodeTagInvalid: cocos2d__bindgen_ty_5 = -1;
#[doc = " @addtogroup base_nodes\n @{"]
pub type cocos2d__bindgen_ty_5 = ::std::os::raw::c_int;
pub const kCCNodeOnEnter: cocos2d__bindgen_ty_6 = 0;
pub const kCCNodeOnExit: cocos2d__bindgen_ty_6 = 1;
pub const kCCNodeOnEnterTransitionDidFinish: cocos2d__bindgen_ty_6 = 2;
pub const kCCNodeOnExitTransitionDidStart: cocos2d__bindgen_ty_6 = 3;
pub const kCCNodeOnCleanup: cocos2d__bindgen_ty_6 = 4;
pub type cocos2d__bindgen_ty_6 = ::std::os::raw::c_int;
#[doc = " @brief CCNode is the main element. Anything that gets drawn or contains things that get drawn is a CCNode.\nThe most popular CCNodes are: CCScene, CCLayer, CCSprite, CCMenu.\n\nThe main features of a CCNode are:\n- They can contain other CCNode nodes (addChild, getChildByTag, removeChild, etc)\n- They can schedule periodic callback (schedule, unschedule, etc)\n- They can execute actions (runAction, stopAction, etc)\n\nSome CCNode nodes provide extra functionality for them or their children.\n\nSubclassing a CCNode usually means (one/all) of:\n- overriding init to initialize resources and schedule callbacks\n- create callbacks to handle the advancement of time\n- overriding draw to render the node\n\nFeatures of CCNode:\n- position\n- scale (x, y)\n- rotation (in degrees, clockwise)\n- CCCamera (an interface to gluLookAt )\n- CCGridBase (to do mesh transformations)\n- anchor point\n- size\n- visible\n- z-order\n- openGL z position\n\nDefault values:\n- rotation: 0\n- position: (x=0,y=0)\n- scale: (x=1,y=1)\n- contentSize: (x=0,y=0)\n- anchorPoint: (x=0,y=0)\n\nLimitations:\n- A CCNode is a \"void\" object. It doesn't have a texture\n\nOrder in transformations with grid disabled\n-# The node will be translated (position)\n-# The node will be rotated (rotation)\n-# The node will be scaled (scale)\n-# The node will be moved according to the camera values (camera)\n\nOrder in transformations with grid enabled\n-# The node will be translated (position)\n-# The node will be rotated (rotation)\n-# The node will be scaled (scale)\n-# The grid will capture the screen\n-# The node will be moved according to the camera values (camera)\n-# The grid will render the captured screen\n\nCamera:\n- Each node has a camera. By default it points to the center of the CCNode."]
#[repr(C)]
#[derive(Debug)]
pub struct cocos2d_CCNode {
    pub _base: cocos2d_CCObject,
    #[doc = "< rotation angle on x-axis"]
    pub m_fRotationX: f32,
    #[doc = "< rotation angle on y-axis"]
    pub m_fRotationY: f32,
    #[doc = "< scaling factor on x-axis"]
    pub m_fScaleX: f32,
    #[doc = "< scaling factor on y-axis"]
    pub m_fScaleY: f32,
    #[doc = "< OpenGL real Z vertex"]
    pub m_fVertexZ: f32,
    #[doc = "< position of the node"]
    pub m_obPosition: cocos2d_CCPoint,
    #[doc = "< skew angle on x-axis"]
    pub m_fSkewX: f32,
    #[doc = "< skew angle on y-axis"]
    pub m_fSkewY: f32,
    #[doc = "< anchor point in points"]
    pub m_obAnchorPointInPoints: cocos2d_CCPoint,
    #[doc = "< anchor point normalized (NOT in points)"]
    pub m_obAnchorPoint: cocos2d_CCPoint,
    #[doc = "< untransformed size of the node"]
    pub m_obContentSize: cocos2d_CCSize,
    #[doc = "< transform"]
    pub m_sAdditionalTransform: cocos2d_CCAffineTransform,
    #[doc = "< transform"]
    pub m_sTransform: cocos2d_CCAffineTransform,
    #[doc = "< transform"]
    pub m_sInverse: cocos2d_CCAffineTransform,
    #[doc = "< a camera"]
    pub m_pCamera: *mut cocos2d_CCCamera,
    #[doc = "< a grid"]
    pub m_pGrid: *mut cocos2d_CCGridBase,
    #[doc = "< array of children nodes"]
    pub m_pChildren: *mut cocos2d_CCArray,
    #[doc = "< weak reference to parent node"]
    pub m_pParent: *mut cocos2d_CCNode,
    #[doc = "< A user assingned void pointer, Can be point to any cpp object"]
    pub m_pUserData: *mut ::std::os::raw::c_void,
    #[doc = "< A user assigned CCObject"]
    pub m_pUserObject: *mut cocos2d_CCObject,
    #[doc = "< OpenGL shader"]
    pub m_pShaderProgram: *mut cocos2d_CCGLProgram,
    #[doc = "< OpenGL servier side state"]
    pub m_eGLServerState: cocos2d_ccGLServerState,
    #[doc = "< scheduler used to schedule timers and updates"]
    pub m_pScheduler: *mut cocos2d_CCScheduler,
    #[doc = "< a pointer to ActionManager singleton, which is used to handle all the actions"]
    pub m_pActionManager: *mut cocos2d_CCActionManager,
    #[doc = "< is running"]
    pub m_bRunning: bool,
    #[doc = "< transform dirty flag"]
    pub m_bTransformDirty: bool,
    #[doc = "< transform dirty flag"]
    pub m_bInverseDirty: bool,
    #[doc = "< The flag to check whether the additional transform is dirty"]
    pub m_bAdditionalTransformDirty: bool,
    pub pad1474: [::std::os::raw::c_char; 10usize],
    #[doc = "< is this node visible"]
    pub m_bVisible: bool,
    #[doc = "< true if the Anchor Point will be (0,0) when you position the CCNode, false otherwise.\n< Used by CCLayer and CCScene."]
    pub m_bIgnoreAnchorPointForPosition: bool,
    #[doc = "< children order dirty flag"]
    pub m_bReorderChildDirty: bool,
    #[doc = "< script handler for onEnter() & onExit(), used in Javascript binding and Lua binding."]
    pub m_nScriptHandler: ::std::os::raw::c_int,
    #[doc = "< script handler for update() callback per frame, which is invoked from lua & javascript."]
    pub m_nUpdateScriptHandler: ::std::os::raw::c_int,
    #[doc = "< type of script binding, lua or javascript"]
    pub m_eScriptType: cocos2d_ccScriptType,
    #[doc = "< Dictionary of components"]
    pub m_pComponentContainer: *mut cocos2d_CCComponentContainer,
    pub m_unknown: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_cocos2d_CCNode() {
    const UNINIT: ::std::mem::MaybeUninit<cocos2d_CCNode> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cocos2d_CCNode>(),
        264usize,
        concat!("Size of: ", stringify!(cocos2d_CCNode))
    );
    assert_eq!(
        ::std::mem::align_of::<cocos2d_CCNode>(),
        4usize,
        concat!("Alignment of ", stringify!(cocos2d_CCNode))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_fRotationX) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_fRotationX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_fRotationY) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_fRotationY)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_fScaleX) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_fScaleX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_fScaleY) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_fScaleY)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_fVertexZ) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_fVertexZ)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_obPosition) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_obPosition)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_fSkewX) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_fSkewX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_fSkewY) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_fSkewY)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_obAnchorPointInPoints) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_obAnchorPointInPoints)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_obAnchorPoint) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_obAnchorPoint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_obContentSize) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_obContentSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_sAdditionalTransform) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_sAdditionalTransform)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_sTransform) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_sTransform)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_sInverse) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_sInverse)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_pCamera) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_pCamera)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_pGrid) as usize - ptr as usize },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_pGrid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_pChildren) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_pChildren)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_pParent) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_pParent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_pUserData) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_pUserData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_pUserObject) as usize - ptr as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_pUserObject)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_pShaderProgram) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_pShaderProgram)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_eGLServerState) as usize - ptr as usize },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_eGLServerState)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_pScheduler) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_pScheduler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_pActionManager) as usize - ptr as usize },
        220usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_pActionManager)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_bRunning) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_bRunning)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_bTransformDirty) as usize - ptr as usize },
        225usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_bTransformDirty)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_bInverseDirty) as usize - ptr as usize },
        226usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_bInverseDirty)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_bAdditionalTransformDirty) as usize - ptr as usize },
        227usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_bAdditionalTransformDirty)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad1474) as usize - ptr as usize },
        228usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(pad1474)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_bVisible) as usize - ptr as usize },
        238usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_bVisible)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).m_bIgnoreAnchorPointForPosition) as usize - ptr as usize
        },
        239usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_bIgnoreAnchorPointForPosition)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_bReorderChildDirty) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_bReorderChildDirty)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_nScriptHandler) as usize - ptr as usize },
        244usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_nScriptHandler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_nUpdateScriptHandler) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_nUpdateScriptHandler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_eScriptType) as usize - ptr as usize },
        252usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_eScriptType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_pComponentContainer) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_pComponentContainer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_unknown) as usize - ptr as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(cocos2d_CCNode),
            "::",
            stringify!(m_unknown)
        )
    );
}
extern "C" {
    #[doc = " Allocates and initializes a node.\n @return A initialized node which is marked as \"autorelease\"."]
    #[link_name = "\u{1}?create@CCNode@cocos2d@@SAPAV12@XZ"]
    pub fn cocos2d_CCNode_create() -> *mut cocos2d_CCNode;
}
extern "thiscall" {
    #[doc = " Gets the description string. It makes debugging easier.\n @return A string terminated with '\\0'\n @js NA"]
    #[link_name = "\u{1}?description@CCNode@cocos2d@@QAEPBDXZ"]
    pub fn cocos2d_CCNode_description(this: *mut cocos2d_CCNode) -> *const ::std::os::raw::c_char;
}
extern "thiscall" {
    #[doc = " Schedules for lua script.\n @js NA"]
    #[link_name = "\u{1}?scheduleUpdateWithPriorityLua@CCNode@cocos2d@@QAEXHH@Z"]
    pub fn cocos2d_CCNode_scheduleUpdateWithPriorityLua(
        this: *mut cocos2d_CCNode,
        nHandler: ::std::os::raw::c_int,
        priority: ::std::os::raw::c_int,
    );
}
extern "thiscall" {
    #[doc = " Returns a \"local\" axis aligned bounding box of the node.\n The returned box is relative only to its parent.\n\n @note This method returns a temporaty variable, so it can't returns const CCRect&\n @todo Rename to getBoundingBox() in the future versions.\n\n @return A \"local\" axis aligned boudning box of the node.\n @js getBoundingBox"]
    #[link_name = "\u{1}?boundingBox@CCNode@cocos2d@@QAE?AVCCRect@2@XZ"]
    pub fn cocos2d_CCNode_boundingBox(this: *mut cocos2d_CCNode) -> cocos2d_CCRect;
}
extern "thiscall" {
    #[doc = " Executes an action, and returns the action that is executed.\n\n This node becomes the action's target. Refer to CCAction::getTarget()\n @warning Actions don't retain their target.\n\n @return An Action pointer"]
    #[link_name = "\u{1}?runAction@CCNode@cocos2d@@QAEPAVCCAction@2@PAV32@@Z"]
    pub fn cocos2d_CCNode_runAction(
        this: *mut cocos2d_CCNode,
        action: *mut cocos2d_CCAction,
    ) -> *mut cocos2d_CCAction;
}
extern "thiscall" {
    #[doc = " Stops and removes all actions from the running action list ."]
    #[link_name = "\u{1}?stopAllActions@CCNode@cocos2d@@QAEXXZ"]
    pub fn cocos2d_CCNode_stopAllActions(this: *mut cocos2d_CCNode);
}
extern "thiscall" {
    #[doc = " Stops and removes an action from the running action list.\n\n @param An action object to be removed."]
    #[link_name = "\u{1}?stopAction@CCNode@cocos2d@@QAEXPAVCCAction@2@@Z"]
    pub fn cocos2d_CCNode_stopAction(this: *mut cocos2d_CCNode, action: *mut cocos2d_CCAction);
}
extern "thiscall" {
    #[doc = " Removes an action from the running action list by its tag.\n\n @param A tag that indicates the action to be removed."]
    #[link_name = "\u{1}?stopActionByTag@CCNode@cocos2d@@QAEXH@Z"]
    pub fn cocos2d_CCNode_stopActionByTag(this: *mut cocos2d_CCNode, tag: ::std::os::raw::c_int);
}
extern "thiscall" {
    #[doc = " Gets an action from the running action list by its tag.\n\n @see setTag(int), getTag().\n\n @return The action object with the given tag."]
    #[link_name = "\u{1}?getActionByTag@CCNode@cocos2d@@QAEPAVCCAction@2@H@Z"]
    pub fn cocos2d_CCNode_getActionByTag(
        this: *mut cocos2d_CCNode,
        tag: ::std::os::raw::c_int,
    ) -> *mut cocos2d_CCAction;
}
extern "thiscall" {
    #[doc = " Returns the numbers of actions that are running plus the ones that are schedule to run (actions in actionsToAdd and actions arrays).\n\n Composable actions are counted as 1 action. Example:\n    If you are running 1 Sequence of 7 actions, it will return 1.\n    If you are running 7 Sequences of 2 actions, it will return 7.\n @todo Rename to getNumberOfRunningActions()\n\n @return The number of actions that are running plus the ones that are schedule to run"]
    #[link_name = "\u{1}?numberOfRunningActions@CCNode@cocos2d@@QAEIXZ"]
    pub fn cocos2d_CCNode_numberOfRunningActions(
        this: *mut cocos2d_CCNode,
    ) -> ::std::os::raw::c_uint;
}
extern "thiscall" {
    #[doc = " Checks whether a selector is scheduled.\n\n @param selector      A function selector\n @return Whether the funcion selector is scheduled.\n @js NA\n @lua NA"]
    #[link_name = "\u{1}?isScheduled@CCNode@cocos2d@@QAE_NP8CCObject@2@AEXM@Z@Z"]
    pub fn cocos2d_CCNode_isScheduled(
        this: *mut cocos2d_CCNode,
        selector: cocos2d_SEL_SCHEDULE,
    ) -> bool;
}
extern "thiscall" {
    #[doc = " Schedules the \"update\" method.\n\n It will use the order number 0. This method will be called every frame.\n Scheduled methods with a lower order value will be called before the ones that have a higher order value.\n Only one \"update\" method could be scheduled per node.\n @lua NA"]
    #[link_name = "\u{1}?scheduleUpdate@CCNode@cocos2d@@QAEXXZ"]
    pub fn cocos2d_CCNode_scheduleUpdate(this: *mut cocos2d_CCNode);
}
extern "thiscall" {
    #[doc = " Schedules the \"update\" method with a custom priority.\n\n This selector will be called every frame.\n Scheduled methods with a lower priority will be called before the ones that have a higher value.\n Only one \"update\" selector could be scheduled per node (You can't have 2 'update' selectors).\n @lua NA"]
    #[link_name = "\u{1}?scheduleUpdateWithPriority@CCNode@cocos2d@@QAEXH@Z"]
    pub fn cocos2d_CCNode_scheduleUpdateWithPriority(
        this: *mut cocos2d_CCNode,
        priority: ::std::os::raw::c_int,
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?unscheduleUpdate@CCNode@cocos2d@@QAEXXZ"]
    pub fn cocos2d_CCNode_unscheduleUpdate(this: *mut cocos2d_CCNode);
}
extern "thiscall" {
    #[doc = " Schedules a custom selector.\n\n If the selector is already scheduled, then the interval parameter will be updated without scheduling it again.\n @code\n // firstly, implement a schedule function\n void MyNode::TickMe(float dt);\n // wrap this function into a selector via schedule_selector marco.\n this->schedule(schedule_selector(MyNode::TickMe), 0, 0, 0);\n @endcode\n\n @param interval  Tick interval in seconds. 0 means tick every frame. If interval = 0, it's recommended to use scheduleUpdate() instead.\n @param repeat    The selector will be excuted (repeat + 1) times, you can use kCCRepeatForever for tick infinitely.\n @param delay     The amount of time that the first tick will wait before execution.\n @lua NA"]
    #[link_name = "\u{1}?schedule@CCNode@cocos2d@@QAEXP8CCObject@2@AEXM@ZMIM@Z"]
    pub fn cocos2d_CCNode_schedule(
        this: *mut cocos2d_CCNode,
        selector: cocos2d_SEL_SCHEDULE,
        interval: f32,
        repeat: ::std::os::raw::c_uint,
        delay: f32,
    );
}
extern "thiscall" {
    #[doc = " Schedules a custom selector with an interval time in seconds.\n @see schedule(SEL_SCHEDULE, float, unsigned int, float)\n\n @param selector      A function wrapped as a selector\n @param interval      Callback interval time in seconds. 0 means tick every frame,\n @lua NA"]
    #[link_name = "\u{1}?schedule@CCNode@cocos2d@@QAEXP8CCObject@2@AEXM@ZM@Z"]
    pub fn cocos2d_CCNode_schedule1(
        this: *mut cocos2d_CCNode,
        selector: cocos2d_SEL_SCHEDULE,
        interval: f32,
    );
}
extern "thiscall" {
    #[doc = " Schedules a selector that runs only once, with a delay of 0 or larger\n @see schedule(SEL_SCHEDULE, float, unsigned int, float)\n\n @param selector      A function wrapped as a selector\n @param delay         The amount of time that the first tick will wait before execution.\n @lua NA"]
    #[link_name = "\u{1}?scheduleOnce@CCNode@cocos2d@@QAEXP8CCObject@2@AEXM@ZM@Z"]
    pub fn cocos2d_CCNode_scheduleOnce(
        this: *mut cocos2d_CCNode,
        selector: cocos2d_SEL_SCHEDULE,
        delay: f32,
    );
}
extern "thiscall" {
    #[doc = " Schedules a custom selector, the scheduled selector will be ticked every frame\n @see schedule(SEL_SCHEDULE, float, unsigned int, float)\n\n @param selector      A function wrapped as a selector\n @lua NA"]
    #[link_name = "\u{1}?schedule@CCNode@cocos2d@@QAEXP8CCObject@2@AEXM@Z@Z"]
    pub fn cocos2d_CCNode_schedule2(this: *mut cocos2d_CCNode, selector: cocos2d_SEL_SCHEDULE);
}
extern "thiscall" {
    #[doc = " Unschedules a custom selector.\n @see schedule(SEL_SCHEDULE, float, unsigned int, float)\n\n @param selector      A function wrapped as a selector\n @lua NA"]
    #[link_name = "\u{1}?unschedule@CCNode@cocos2d@@QAEXP8CCObject@2@AEXM@Z@Z"]
    pub fn cocos2d_CCNode_unschedule(this: *mut cocos2d_CCNode, selector: cocos2d_SEL_SCHEDULE);
}
extern "thiscall" {
    #[doc = " Unschedule all scheduled selectors: custom selectors, and the 'update' selector.\n Actions are not affected by this method."]
    #[link_name = "\u{1}?unscheduleAllSelectors@CCNode@cocos2d@@QAEXXZ"]
    pub fn cocos2d_CCNode_unscheduleAllSelectors(this: *mut cocos2d_CCNode);
}
extern "thiscall" {
    #[doc = " Resumes all scheduled selectors and actions.\n This method is called internally by onEnter\n @js NA\n @lua NA"]
    #[link_name = "\u{1}?resumeSchedulerAndActions@CCNode@cocos2d@@QAEXXZ"]
    pub fn cocos2d_CCNode_resumeSchedulerAndActions(this: *mut cocos2d_CCNode);
}
extern "thiscall" {
    #[doc = " Pauses all scheduled selectors and actions.\n This method is called internally by onExit\n @js NA\n @lua NA"]
    #[link_name = "\u{1}?pauseSchedulerAndActions@CCNode@cocos2d@@QAEXXZ"]
    pub fn cocos2d_CCNode_pauseSchedulerAndActions(this: *mut cocos2d_CCNode);
}
extern "thiscall" {
    #[doc = " Performs OpenGL view-matrix transformation based on position, scale, rotation and other attributes."]
    #[link_name = "\u{1}?transform@CCNode@cocos2d@@QAEXXZ"]
    pub fn cocos2d_CCNode_transform(this: *mut cocos2d_CCNode);
}
extern "thiscall" {
    #[doc = " Performs OpenGL view-matrix transformation of it's ancestors.\n Generally the ancestors are already transformed, but in certain cases (eg: attaching a FBO)\n It's necessary to transform the ancestors again."]
    #[link_name = "\u{1}?transformAncestors@CCNode@cocos2d@@QAEXXZ"]
    pub fn cocos2d_CCNode_transformAncestors(this: *mut cocos2d_CCNode);
}
extern "thiscall" {
    #[doc = " Converts a Point to node (local) space coordinates. The result is in Points."]
    #[link_name = "\u{1}?convertToNodeSpace@CCNode@cocos2d@@QAE?AVCCPoint@2@ABV32@@Z"]
    pub fn cocos2d_CCNode_convertToNodeSpace(
        this: *mut cocos2d_CCNode,
        worldPoint: *const cocos2d_CCPoint,
    ) -> cocos2d_CCPoint;
}
extern "thiscall" {
    #[doc = " Converts a Point to world space coordinates. The result is in Points."]
    #[link_name = "\u{1}?convertToWorldSpace@CCNode@cocos2d@@QAE?AVCCPoint@2@ABV32@@Z"]
    pub fn cocos2d_CCNode_convertToWorldSpace(
        this: *mut cocos2d_CCNode,
        nodePoint: *const cocos2d_CCPoint,
    ) -> cocos2d_CCPoint;
}
extern "thiscall" {
    #[doc = " Converts a Point to node (local) space coordinates. The result is in Points.\n treating the returned/received node point as anchor relative."]
    #[link_name = "\u{1}?convertToNodeSpaceAR@CCNode@cocos2d@@QAE?AVCCPoint@2@ABV32@@Z"]
    pub fn cocos2d_CCNode_convertToNodeSpaceAR(
        this: *mut cocos2d_CCNode,
        worldPoint: *const cocos2d_CCPoint,
    ) -> cocos2d_CCPoint;
}
extern "thiscall" {
    #[doc = " Converts a local Point to world space coordinates.The result is in Points.\n treating the returned/received node point as anchor relative."]
    #[link_name = "\u{1}?convertToWorldSpaceAR@CCNode@cocos2d@@QAE?AVCCPoint@2@ABV32@@Z"]
    pub fn cocos2d_CCNode_convertToWorldSpaceAR(
        this: *mut cocos2d_CCNode,
        nodePoint: *const cocos2d_CCPoint,
    ) -> cocos2d_CCPoint;
}
extern "thiscall" {
    #[doc = " convenience methods which take a CCTouch instead of CCPoint"]
    #[link_name = "\u{1}?convertTouchToNodeSpace@CCNode@cocos2d@@QAE?AVCCPoint@2@PAVCCTouch@2@@Z"]
    pub fn cocos2d_CCNode_convertTouchToNodeSpace(
        this: *mut cocos2d_CCNode,
        touch: *mut cocos2d_CCTouch,
    ) -> cocos2d_CCPoint;
}
extern "thiscall" {
    #[doc = " converts a CCTouch (world coordinates) into a local coordinate. This method is AR (Anchor Relative)."]
    #[link_name = "\u{1}?convertTouchToNodeSpaceAR@CCNode@cocos2d@@QAE?AVCCPoint@2@PAVCCTouch@2@@Z"]
    pub fn cocos2d_CCNode_convertTouchToNodeSpaceAR(
        this: *mut cocos2d_CCNode,
        touch: *mut cocos2d_CCTouch,
    ) -> cocos2d_CCPoint;
}
extern "thiscall" {
    #[doc = "  Sets the additional transform.\n\n  @note The additional transform will be concatenated at the end of nodeToParentTransform.\n        It could be used to simulate `parent-child` relationship between two nodes (e.g. one is in BatchNode, another isn't).\n  @code\n// create a batchNode\nCCSpriteBatchNode* batch= CCSpriteBatchNode::create(\"Icon-114.png\");\nthis->addChild(batch);\n\n// create two sprites, spriteA will be added to batchNode, they are using different textures.\nCCSprite* spriteA = CCSprite::createWithTexture(batch->getTexture());\nCCSprite* spriteB = CCSprite::create(\"Icon-72.png\");\n\nbatch->addChild(spriteA);\n\n// We can't make spriteB as spriteA's child since they use different textures. So just add it to layer.\n// But we want to simulate `parent-child` relationship for these two node.\nthis->addChild(spriteB);\n\n//position\nspriteA->setPosition(ccp(200, 200));\n\n// Gets the spriteA's transform.\nCCAffineTransform t = spriteA->nodeToParentTransform();\n\n// Sets the additional transform to spriteB, spriteB's postion will based on its pseudo parent i.e. spriteA.\nspriteB->setAdditionalTransform(t);\n\n//scale\nspriteA->setScale(2);\n\n// Gets the spriteA's transform.\nt = spriteA->nodeToParentTransform();\n\n// Sets the additional transform to spriteB, spriteB's scale will based on its pseudo parent i.e. spriteA.\nspriteB->setAdditionalTransform(t);\n\n//rotation\nspriteA->setRotation(20);\n\n// Gets the spriteA's transform.\nt = spriteA->nodeToParentTransform();\n\n// Sets the additional transform to spriteB, spriteB's rotation will based on its pseudo parent i.e. spriteA.\nspriteB->setAdditionalTransform(t);\n  @endcode"]
    #[link_name = "\u{1}?setAdditionalTransform@CCNode@cocos2d@@QAEXABUCCAffineTransform@2@@Z"]
    pub fn cocos2d_CCNode_setAdditionalTransform(
        this: *mut cocos2d_CCNode,
        additionalTransform: *const cocos2d_CCAffineTransform,
    );
}
extern "thiscall" {
    #[doc = " @{\n @name component functions\n**\n*   gets a component by its name\n*/"]
    #[link_name = "\u{1}?getComponent@CCNode@cocos2d@@QBEPAVCCComponent@2@PBD@Z"]
    pub fn cocos2d_CCNode_getComponent(
        this: *const cocos2d_CCNode,
        pName: *const ::std::os::raw::c_char,
    ) -> *mut cocos2d_CCComponent;
}
extern "thiscall" {
    #[doc = " Default constructor\n @js ctor"]
    #[link_name = "\u{1}??0CCNode@cocos2d@@QAE@XZ"]
    pub fn cocos2d_CCNode_CCNode(this: *mut cocos2d_CCNode);
}
extern "thiscall" {
    #[link_name = "\u{1}??0CCNode@cocos2d@@QAE@ABV01@@Z"]
    pub fn cocos2d_CCNode_CCNode1(this: *mut cocos2d_CCNode, arg1: *const cocos2d_CCNode);
}
impl cocos2d_CCNode {
    #[inline]
    pub unsafe fn create() -> *mut cocos2d_CCNode {
        cocos2d_CCNode_create()
    }
    #[inline]
    pub unsafe fn description(&mut self) -> *const ::std::os::raw::c_char {
        cocos2d_CCNode_description(self)
    }
    #[inline]
    pub unsafe fn scheduleUpdateWithPriorityLua(
        &mut self,
        nHandler: ::std::os::raw::c_int,
        priority: ::std::os::raw::c_int,
    ) {
        cocos2d_CCNode_scheduleUpdateWithPriorityLua(self, nHandler, priority)
    }
    #[inline]
    pub unsafe fn boundingBox(&mut self) -> cocos2d_CCRect {
        cocos2d_CCNode_boundingBox(self)
    }
    #[inline]
    pub unsafe fn runAction(&mut self, action: *mut cocos2d_CCAction) -> *mut cocos2d_CCAction {
        cocos2d_CCNode_runAction(self, action)
    }
    #[inline]
    pub unsafe fn stopAllActions(&mut self) {
        cocos2d_CCNode_stopAllActions(self)
    }
    #[inline]
    pub unsafe fn stopAction(&mut self, action: *mut cocos2d_CCAction) {
        cocos2d_CCNode_stopAction(self, action)
    }
    #[inline]
    pub unsafe fn stopActionByTag(&mut self, tag: ::std::os::raw::c_int) {
        cocos2d_CCNode_stopActionByTag(self, tag)
    }
    #[inline]
    pub unsafe fn getActionByTag(&mut self, tag: ::std::os::raw::c_int) -> *mut cocos2d_CCAction {
        cocos2d_CCNode_getActionByTag(self, tag)
    }
    #[inline]
    pub unsafe fn numberOfRunningActions(&mut self) -> ::std::os::raw::c_uint {
        cocos2d_CCNode_numberOfRunningActions(self)
    }
    #[inline]
    pub unsafe fn isScheduled(&mut self, selector: cocos2d_SEL_SCHEDULE) -> bool {
        cocos2d_CCNode_isScheduled(self, selector)
    }
    #[inline]
    pub unsafe fn scheduleUpdate(&mut self) {
        cocos2d_CCNode_scheduleUpdate(self)
    }
    #[inline]
    pub unsafe fn scheduleUpdateWithPriority(&mut self, priority: ::std::os::raw::c_int) {
        cocos2d_CCNode_scheduleUpdateWithPriority(self, priority)
    }
    #[inline]
    pub unsafe fn unscheduleUpdate(&mut self) {
        cocos2d_CCNode_unscheduleUpdate(self)
    }
    #[inline]
    pub unsafe fn schedule(
        &mut self,
        selector: cocos2d_SEL_SCHEDULE,
        interval: f32,
        repeat: ::std::os::raw::c_uint,
        delay: f32,
    ) {
        cocos2d_CCNode_schedule(self, selector, interval, repeat, delay)
    }
    #[inline]
    pub unsafe fn schedule1(&mut self, selector: cocos2d_SEL_SCHEDULE, interval: f32) {
        cocos2d_CCNode_schedule1(self, selector, interval)
    }
    #[inline]
    pub unsafe fn scheduleOnce(&mut self, selector: cocos2d_SEL_SCHEDULE, delay: f32) {
        cocos2d_CCNode_scheduleOnce(self, selector, delay)
    }
    #[inline]
    pub unsafe fn schedule2(&mut self, selector: cocos2d_SEL_SCHEDULE) {
        cocos2d_CCNode_schedule2(self, selector)
    }
    #[inline]
    pub unsafe fn unschedule(&mut self, selector: cocos2d_SEL_SCHEDULE) {
        cocos2d_CCNode_unschedule(self, selector)
    }
    #[inline]
    pub unsafe fn unscheduleAllSelectors(&mut self) {
        cocos2d_CCNode_unscheduleAllSelectors(self)
    }
    #[inline]
    pub unsafe fn resumeSchedulerAndActions(&mut self) {
        cocos2d_CCNode_resumeSchedulerAndActions(self)
    }
    #[inline]
    pub unsafe fn pauseSchedulerAndActions(&mut self) {
        cocos2d_CCNode_pauseSchedulerAndActions(self)
    }
    #[inline]
    pub unsafe fn transform(&mut self) {
        cocos2d_CCNode_transform(self)
    }
    #[inline]
    pub unsafe fn transformAncestors(&mut self) {
        cocos2d_CCNode_transformAncestors(self)
    }
    #[inline]
    pub unsafe fn convertToNodeSpace(
        &mut self,
        worldPoint: *const cocos2d_CCPoint,
    ) -> cocos2d_CCPoint {
        cocos2d_CCNode_convertToNodeSpace(self, worldPoint)
    }
    #[inline]
    pub unsafe fn convertToWorldSpace(
        &mut self,
        nodePoint: *const cocos2d_CCPoint,
    ) -> cocos2d_CCPoint {
        cocos2d_CCNode_convertToWorldSpace(self, nodePoint)
    }
    #[inline]
    pub unsafe fn convertToNodeSpaceAR(
        &mut self,
        worldPoint: *const cocos2d_CCPoint,
    ) -> cocos2d_CCPoint {
        cocos2d_CCNode_convertToNodeSpaceAR(self, worldPoint)
    }
    #[inline]
    pub unsafe fn convertToWorldSpaceAR(
        &mut self,
        nodePoint: *const cocos2d_CCPoint,
    ) -> cocos2d_CCPoint {
        cocos2d_CCNode_convertToWorldSpaceAR(self, nodePoint)
    }
    #[inline]
    pub unsafe fn convertTouchToNodeSpace(
        &mut self,
        touch: *mut cocos2d_CCTouch,
    ) -> cocos2d_CCPoint {
        cocos2d_CCNode_convertTouchToNodeSpace(self, touch)
    }
    #[inline]
    pub unsafe fn convertTouchToNodeSpaceAR(
        &mut self,
        touch: *mut cocos2d_CCTouch,
    ) -> cocos2d_CCPoint {
        cocos2d_CCNode_convertTouchToNodeSpaceAR(self, touch)
    }
    #[inline]
    pub unsafe fn setAdditionalTransform(
        &mut self,
        additionalTransform: *const cocos2d_CCAffineTransform,
    ) {
        cocos2d_CCNode_setAdditionalTransform(self, additionalTransform)
    }
    #[inline]
    pub unsafe fn getComponent(
        &self,
        pName: *const ::std::os::raw::c_char,
    ) -> *mut cocos2d_CCComponent {
        cocos2d_CCNode_getComponent(self, pName)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        cocos2d_CCNode_CCNode(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: *const cocos2d_CCNode) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        cocos2d_CCNode_CCNode1(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
}
extern "thiscall" {
    #[doc = " Default destructor\n @js NA\n @lua NA"]
    #[link_name = "\u{1}??1CCNode@cocos2d@@UAE@XZ"]
    pub fn cocos2d_CCNode_CCNode_destructor(this: *mut cocos2d_CCNode);
}
extern "thiscall" {
    #[doc = "  Initializes the instance of CCNode\n  @return Whether the initialization was successful."]
    #[link_name = "\u{1}?init@CCNode@cocos2d@@UAE_NXZ"]
    pub fn cocos2d_CCNode_init(this: *mut ::std::os::raw::c_void) -> bool;
}
extern "thiscall" {
    #[doc = " Sets the Z order which stands for the drawing order, and reorder this node in its parent's children array.\n\n The Z order of node is relative to its \"brothers\": children of the same parent.\n It's nothing to do with OpenGL's z vertex. This one only affects the draw order of nodes in cocos2d.\n The larger number it is, the later this node will be drawn in each message loop.\n Please refer to setVertexZ(float) for the difference.\n\n @param nZOrder   Z order of this node."]
    #[link_name = "\u{1}?setZOrder@CCNode@cocos2d@@UAEXH@Z"]
    pub fn cocos2d_CCNode_setZOrder(
        this: *mut ::std::os::raw::c_void,
        zOrder: ::std::os::raw::c_int,
    );
}
extern "thiscall" {
    #[doc = " Sets the z order which stands for the drawing order\n\n This is an internal method. Don't call it outside the framework.\n The difference between setZOrder(int) and _setOrder(int) is:\n - _setZOrder(int) is a pure setter for m_nZOrder memeber variable\n - setZOrder(int) firstly changes m_nZOrder, then recorder this node in its parent's chilren array."]
    #[link_name = "\u{1}?_setZOrder@CCNode@cocos2d@@UAEXH@Z"]
    pub fn cocos2d_CCNode__setZOrder(this: *mut ::std::os::raw::c_void, z: ::std::os::raw::c_int);
}
extern "thiscall" {
    #[doc = " Gets the Z order of this node.\n\n @see setZOrder(int)\n\n @return The Z order."]
    #[link_name = "\u{1}?getZOrder@CCNode@cocos2d@@UAEHXZ"]
    pub fn cocos2d_CCNode_getZOrder(this: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "thiscall" {
    #[doc = " Sets the real OpenGL Z vertex.\n\n Differences between openGL Z vertex and cocos2d Z order:\n - OpenGL Z modifies the Z vertex, and not the Z order in the relation between parent-children\n - OpenGL Z might require to set 2D projection\n - cocos2d Z order works OK if all the nodes uses the same openGL Z vertex. eg: vertexZ = 0\n\n @warning Use it at your own risk since it might break the cocos2d parent-children z order\n\n @param fVertexZ  OpenGL Z vertex of this node."]
    #[link_name = "\u{1}?setVertexZ@CCNode@cocos2d@@UAEXM@Z"]
    pub fn cocos2d_CCNode_setVertexZ(this: *mut ::std::os::raw::c_void, vertexZ: f32);
}
extern "thiscall" {
    #[doc = " Gets OpenGL Z vertex of this node.\n\n @see setVertexZ(float)\n\n @return OpenGL Z vertex of this node"]
    #[link_name = "\u{1}?getVertexZ@CCNode@cocos2d@@UAEMXZ"]
    pub fn cocos2d_CCNode_getVertexZ(this: *mut ::std::os::raw::c_void) -> f32;
}
extern "thiscall" {
    #[doc = " Changes the scale factor on X axis of this node\n\n The deafult value is 1.0 if you haven't changed it before\n\n @param fScaleX   The scale factor on X axis."]
    #[link_name = "\u{1}?setScaleX@CCNode@cocos2d@@UAEXM@Z"]
    pub fn cocos2d_CCNode_setScaleX(this: *mut ::std::os::raw::c_void, fScaleX: f32);
}
extern "thiscall" {
    #[doc = " Returns the scale factor on X axis of this node\n\n @see setScaleX(float)\n\n @return The scale factor on X axis."]
    #[link_name = "\u{1}?getScaleX@CCNode@cocos2d@@UAEMXZ"]
    pub fn cocos2d_CCNode_getScaleX(this: *mut ::std::os::raw::c_void) -> f32;
}
extern "thiscall" {
    #[doc = " Changes the scale factor on Y axis of this node\n\n The Default value is 1.0 if you haven't changed it before.\n\n @param fScaleY   The scale factor on Y axis."]
    #[link_name = "\u{1}?setScaleY@CCNode@cocos2d@@UAEXM@Z"]
    pub fn cocos2d_CCNode_setScaleY(this: *mut ::std::os::raw::c_void, fScaleY: f32);
}
extern "thiscall" {
    #[doc = " Returns the scale factor on Y axis of this node\n\n @see setScaleY(float)\n\n @return The scale factor on Y axis."]
    #[link_name = "\u{1}?getScaleY@CCNode@cocos2d@@UAEMXZ"]
    pub fn cocos2d_CCNode_getScaleY(this: *mut ::std::os::raw::c_void) -> f32;
}
extern "thiscall" {
    #[doc = " Changes both X and Y scale factor of the node.\n\n 1.0 is the default scale factor. It modifies the X and Y scale at the same time.\n\n @param scale     The scale factor for both X and Y axis."]
    #[link_name = "\u{1}?setScale@CCNode@cocos2d@@UAEXM@Z"]
    pub fn cocos2d_CCNode_setScale(this: *mut ::std::os::raw::c_void, scale: f32);
}
extern "thiscall" {
    #[doc = " Gets the scale factor of the node,  when X and Y have the same scale factor.\n\n @warning Assert when m_fScaleX != m_fScaleY.\n @see setScale(float)\n\n @return The scale factor of the node."]
    #[link_name = "\u{1}?getScale@CCNode@cocos2d@@UAEMXZ"]
    pub fn cocos2d_CCNode_getScale(this: *mut ::std::os::raw::c_void) -> f32;
}
extern "thiscall" {
    #[doc = " Changes both X and Y scale factor of the node.\n\n 1.0 is the default scale factor. It modifies the X and Y scale at the same time.\n\n @param fScaleX     The scale factor on X axis.\n @param fScaleY     The scale factor on Y axis."]
    #[link_name = "\u{1}?setScale@CCNode@cocos2d@@UAEXMM@Z"]
    pub fn cocos2d_CCNode_setScale1(this: *mut ::std::os::raw::c_void, fScaleX: f32, fScaleY: f32);
}
extern "thiscall" {
    #[doc = " Changes the position (x,y) of the node in OpenGL coordinates\n\n Usually we use ccp(x,y) to compose CCPoint object.\n The original point (0,0) is at the left-bottom corner of screen.\n For example, this codesnip sets the node in the center of screen.\n @code\n CCSize size = CCDirector::sharedDirector()->getWinSize();\n node->setPosition( ccp(size.width/2, size.height/2) )\n @endcode\n\n @param position  The position (x,y) of the node in OpenGL coordinates\n @js NA"]
    #[link_name = "\u{1}?setPosition@CCNode@cocos2d@@UAEXABVCCPoint@2@@Z"]
    pub fn cocos2d_CCNode_setPosition(
        this: *mut ::std::os::raw::c_void,
        position: *const cocos2d_CCPoint,
    );
}
extern "thiscall" {
    #[doc = " Gets the position (x,y) of the node in OpenGL coordinates\n\n @see setPosition(const CCPoint&)\n\n @return The position (x,y) of the node in OpenGL coordinates"]
    #[link_name = "\u{1}?getPosition@CCNode@cocos2d@@UAEABVCCPoint@2@XZ"]
    pub fn cocos2d_CCNode_getPosition(this: *mut ::std::os::raw::c_void) -> *const cocos2d_CCPoint;
}
extern "thiscall" {
    #[doc = " Sets position in a more efficient way.\n\n Passing two numbers (x,y) is much efficient than passing CCPoint object.\n This method is binded to lua and javascript.\n Passing a number is 10 times faster than passing a object from lua to c++\n\n @code\n // sample code in lua\n local pos  = node::getPosition()  -- returns CCPoint object from C++\n node:setPosition(x, y)            -- pass x, y coordinate to C++\n @endcode\n\n @param x     X coordinate for position\n @param y     Y coordinate for position\n @js NA"]
    #[link_name = "\u{1}?setPosition@CCNode@cocos2d@@UAEXMM@Z"]
    pub fn cocos2d_CCNode_setPosition1(this: *mut ::std::os::raw::c_void, x: f32, y: f32);
}
extern "thiscall" {
    #[doc = " Gets position in a more efficient way, returns two number instead of a CCPoint object\n\n @see setPosition(float, float)"]
    #[link_name = "\u{1}?getPosition@CCNode@cocos2d@@UAEXPAM0@Z"]
    pub fn cocos2d_CCNode_getPosition1(this: *mut ::std::os::raw::c_void, x: *mut f32, y: *mut f32);
}
extern "thiscall" {
    #[doc = " Gets/Sets x or y coordinate individually for position.\n These methods are used in Lua and Javascript Bindings"]
    #[link_name = "\u{1}?setPositionX@CCNode@cocos2d@@UAEXM@Z"]
    pub fn cocos2d_CCNode_setPositionX(this: *mut ::std::os::raw::c_void, x: f32);
}
extern "thiscall" {
    #[link_name = "\u{1}?getPositionX@CCNode@cocos2d@@UAEMXZ"]
    pub fn cocos2d_CCNode_getPositionX(this: *mut ::std::os::raw::c_void) -> f32;
}
extern "thiscall" {
    #[link_name = "\u{1}?setPositionY@CCNode@cocos2d@@UAEXM@Z"]
    pub fn cocos2d_CCNode_setPositionY(this: *mut ::std::os::raw::c_void, y: f32);
}
extern "thiscall" {
    #[link_name = "\u{1}?getPositionY@CCNode@cocos2d@@UAEMXZ"]
    pub fn cocos2d_CCNode_getPositionY(this: *mut ::std::os::raw::c_void) -> f32;
}
extern "thiscall" {
    #[doc = " Changes the X skew angle of the node in degrees.\n\n This angle describes the shear distortion in the X direction.\n Thus, it is the angle between the Y axis and the left edge of the shape\n The default skewX angle is 0. Positive values distort the node in a CW direction.\n\n @param fSkewX The X skew angle of the node in degrees."]
    #[link_name = "\u{1}?setSkewX@CCNode@cocos2d@@UAEXM@Z"]
    pub fn cocos2d_CCNode_setSkewX(this: *mut ::std::os::raw::c_void, fSkewX: f32);
}
extern "thiscall" {
    #[doc = " Returns the X skew angle of the node in degrees.\n\n @see setSkewX(float)\n\n @return The X skew angle of the node in degrees."]
    #[link_name = "\u{1}?getSkewX@CCNode@cocos2d@@UAEMXZ"]
    pub fn cocos2d_CCNode_getSkewX(this: *mut ::std::os::raw::c_void) -> f32;
}
extern "thiscall" {
    #[doc = " Changes the Y skew angle of the node in degrees.\n\n This angle describes the shear distortion in the Y direction.\n Thus, it is the angle between the X axis and the bottom edge of the shape\n The default skewY angle is 0. Positive values distort the node in a CCW direction.\n\n @param fSkewY    The Y skew angle of the node in degrees."]
    #[link_name = "\u{1}?setSkewY@CCNode@cocos2d@@UAEXM@Z"]
    pub fn cocos2d_CCNode_setSkewY(this: *mut ::std::os::raw::c_void, fSkewY: f32);
}
extern "thiscall" {
    #[doc = " Returns the Y skew angle of the node in degrees.\n\n @see setSkewY(float)\n\n @return The Y skew angle of the node in degrees."]
    #[link_name = "\u{1}?getSkewY@CCNode@cocos2d@@UAEMXZ"]
    pub fn cocos2d_CCNode_getSkewY(this: *mut ::std::os::raw::c_void) -> f32;
}
extern "thiscall" {
    #[doc = " Sets the anchor point in percent.\n\n anchorPoint is the point around which all transformations and positioning manipulations take place.\n It's like a pin in the node where it is \"attached\" to its parent.\n The anchorPoint is normalized, like a percentage. (0,0) means the bottom-left corner and (1,1) means the top-right corner.\n But you can use values higher than (1,1) and lower than (0,0) too.\n The default anchorPoint is (0.5,0.5), so it starts in the center of the node.\n\n @param anchorPoint   The anchor point of node."]
    #[link_name = "\u{1}?setAnchorPoint@CCNode@cocos2d@@UAEXABVCCPoint@2@@Z"]
    pub fn cocos2d_CCNode_setAnchorPoint(
        this: *mut ::std::os::raw::c_void,
        anchorPoint: *const cocos2d_CCPoint,
    );
}
extern "thiscall" {
    #[doc = " Returns the anchor point in percent.\n\n @see setAnchorPoint(const CCPoint&)\n\n @return The anchor point of node."]
    #[link_name = "\u{1}?getAnchorPoint@CCNode@cocos2d@@UAEABVCCPoint@2@XZ"]
    pub fn cocos2d_CCNode_getAnchorPoint(
        this: *mut ::std::os::raw::c_void,
    ) -> *const cocos2d_CCPoint;
}
extern "thiscall" {
    #[doc = " Returns the anchorPoint in absolute pixels.\n\n @warning You can only read it. If you wish to modify it, use anchorPoint instead.\n @see getAnchorPoint()\n\n @return The anchor point in absolute pixels."]
    #[link_name = "\u{1}?getAnchorPointInPoints@CCNode@cocos2d@@UAEABVCCPoint@2@XZ"]
    pub fn cocos2d_CCNode_getAnchorPointInPoints(
        this: *mut ::std::os::raw::c_void,
    ) -> *const cocos2d_CCPoint;
}
extern "thiscall" {
    #[doc = " Sets the untransformed size of the node.\n\n The contentSize remains the same no matter the node is scaled or rotated.\n All nodes has a size. Layer and Scene has the same size of the screen.\n\n @param contentSize   The untransformed size of the node."]
    #[link_name = "\u{1}?setContentSize@CCNode@cocos2d@@UAEXABVCCSize@2@@Z"]
    pub fn cocos2d_CCNode_setContentSize(
        this: *mut ::std::os::raw::c_void,
        contentSize: *const cocos2d_CCSize,
    );
}
extern "thiscall" {
    #[doc = " Returns the untransformed size of the node.\n\n @see setContentSize(const CCSize&)\n\n @return The untransformed size of the node."]
    #[link_name = "\u{1}?getContentSize@CCNode@cocos2d@@UBEABVCCSize@2@XZ"]
    pub fn cocos2d_CCNode_getContentSize(
        this: *mut ::std::os::raw::c_void,
    ) -> *const cocos2d_CCSize;
}
extern "thiscall" {
    #[link_name = "\u{1}?getScaledContentSize@CCNode@cocos2d@@UAE?AVCCSize@2@XZ"]
    pub fn cocos2d_CCNode_getScaledContentSize(this: *mut ::std::os::raw::c_void)
        -> cocos2d_CCSize;
}
extern "thiscall" {
    #[doc = " Sets whether the node is visible\n\n The default value is true, a node is default to visible\n\n @param visible   true if the node is visible, false if the node is hidden."]
    #[link_name = "\u{1}?setVisible@CCNode@cocos2d@@UAEX_N@Z"]
    pub fn cocos2d_CCNode_setVisible(this: *mut ::std::os::raw::c_void, visible: bool);
}
extern "thiscall" {
    #[doc = " Determines if the node is visible\n\n @see setVisible(bool)\n\n @return true if the node is visible, false if the node is hidden."]
    #[link_name = "\u{1}?isVisible@CCNode@cocos2d@@UAE_NXZ"]
    pub fn cocos2d_CCNode_isVisible(this: *mut ::std::os::raw::c_void) -> bool;
}
extern "thiscall" {
    #[doc = " Sets the rotation (angle) of the node in degrees.\n\n 0 is the default rotation angle.\n Positive values rotate node clockwise, and negative values for anti-clockwise.\n\n @param fRotation     The roration of the node in degrees."]
    #[link_name = "\u{1}?setRotation@CCNode@cocos2d@@UAEXM@Z"]
    pub fn cocos2d_CCNode_setRotation(this: *mut ::std::os::raw::c_void, fRotation: f32);
}
extern "thiscall" {
    #[doc = " Returns the rotation of the node in degrees.\n\n @see setRotation(float)\n\n @return The rotation of the node in degrees."]
    #[link_name = "\u{1}?getRotation@CCNode@cocos2d@@UAEMXZ"]
    pub fn cocos2d_CCNode_getRotation(this: *mut ::std::os::raw::c_void) -> f32;
}
extern "thiscall" {
    #[doc = " Sets the X rotation (angle) of the node in degrees which performs a horizontal rotational skew.\n\n 0 is the default rotation angle.\n Positive values rotate node clockwise, and negative values for anti-clockwise.\n\n @param fRotationX    The X rotation in degrees which performs a horizontal rotational skew."]
    #[link_name = "\u{1}?setRotationX@CCNode@cocos2d@@UAEXM@Z"]
    pub fn cocos2d_CCNode_setRotationX(this: *mut ::std::os::raw::c_void, fRotaionX: f32);
}
extern "thiscall" {
    #[doc = " Gets the X rotation (angle) of the node in degrees which performs a horizontal rotation skew.\n\n @see setRotationX(float)\n\n @return The X rotation in degrees."]
    #[link_name = "\u{1}?getRotationX@CCNode@cocos2d@@UAEMXZ"]
    pub fn cocos2d_CCNode_getRotationX(this: *mut ::std::os::raw::c_void) -> f32;
}
extern "thiscall" {
    #[doc = " Sets the Y rotation (angle) of the node in degrees which performs a vertical rotational skew.\n\n 0 is the default rotation angle.\n Positive values rotate node clockwise, and negative values for anti-clockwise.\n\n @param fRotationY    The Y rotation in degrees."]
    #[link_name = "\u{1}?setRotationY@CCNode@cocos2d@@UAEXM@Z"]
    pub fn cocos2d_CCNode_setRotationY(this: *mut ::std::os::raw::c_void, fRotationY: f32);
}
extern "thiscall" {
    #[doc = " Gets the Y rotation (angle) of the node in degrees which performs a vertical rotational skew.\n\n @see setRotationY(float)\n\n @return The Y rotation in degrees."]
    #[link_name = "\u{1}?getRotationY@CCNode@cocos2d@@UAEMXZ"]
    pub fn cocos2d_CCNode_getRotationY(this: *mut ::std::os::raw::c_void) -> f32;
}
extern "thiscall" {
    #[doc = " Sets the arrival order when this node has a same ZOrder with other children.\n\n A node which called addChild subsequently will take a larger arrival order,\n If two children have the same Z order, the child with larger arrival order will be drawn later.\n\n @warning This method is used internally for zOrder sorting, don't change this manually\n\n @param uOrderOfArrival   The arrival order."]
    #[link_name = "\u{1}?setOrderOfArrival@CCNode@cocos2d@@UAEXI@Z"]
    pub fn cocos2d_CCNode_setOrderOfArrival(
        this: *mut ::std::os::raw::c_void,
        uOrderOfArrival: ::std::os::raw::c_uint,
    );
}
extern "thiscall" {
    #[doc = " Returns the arrival order, indecates which children is added previously.\n\n @see setOrderOfArrival(unsigned int)\n\n @return The arrival order."]
    #[link_name = "\u{1}?getOrderOfArrival@CCNode@cocos2d@@UAEIXZ"]
    pub fn cocos2d_CCNode_getOrderOfArrival(
        this: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uint;
}
extern "thiscall" {
    #[doc = " Sets the state of OpenGL server side.\n\n @param glServerState     The state of OpenGL server side.\n @js NA"]
    #[link_name = "\u{1}?setGLServerState@CCNode@cocos2d@@UAEXW4ccGLServerState@2@@Z"]
    pub fn cocos2d_CCNode_setGLServerState(
        this: *mut ::std::os::raw::c_void,
        glServerState: cocos2d_ccGLServerState,
    );
}
extern "thiscall" {
    #[doc = " Returns the state of OpenGL server side.\n\n @return The state of OpenGL server side.\n @js NA"]
    #[link_name = "\u{1}?getGLServerState@CCNode@cocos2d@@UAE?AW4ccGLServerState@2@XZ"]
    pub fn cocos2d_CCNode_getGLServerState(
        this: *mut ::std::os::raw::c_void,
    ) -> cocos2d_ccGLServerState;
}
extern "thiscall" {
    #[doc = " Sets whether the anchor point will be (0,0) when you position this node.\n\n This is an internal method, only used by CCLayer and CCScene. Don't call it outside framework.\n The default value is false, while in CCLayer and CCScene are true\n\n @param ignore    true if anchor point will be (0,0) when you position this node\n @todo This method shoud be renamed as setIgnoreAnchorPointForPosition(bool) or something with \"set\""]
    #[link_name = "\u{1}?ignoreAnchorPointForPosition@CCNode@cocos2d@@UAEX_N@Z"]
    pub fn cocos2d_CCNode_ignoreAnchorPointForPosition(
        this: *mut ::std::os::raw::c_void,
        ignore: bool,
    );
}
extern "thiscall" {
    #[doc = " Gets whether the anchor point will be (0,0) when you position this node.\n\n @see ignoreAnchorPointForPosition(bool)\n\n @return true if the anchor point will be (0,0) when you position this node."]
    #[link_name = "\u{1}?isIgnoreAnchorPointForPosition@CCNode@cocos2d@@UAE_NXZ"]
    pub fn cocos2d_CCNode_isIgnoreAnchorPointForPosition(this: *mut ::std::os::raw::c_void)
        -> bool;
}
extern "thiscall" {
    #[doc = " Adds a child to the container with z-order as 0.\n\n If the child is added to a 'running' node, then 'onEnter' and 'onEnterTransitionDidFinish' will be called immediately.\n\n @param child A child node"]
    #[link_name = "\u{1}?addChild@CCNode@cocos2d@@UAEXPAV12@@Z"]
    pub fn cocos2d_CCNode_addChild(this: *mut ::std::os::raw::c_void, child: *mut cocos2d_CCNode);
}
extern "thiscall" {
    #[doc = " Adds a child to the container with a z-order\n\n If the child is added to a 'running' node, then 'onEnter' and 'onEnterTransitionDidFinish' will be called immediately.\n\n @param child     A child node\n @param zOrder    Z order for drawing priority. Please refer to setZOrder(int)"]
    #[link_name = "\u{1}?addChild@CCNode@cocos2d@@UAEXPAV12@H@Z"]
    pub fn cocos2d_CCNode_addChild1(
        this: *mut ::std::os::raw::c_void,
        child: *mut cocos2d_CCNode,
        zOrder: ::std::os::raw::c_int,
    );
}
extern "thiscall" {
    #[doc = " Adds a child to the container with z order and tag\n\n If the child is added to a 'running' node, then 'onEnter' and 'onEnterTransitionDidFinish' will be called immediately.\n\n @param child     A child node\n @param zOrder    Z order for drawing priority. Please refer to setZOrder(int)\n @param tag       A interger to identify the node easily. Please refer to setTag(int)"]
    #[link_name = "\u{1}?addChild@CCNode@cocos2d@@UAEXPAV12@HH@Z"]
    pub fn cocos2d_CCNode_addChild2(
        this: *mut ::std::os::raw::c_void,
        child: *mut cocos2d_CCNode,
        zOrder: ::std::os::raw::c_int,
        tag: ::std::os::raw::c_int,
    );
}
extern "thiscall" {
    #[doc = " Gets a child from the container with its tag\n\n @param tag   An identifier to find the child node.\n\n @return a CCNode object whose tag equals to the input parameter"]
    #[link_name = "\u{1}?getChildByTag@CCNode@cocos2d@@UAEPAV12@H@Z"]
    pub fn cocos2d_CCNode_getChildByTag(
        this: *mut ::std::os::raw::c_void,
        tag: ::std::os::raw::c_int,
    ) -> *mut cocos2d_CCNode;
}
extern "thiscall" {
    #[doc = " Return an array of children\n\n Composing a \"tree\" structure is a very important feature of CCNode\n Here's a sample code of traversing children array:\n @code\n CCNode* node = NULL;\n CCARRAY_FOREACH(parent->getChildren(), node)\n {\n     node->setPosition(0,0);\n }\n @endcode\n This sample code traverses all children nodes, and set theie position to (0,0)\n\n @return An array of children"]
    #[link_name = "\u{1}?getChildren@CCNode@cocos2d@@UAEPAVCCArray@2@XZ"]
    pub fn cocos2d_CCNode_getChildren(this: *mut ::std::os::raw::c_void) -> *mut cocos2d_CCArray;
}
extern "thiscall" {
    #[doc = " Get the amount of children.\n\n @return The amount of children."]
    #[link_name = "\u{1}?getChildrenCount@CCNode@cocos2d@@UBEIXZ"]
    pub fn cocos2d_CCNode_getChildrenCount(
        this: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uint;
}
extern "thiscall" {
    #[doc = " Sets the parent node\n\n @param parent    A pointer to the parnet node"]
    #[link_name = "\u{1}?setParent@CCNode@cocos2d@@UAEXPAV12@@Z"]
    pub fn cocos2d_CCNode_setParent(this: *mut ::std::os::raw::c_void, parent: *mut cocos2d_CCNode);
}
extern "thiscall" {
    #[doc = " Returns a pointer to the parent node\n\n @see setParent(CCNode*)\n\n @returns A pointer to the parnet node"]
    #[link_name = "\u{1}?getParent@CCNode@cocos2d@@UAEPAV12@XZ"]
    pub fn cocos2d_CCNode_getParent(this: *mut ::std::os::raw::c_void) -> *mut cocos2d_CCNode;
}
extern "thiscall" {
    #[doc = " Removes this node itself from its parent node with a cleanup.\n If the node orphan, then nothing happens.\n @see removeFromParentAndCleanup(bool)"]
    #[link_name = "\u{1}?removeFromParent@CCNode@cocos2d@@UAEXXZ"]
    pub fn cocos2d_CCNode_removeFromParent(this: *mut ::std::os::raw::c_void);
}
extern "thiscall" {
    #[doc = " Removes this node itself from its parent node.\n If the node orphan, then nothing happens.\n @param cleanup   true if all actions and callbacks on this node should be removed, false otherwise.\n @js removeFromParent"]
    #[link_name = "\u{1}?removeFromParentAndCleanup@CCNode@cocos2d@@UAEX_N@Z"]
    pub fn cocos2d_CCNode_removeFromParentAndCleanup(
        this: *mut ::std::os::raw::c_void,
        cleanup: bool,
    );
}
extern "thiscall" {
    #[link_name = "\u{1}?removeMeAndCleanup@CCNode@cocos2d@@UAEXXZ"]
    pub fn cocos2d_CCNode_removeMeAndCleanup(this: *mut ::std::os::raw::c_void);
}
extern "thiscall" {
    #[doc = " Removes a child from the container with a cleanup\n\n @see removeChild(CCNode, bool)\n\n @param child     The child node which will be removed."]
    #[link_name = "\u{1}?removeChild@CCNode@cocos2d@@UAEXPAV12@@Z"]
    pub fn cocos2d_CCNode_removeChild(
        this: *mut ::std::os::raw::c_void,
        child: *mut cocos2d_CCNode,
    );
}
extern "thiscall" {
    #[doc = " Removes a child from the container. It will also cleanup all running actions depending on the cleanup parameter.\n\n @param child     The child node which will be removed.\n @param cleanup   true if all running actions and callbacks on the child node will be cleanup, false otherwise."]
    #[link_name = "\u{1}?removeChild@CCNode@cocos2d@@UAEXPAV12@_N@Z"]
    pub fn cocos2d_CCNode_removeChild1(
        this: *mut ::std::os::raw::c_void,
        child: *mut cocos2d_CCNode,
        cleanup: bool,
    );
}
extern "thiscall" {
    #[doc = " Removes a child from the container by tag value with a cleanup.\n\n @see removeChildByTag(int, bool)\n\n @param tag       An interger number that identifies a child node"]
    #[link_name = "\u{1}?removeChildByTag@CCNode@cocos2d@@UAEXH@Z"]
    pub fn cocos2d_CCNode_removeChildByTag(
        this: *mut ::std::os::raw::c_void,
        tag: ::std::os::raw::c_int,
    );
}
extern "thiscall" {
    #[doc = " Removes a child from the container by tag value. It will also cleanup all running actions depending on the cleanup parameter\n\n @param tag       An interger number that identifies a child node\n @param cleanup   true if all running actions and callbacks on the child node will be cleanup, false otherwise."]
    #[link_name = "\u{1}?removeChildByTag@CCNode@cocos2d@@UAEXH_N@Z"]
    pub fn cocos2d_CCNode_removeChildByTag1(
        this: *mut ::std::os::raw::c_void,
        tag: ::std::os::raw::c_int,
        cleanup: bool,
    );
}
extern "thiscall" {
    #[doc = " Removes all children from the container with a cleanup.\n\n @see removeAllChildrenWithCleanup(bool)"]
    #[link_name = "\u{1}?removeAllChildren@CCNode@cocos2d@@UAEXXZ"]
    pub fn cocos2d_CCNode_removeAllChildren(this: *mut ::std::os::raw::c_void);
}
extern "thiscall" {
    #[doc = " Removes all children from the container, and do a cleanup to all running actions depending on the cleanup parameter.\n\n @param cleanup   true if all running actions on all children nodes should be cleanup, false oterwise.\n @js removeAllChildren"]
    #[link_name = "\u{1}?removeAllChildrenWithCleanup@CCNode@cocos2d@@UAEX_N@Z"]
    pub fn cocos2d_CCNode_removeAllChildrenWithCleanup(
        this: *mut ::std::os::raw::c_void,
        cleanup: bool,
    );
}
extern "thiscall" {
    #[doc = " Reorders a child according to a new z value.\n\n @param child     An already added child node. It MUST be already added.\n @param zOrder    Z order for drawing priority. Please refer to setZOrder(int)"]
    #[link_name = "\u{1}?reorderChild@CCNode@cocos2d@@UAEXPAV12@H@Z"]
    pub fn cocos2d_CCNode_reorderChild(
        this: *mut ::std::os::raw::c_void,
        child: *mut cocos2d_CCNode,
        zOrder: ::std::os::raw::c_int,
    );
}
extern "thiscall" {
    #[doc = " Sorts the children array once before drawing, instead of every time when a child is added or reordered.\n This appraoch can improves the performance massively.\n @note Don't call this manually unless a child added needs to be removed in the same frame"]
    #[link_name = "\u{1}?sortAllChildren@CCNode@cocos2d@@UAEXXZ"]
    pub fn cocos2d_CCNode_sortAllChildren(this: *mut ::std::os::raw::c_void);
}
extern "thiscall" {
    #[doc = " Returns a grid object that is used when applying effects\n\n @return A CCGrid object that is used when applying effects\n @js NA"]
    #[link_name = "\u{1}?getGrid@CCNode@cocos2d@@UAEPAVCCGridBase@2@XZ"]
    pub fn cocos2d_CCNode_getGrid(this: *mut ::std::os::raw::c_void) -> *mut cocos2d_CCGridBase;
}
extern "thiscall" {
    #[doc = " Changes a grid object that is used when applying effects\n\n @param A CCGrid object that is used when applying effects"]
    #[link_name = "\u{1}?setGrid@CCNode@cocos2d@@UAEXPAVCCGridBase@2@@Z"]
    pub fn cocos2d_CCNode_setGrid(
        this: *mut ::std::os::raw::c_void,
        pGrid: *mut cocos2d_CCGridBase,
    );
}
extern "thiscall" {
    #[doc = " Returns a custom user data pointer\n\n You can set everything in UserData pointer, a data block, a structure or an object.\n\n @return A custom user data pointer\n @js NA"]
    #[link_name = "\u{1}?getUserData@CCNode@cocos2d@@UAEPAXXZ"]
    pub fn cocos2d_CCNode_getUserData(
        this: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "thiscall" {
    #[doc = " Sets a custom user data pointer\n\n You can set everything in UserData pointer, a data block, a structure or an object, etc.\n @warning Don't forget to release the memroy manually,\n          especially before you change this data pointer, and before this node is autoreleased.\n\n @return A custom user data pointer\n @js NA"]
    #[link_name = "\u{1}?setUserData@CCNode@cocos2d@@UAEXPAX@Z"]
    pub fn cocos2d_CCNode_setUserData(
        this: *mut ::std::os::raw::c_void,
        pUserData: *mut ::std::os::raw::c_void,
    );
}
extern "thiscall" {
